Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/redirects/Resources/Private/Language/*.locallang.xlf
Languages: fr, it

# redirects
source: Redirect Settings
fr: Paramètres de redirection
it: Impostazioni di Reindirizzamento

# redirects.autoUpdateSlugs
source: Update the slugs of all sub pages automatically
fr: Mettre à jour automatiquement les slugs de toutes les sous-pages
it: Aggiorna automaticamente i segmenti URL di tutte le sottopagine

# redirects.autoCreateRedirects
source: Create redirects for pages with a new slug automatically
fr: Créer automatiquement des redirections pour les pages avec un nouveau slug
it: Crea automaticamente reindirizzamenti, per le pagine, con un nuovo segmento URL

# redirects.redirectTTL
source: Time To Live of redirect records in days
fr: Durée de vie des entrées de redirection en jours
it: Durata reindirizzamenti dei record, in giorni

# redirects.httpStatusCode
source: HTTP Status Code for the redirect, 301 is the default
fr: Code de statut HTTP pour la redirection, 301 est la valeur par défaut
it: Codice Stato HTTP per il reindirizzamento, 301 è il predefinito

# cleanupRedirectsCommand.label.days
source: Cleanup redirects older than provided number of days
fr: Supprimer les redirections plus anciennes que le nombre de jours fourni
it: Elimina i reindirizzamenti più vecchi di giorni

# cleanupRedirectsCommand.label.domain
source: Cleanup redirects matching provided domain(s)
fr: Supprimer les redirections correspondant au(x) domaine(s) fourni(s)
it: Elimina i reindirizzamenti che corrispondono ai seguenti domini

# cleanupRedirectsCommand.label.hitCount
source: Cleanup redirects matching hit counts lower than given number
fr: Supprimer les redirections avec un nombre de hits inférieur au nombre donné
it: Elimina i reindirizzamenti con un numero di visite inferiore a

# cleanupRedirectsCommand.label.path
source: Cleanup redirects matching given path (as database like expression)
fr: Supprimer les redirections correspondant au chemin donné (utilise la syntaxe LIKE de la base de donnée)
it: Elimina reindirizzamenti corrispondenti al percorso specificato (come espressione simile a un database)

# cleanupRedirectsCommand.label.creationType
source: Cleanup redirects matching provided creation type
fr: Supprimer les redirections correspondant au mode de création choisi
it: Elimina i reindirizzamenti con la seguente origine

# cleanupRedirectsCommand.label.statusCode
source: Cleanup redirects matching provided status code(s)
fr: Nettoyer les redirections correspondant au(x) code(s) de statut fourni(s)
it: Elimina i reindirizzamenti con i seguenti codici stato

# cleanupRedirectsCommand.label.integrityStatus
source: Cleanup redirects matching provided integrity status
fr: Nettoyer les redirections correspondant au statut d'intégrité fourni
it: Elimina i reindirizzamenti corrispondenti allo stato di integrità fornito
