Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/redirects/Resources/Private/Language/*.locallang_module_redirect.xlf
Languages: ar, fr

# mlang_labels_tablabel
source: Redirect Administration
ar: إدارة إعادة التوجيه
fr: Administration des redirections

# mlang_labels_tabdescr
source: This is the administration area for Web Redirects.
ar: هذه هي منطقة إدارة عمليات إعادة توجيه الويب.
fr: C'est ici que vous administrer vos redirections.

# mlang_tabs_tab
source: Redirects
ar: إعادات التوجيه
fr: Redirections

# source_host_global_text
source: Global redirect (any domain)
ar: إعادة التوجيه العام (أي مجال)
fr: Redirection globale (n'importe quel domaine)

# heading_text
source: Redirect Management
ar: إدارة إعادة التوجيه
fr: Gestion des redirections

# redirect_add_text
source: Add redirect
ar: إضافة إعادة توجيه
fr: Ajouter une redirection

# redirect_not_found.title
source: No redirects found!
ar: لم يتم العثور على عمليات إعادة توجيه!
fr: Aucune redirection n'a été trouvée

# redirect_not_found.message
source: There are currently no redirect records found in the database.
ar: لا يوجد حاليّاً أيّة سجلات إعادة توجيه في قاعدة البيانات.
fr: Il n'y a actuellement aucune redirection enregistrée en base de données.

# redirect_create
source: Create new redirect
ar: إنشاء إعادة توجيه جديدة
fr: Créer une nouvelle redirection

# redirect_not_found_with_filter.title
source: No redirects found!
ar: لم يتم العثور على عمليات إعادة توجيه!
fr: Aucune redirection n'a été trouvée

# redirect_not_found_with_filter.message
source: With the current set of filters applied, no redirect could be found.
ar: مع تطبيق إعدادات التصفيات الحاليّة، لم يتم العثور على أيّة عمليات إعادة توجيه.
fr: Avec l'ensemble des filtres appliqués, aucune redirection n'a pu être trouvée.

# redirect_no_filter
source: Remove all filter
ar: إزالة كل عوامل التصفية
fr: Supprimer tous les filtres

# filter.source_host.showAll
source: Show All
ar: عرض الكل
fr: Afficher tout

# filter.targetStatusCode
source: Status Code
ar: رمز الحالة
fr: Code du statut

# filter.creationType
source: Creation type
ar: نوع الإنشاء
fr: Mode de création

# filter.creationType.showAll
source: Show All
ar: عرض الكل
fr: Afficher tout

# filter.protected
source: Protected
ar: مَحميْ
fr: Protégée

# filter.protected.showAll
source: Show All
ar: عرض الكل
fr: Afficher tout

# filter.protected.unprotected
source: unprotected
ar: غير مَحميْ
fr: non protégée

# filter.protected.protected
source: protected
ar: مَحميْ
fr: protégée

# filter.integrityStatus
source: Integrity status
ar: حالة السلامة
fr: Statut d'intégrité

# filter.integrityStatus.showAll
source: Show All
ar: عرض الكل
fr: Afficher tout

# filter.neverHit
source: Never hit
ar: لم يتم استدعاؤه أبداً
fr: Jamais visité

# filter.sendButton
source: Filter
ar: تصفية
fr: Filtrer

# filter.resetButton
source: Reset
ar: إعادة ضبط
fr: Réinitialiser

# record_disabled
source: Disabled
fr: Désactivé

# source_path.placeholder
source: /my-path/ or #^/my-path/$# (when regex enabled)
ar: /my-path/ أو #^/my-path/$# (عند تفعيل regex)
fr: /mon-chemin/ ou #^/mon-chemin/$# (quand regex est activé)

source: Page ID
ar: ID الصفحة
fr: ID de la page

# destination_status_code
source: Status Code
ar: رمز الحالة
fr: Code du statut

# hit_reset
source: Reset hit counter
fr: Réinitialiser le nombre d’accès

# hit_reset.confirm.title
source: Reset the hit counter of this record?
fr: Réinitialiser le nombre d’accès de cet enregistrement ?

# hit_reset.confirm.content
source: Are you sure you want to reset the hit counter of this record?
fr: Êtes-vous certain de vouloir réinitialiser le nombre d’accès de cet enregistrement ?

# hit_last_never
source: Never
ar: مُطْلقاً
fr: Jamais

# visit_destination
source: Go to
ar: اذهب إلى
fr: Aller à

source: View redirect
ar: عرض إعادة التوجيه
fr: Voir la redirection

# overview.tableHead.protected
source: Protected
fr: Protégé

# overview.tableField.protected.no
source: No
fr: Non

# overview.tableField.protected.yes
source: Yes
fr: Oui

# labels.delete.title
source: Delete redirects
ar: حذف عمليات إعادة التوجيه
fr: Supprimer les redirections

# labels.delete.message
source: Are you sure you want to delete all marked redirects?
ar: هل أنت متأكد من أنك تريد حذف جميع عمليات إعادة التوجيه المُحددة؟
fr: Êtes-vous sûr(e) de vouloir supprimer toutes les redirections sélectionnées ?
