Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/redirects/Resources/Private/Language/*.locallang_slug_service.xlf
Languages: ar, fr, it

# notification.slug_and_redirects.title
source: Slugs updated and redirects created
ar: تم تحديث الروابط النّصيّة وإنشاء عمليات إعادة التوجيه
fr: Slugs mis à jour et redirections créées
it: Segmenti aggiornati e reindirizzamenti creati

# notification.slug_and_redirects.message
source: Because you renamed a slug, the slugs of all sub-pages were updated and redirects were created for you automatically.
ar: نظرًا لأنك أعدت تسمية الرابط النَصّي، قد تم تحديث الروابِط النَّصِيَّة لجميع الصفحات الفرعية وتم إنشاء عمليات إعادة التوجيه لك تلقائيًا.
fr: Parce que vous avez renommé un slug, les slugs de toutes les sous-pages ont été mis à jour et les redirections ont été créées pour vous automatiquement.
it: Poiché hai rinominato un segmento, i segmenti di tutte le sottopagine sono stati aggiornati e i reindirizzamenti sono stati ricreati automaticamente per te.

# notification.slug_only.title
source: Slugs updated
ar: تم تحديث الروابِط النَّصِيَّة
fr: Slugs mis à jour
it: Segmenti aggiornati

# notification.slug_only.message
source: Because you renamed a slug, the slugs of all sub-pages were updated for you automatically.
ar: نظرًا لأنك أعدت تسمية الرابط النَصّي، قد تم تحديث الروابِط النَّصِيَّة لجميع الصفحات الفرعية لك تلقائيًا.
fr: Parce que vous avez renommé un slug, les slugs de toutes les sous-pages ont été mis à jour pour vous automatiquement.
it: Poiché hai rinominato un segmento, i segmenti di tutte le sottopagine sono stati aggiornati automaticamente per te.

# notification.redirects.button.revert_update
source: Revert update
ar: استعادة التحديث
fr: Annuler la mise à jour
it: Ripristina modifica

# notification.redirects.button.revert_redirect
source: Revert redirects only
ar: استعادة عمليات إعادة التوجيه فقط
fr: Annuler les redirections uniquement
it: Ripristina solo i reindirizzamenti

# redirects_error_title
source: An error occurred
ar: حدث خطأ ما
fr: Une erreur est survenue
it: Si è verificato un errore

# redirects_error_message
source: Sorry something went wrong.
ar: عُذرًا، لقد حدث خطأٌ ما.
fr: Désolé, une erreur s'est produite.
it: Ops! Qualcosa è andato storto.

# revert_update_success_title
source: Revert successful
ar: تمت الاستعادة بنجاح
fr: Récupération réussie
it: Ripristino riuscito

# revert_update_success_message
source: All slug changes of sub pages have been reverted.
ar: تمت استعادة جميع تغييرات الروابط النَصيّة للصفحات الفرعية.
fr: Tous les changements de slug des sous-pages ont été annulés.
it: Tutte le modifiche ai segmenti URL delle sottopagine sono state annullate.

# revert_redirects_success_title
source: Revert successful
ar: تمت الاستعادة بنجاح
fr: Récupération réussie
it: Ripristino riuscito

# revert_redirects_success_message
source: All created redirects have been reverted.
ar: تمت استعادة جميع عمليات إعادة التوجيه التي تم إنشاؤها.
fr: Toutes les redirections créées ont été annulées.
it: Tutti i reindirizzamenti creati sono stati ripristinati.
