Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/redirects/Resources/Private/Language/*.locallang_db.xlf
Languages: ar, it

# sys_redirect
source: Redirect
ar: إعادة توجيه
it: Reindirizzamento

# sys_redirect.source_host
source: Source Domain
ar: نطاق المصدر
it: Dominio Origine

# sys_redirect.source_path
source: Source Path
ar: مسار المصدر
it: Percorso Origine

# sys_redirect.force_https
source: SSL Redirect
ar: إعادة توجيه SSL
it: Reindirizzamento SSL

# sys_redirect.force_https.0
source: Force SSL Redirect
ar: فرض إعادة توجيه SSL
it: Forza SSL

# sys_redirect.keep_query_parameters
source: GET Parameters
ar: معلّمات الاستعلام GET
it: Parametri GET

# sys_redirect.keep_query_parameters.0
source: Keep GET Parameters
ar: الاحتفاظ بمعلّمات الاستعلام GET
it: Preserva Parametri GET

# sys_redirect.respect_query_parameters
source: GET Parameters (source)
ar: معلّمات الاستعلام GET (المصدر)
it: Parametri GET (origine)

# sys_redirect.respect_query_parameters.0
source: Respect GET Parameters
ar: احترام معلمات الاستعلام GET
it: Preserva Parametri GET

# sys_redirect.target
source: Target
ar: الهدف
it: Destinazione

# sys_redirect.target_statuscode
source: Status Code HTTP Header
ar: رمز حالة HTTP
it: Codice di Stato Intestazione HTTP

# sys_redirect.target_statuscode.301
source: 301 Moved Permanently
ar: 301 تم نقله بشكل دائم
it: 301 Spostato Permanentemente

# sys_redirect.target_statuscode.302
source: 302 Found
ar: 302 تم العثور
it: 302 Trovato

# sys_redirect.target_statuscode.303
source: 303 See Other
ar: 303 انظر أخرى
it: 303 Vedi Altro

# sys_redirect.target_statuscode.307
source: 307 Temporary Redirect
ar: 307 إعادة التوجيه المؤقت
it: 307 Reindirizzamento Temporaneo

# sys_redirect.target_statuscode.308
source: 308 Permanent Redirect
ar: 308 إعادة التوجيه الدائم
it: 308 Reindirizzamento Permanente

# sys_redirect.target_statuscode.keep
source: Keep HTTP method
ar: الاحتفاظ بطريقة طلب الـ HTTP
it: Mantieni metodo HTTP

# sys_redirect.target_statuscode.change
source: Change HTTP method to GET
ar: تغيير طريقة الطلب إلى GET
it: Cambia il metodo HTTP in GET

# sys_redirect.hitcount
source: Hit count
it: Contatore occorrenze

# sys_redirect.lasthiton
source: Last Hit on
ar: آخر ضربة في
it: Ultima visita il

# sys_redirect.hitcountState
source: Hit Counter
ar: عدّاد الضَغْطات
it: Conteggio Visite

# sys_redirect.disable_hitcount
source: Disable Hit Counter
ar: تعطيل عدّاد الضَغْطات
it: Disabilita Conteggio Visite

# sys_redirect.disable_hitcount.0
source: Disable
ar: تعطيل
it: Disabilita

# tabs.redirectCount
source: Statistics
ar: الإحصائيات
it: Stastiche

# sys_redirect.protected
source: Protected
ar: محمي
it: Protetto

# sys_redirect.protected
source: When enabled, this redirect will be skipped by scheduled cleanup tasks that might delete redirects under certain conditions.
ar: عند التمكين، سيتم تخطي إعادة التوجيه هذه عند تنفيذ مهام التنظيف المجدولة التي قد تحذف عمليات إعادة التوجيه تحت شروط معينة.
it: Se abilitato, questo reindirizzamento verrà saltato da attività di pulizia pianificate che potrebbero eliminare reindirizzamenti in determinate condizioni.

# sys_redirect.is_regexp
source: Is regular expression?
ar: هل هذا تعبير منتظم؟
it: Interpreta come Espressione Regolare

# sys_redirect.is_regexp.0
source: Yes
ar: نعم
it: Sì

# sys_redirect.disabled
source: Disable
ar: تعطيل
it: Disabilita

# sys_redirect.disabled.0
source: Deactivate redirect
ar: تعطيل إعادة التوجيه
it: Disattiva il reindirizzamento

# sys_redirect.creation_type
source: Creation Type
ar: نوع الإنشاء
it: Origine

# sys_redirect.creation_type.1
source: manually created
ar: تم إنشاؤها يدوياً
it: creato manualmente

# sys_redirect.creation_type.0
source: automatically created
ar: تم إنشاؤها تلقائيّاً
it: creato automaticamente

# sys_redirect.webhook_type.typo3-redirect-was-hit
source: ... when a redirect has been hit
ar: ... عندما يتم الوصول إلى إعادة التوجيه
it: quando un reindirizzamento è stato effettuato

# sys_redirect.integrity_status
source: Integrity status
ar: حالة النـزاهة
it: Stato di integrità

# sys_redirect.integrity_status.description
source: Redirects can be checked via the command redirects:checkintegrity.
ar: يمكن التحقق من إعادة التوجيه عن طريق الأمر إعادة redirects:checkintegrity.
it: I reindirizzamenti possono essere controllati tramite il comando redirects:checkintegrity.

# sys_redirect.integrity_status.no_conflict
source: No conflict
ar: لاتوجد تعارضات
it: Nessun conflitto

# sys_redirect.integrity_status.self_reference
source: Self reference
ar: المرجع الذاتي
it: Autoriferimento
