Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_fe_groups.xlf
Languages: ar, fr

# hidden.description
source: This option enables the user group.
ar: هذا الخِيار لتفعيل مجموعة المُستخدمين.
fr: Cette option active le groupe d'utilisateurs.

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them. For instance if a page or content element was assigned access only by this group and you disable the group, no one would gain access to that page or content element.
ar: ما إن تم إلغاء مجموعة المستخدم فلا يصبح أحد من أعضاء هذه المجموعة التمتع بأي الخصائص التي منحتها لهم هذه المجموعة. فعلى سبيل المثال إذا كات المجموعة لها إمكانية الدخول على صفحة ما أو عنصر محتوى معين فإنه مجرد إلغاء المجموعة لا يستطيع أى من الأعضاء الدخول على هذه الصفحة أو على هذا العنصر مرة أخرى.
fr: Si vous désactivez un groupe d'utilisateurs, tous les membres de ce groupe n'hériteront plus d'aucune propriétés que ce groupe leur attribuait. Par exemple, si l'accès à une page ou un contenu était restreint à ce groupe et que vous le désactivez, aucun membre du groupe n'aura accès à cette page ou à ce contenu.

# _hidden.seeAlso
source: fe_users:disable
ar: fe_users:تعطيل

# title.description
source: Name of the group.
ar: تسمية المموعة
fr: Nom du groupe.

# title.details
source: This title will appear as the group name in the 'Access'-list in other records.
ar: يظهر هذا العنوان عند تسمية المحموعة في قائمة الدخول في مجموعة أخرى من السجلات.
fr: Ce titre apparaîtra comme le nom du groupe dans la "liste d'accès" dans les autres enregistrements.

# subgroup.description
source: Member of other groups.
ar: عضو في مجموعات أخرى.
fr: Membre d'autres groupes.

# subgroup.details
source: List of other groups that this group is a member of.
ar: قائمة بالمجموعات الأُخرى التي تنتمي إليها هذه المجموعة.
fr: Liste des groupes dont ce groupe fait parti.

# description.description
source: Enter a description of the group.
ar: إدخال توصيف للصفحة
fr: Entrez une description du groupe.

# description.details
source: This is for internal use and is just a way to put a note on what the group is for, why you created it and who should be members. Use it as you like.
ar: تستخدم هذه الخاصية في حالة الأستخدام الداخلى وفي حالة إضافة ملاحظات عن المجموعة ما هو إختصاصاها و لماذا أنشأت و من يمكنة الإنضمام لها. يمكنك استخدام هذه الخاصية كيفما شئت.
fr: Ceci est pour une utilisation interne et est une façon de mettre une annotation sur ce à quoi est déstiné ce groupe, pourquoi vous l'avez créer et qui doit en faire partie. Utilisez le comme bon vous semble.

# TSconfig.description
source: TSconfig for the group (advanced).
ar: TSconfig لتوصيف المجموعات ( المتقدمة).
fr: TSconfig du groupe (avancé).

# TSconfig.details
source: This is the user TSconfig for the group. The values are inherited by any Website user who is a member of this group. The configuration is subject to being overridden in other groups and by the TSconfig of the user himself.
ar: كل مستخدم في المجموعة له TSconfig.فالمعطيات يمكن أن تورث من أي مستخدم للوب و عضو في المجموعة. وخاصية التوصيف يمكن للمجموعات الأخرى أن تتجاوزها و كذلك بواسطة TSconfig الخاص بالمستخدم نفسه.
fr: C'est la TS config pour le groupe. Les valeurs se propagent à tous les membres de ce groupe. Cette configuration peut être écrasée par la configuration TSconfig de l'utilisateur lui-même.

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
ar: تركيب مخطوطة تيبو الخاصة دون أي شروط أو ثوابت.
fr: Syntaxe TypoScript, sans conditions ni constantes.

# .description
source: Usergroups for Website users.
ar: مجموعات المستخدمين لمستخدمي الوب
fr: Groupe utilsateur pour les membres.

# .details
source: The access restriction in TYPO3 is assigned to these usergroups. When a page or other element is access restricted to a group, only Website users which are members of that group will be able to view the element on the website.
ar: تم تقييد الوُصول في TYPO3 لمجموعات المستخدمين هذه. عندما تكون صفحة أو عنصر ما، مُقيّد الوصول إليه باستثناء مجموعة مُستخدمين ما، فإن أعضاء هذه المجموعة فقط سيتمكنون من رؤية وعرض هذه الصفحة أو العنصر على موقع الويب.
fr: Les restrictions d'accès dans TYPO3 sont attribuées à ces groupes. Quand une page ou tout autre élément est restreint à un groupe, alors seuls les membres de ce groupe auront la possibilité de visualiser cet élément sur le site.

# _.seeAlso
source: fe_users, About access restricting pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/
ar: fe_users, للمزيد حول تقييد الوصول إلى الصفحات | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/
fr: fe_users, A propos des restrictions d'accès aux pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/

# .image_descr
source: The form for editing frontend users groups. Pages, Content Elements and other records for frontend display often have a selector box where you can define access restriction by selecting access for a certain group only.
ar: هناك صياغة خاصة لتحرير مجموعات المستخدمين الأمامية.فغالباً ما يكون للصفحات،عناصر المحتوى،وأى سجلات أخرى تحتوي على صندوق إختيار حيث يمكن تحديد عملية تقيد الدخول وذلك بقصر عملية الدخول على مجموعة واحدة بعينها.
fr: Le formulaire pour modifier les groupes d'utilisateurs frontend. Les pages, éléments de contenu et autres documents pour l'affichage frontend ont souvent un sélecteur où vous pouvez définir des restrictions d'accès en réservant l'accès à un groupe particulier.
