Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_systmpl.xlf
Languages: ar, fr, it

# .description
source: TypoScript template record.
ar: سجل نموذج منظومة تيبو الخاصة.
fr: Enregistrement de gabarit TypoScript.
it: Record Template TypoScript.

# .details
source: The 'Template' records are the vital components used to set the design of the webpages. No matter how (almost) you would like to build your website, it must be initiated by a 'Template' record placed in the root of the page tree of the site. Basically, create a 'Template' record, enter a title and make sure to check of Clear constants, setup and Rootline. Then enter some TypoScript configuration in the Setup field and you're set. It's very important to read how to do all this in the documents listed below! Also make sure you use the Web>Template module to do all the working with templates. It's a specialized tool to help you with this.
ar: تعد سجلات ‘النموذج‘ من المكونات الحيويةالمستخدمة في ضبط تصميم صفحات الوب.ليست القضية (تقريبا)هي كيف تحب أن تنشئ صفحة الوب الخاصة بك ‘ولكن لابد و أن تكون هذه الصفحة مبتدئة بسجل ’النموذج’ الموضوع في جذر شجرة الصفحة الخاصة بالموقع.وبصفة أساسية لإنشاء سجل‘نموذج‘إدخل عنوان وتأكدمن مراجعة الثوابت الواضحة ،التنظيم و خط الجذر.ثم قم بعملة الضبط لمخطوطة تيبو الخاصة في كل من الخانة المعدة و التي قمنت أنت بإنشاءها. وانه من الأهمية قراءة كيف يمكنك عمل كل ذلك من خلال الوثائق المدرجة بالأسفل!كما عليك بأن تتأكد من إستخدام الوب>الخاص بوحدة النوذج لأداء كل العمليات الخاصة بالنماذج.فهي وسائل خاصة تساعدك لعى عمل ذلك.
fr: Les archives "Gabarit" sont les composants essentiels utilisés pour mettre en place le design des pages web. Peu importe (ou presque) la manière dont vous voulez créer votre site web, cela doit être initié par une archive "Gabarit" placée à la racine de l'arborescence de votre site.Fondamentalement, créez une archive "Gabarit", entrez un titre et assurez-vous de vérifier les constantes claires, installation et la ligne de la racine. Entrez ensuite des configurations TypoScript dans le champ Installation et vous êtes prêts. Il est très important de lire comment faire tout cela dans les documents listés ci-dessous. Assurez-vous également que vous utilisez le module Web>gabarit pour faire tout ce travail avec les gabarits. C'est un outil spécialisé pour vous aider dans cette tâche.
it: I record 'Template' sono i componenti vitali utilizzati per impostare la progettazione delle pagine web. Non importa come desideri costruire il tuo sito web, deve essere inizializzato da un record 'Template', salvato nella root dell'Albero delle Pagine del sito. In pratica, crei un record 'Template', inserisci un titolo e assicurati di spuntare "Azzera::Costanti", "Azzera::Configurazione" e attivare "Livello Root". Poi inserisci il tuo TypoScript nel campo Configurazione e il gioco è fatto. È molto importante leggere come fare tutto questo, nella documentazione di seguito elencata! Assicurati anche di utilizzare il modulo Web>Template per fare tutto il lavoro con i Template. È uno strumento dedicato, per aiutarti.

# _.seeAlso
source: static_template TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ TypoScript in 45 min| https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/
fr: static_template TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ TypoScript en 45 min| https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/
it: static_template TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ TypoScript in 45 minuti https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/

# .image_descr
source: A Template Record with constants and setup code. The Web>Template module contains tools which will help you to edit and validate TypoScript structures.
ar: سجلات النموذج المحتويه على ثوابت و إعداد الكود.تحتوي وحدة Web>Template على الأدوات التى تساعدك على تحرير و تصحيح أبنية مخطوطة تيبو الخاصة.
fr: Une archive de gabarit avec des constantes et un code d'installation.Le module Web>gabarit contient des outils qui vous aideront à éditer et valider les structures TypoScript.
it: Un record Template con codice TypoScript per Costanti e Configurazione. Il modulo Web>Template contiene strumenti che ti aiuteranno a modificare e convalidare le strutture TypoScript.

# hidden.description
source: Unchecking this option will deactivate the template record.
ar: إلغاء تحديد هذا الخِيار سيؤدي إلى تعطيل سجل القالب.
fr: Décocher cette option désactivera le gabarit.
it: Deselezionando quest'opzione disattiverà il record Template.

# hidden.details
source: If the Template Record was the first record on a page hiding it will expose the second record on the page instead.
ar: وإذا ما كان سجل النموذج هو أول سجل مخفى في الصفحة فسيظهر الصفحة السجل الثاني عوضا عنه.
fr: Si l'archive de gabarit était la première archive de la page, la cacher va exposer la seconde archive sur la place à la place.
it: Se il record Template disabilitato è il primo record su una pagina, implicherà che il primo Template eseguito da TYPO3, sarà il secondo (il successivo a quello disabilitato) record sulla pagina.

# starttime.description
source: Start time. Use this to enable a template on a certain date.
ar: استخدم و قت البداية لتظهر النموذج على صفحة ما.
fr: Date de début. Utiliser cela pour activer le gabarit à une certaine date.
it: Campo Inizio: usa questo per abilitare il Template in una certa data.

# endtime.description
source: End time. Use this to disable a template on a certain date.
ar: استخدم وقت النهاية لإلغاء لانموذج من صفحة ما.
fr: Date de fin. Utiliser cela pour désactiver le gabarit à une certaine date.
it: Campo Fine: usa questo campo per disabilitare il Template in una certa data.

# title.description
source: The title of the template record is only an internal label and does not have any effect on the output in the frontend.
ar: ييعتبر عنوان نموذج السجل شارة داخلية فقط لا ـاثير لها على خرج الجهة الأمامية.
fr: Le titre de l'archive du gabarit est une étiquette interne et n'a pas d'effet sur la restitution dans le frontend.
it: Il titolo del record Template è solo un'etichetta interna e non ha alcun effetto nel frontend.

# constants.description
source: TypoScript Constants.
ar: ثوابت مخطوطة تيبو الخاصة.
fr: Constantes du TypoScript.
it: Costanti TypoScript.

# config.description
source: TypoScript Setup code
ar: كود تنظيم مخطوطة تيبو الخاصة.
fr: Code d'installation du TypoScript.
it: Codice TypoScript di Configurazione

# config.details
source: Read more about TypoScript Templates in TSref, TypoScript by Example and Getting Started.
ar: إقرا مزيد عن نماذج تيبو الخاصة والموجودة في TSref, مخطوطة تيبو الخاصة و إستعد للبدء.
fr: En lire davantage sur les gabarits de TypoScript en TSref, "Le TypoScript en Exemples" et "Mise en route".
it: Per saperne di più sui Template TypoScript leggi "TSref", "TypoScript by Example" e "Getting Started".

# _config.seeAlso
source: static_template:config, TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ Getting Started | https://docs.typo3.org/typo3cms/GettingStartedTutorial/ TypoScript in 45 min| https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/ TypoScript Syntax | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/
fr: static_template:config, TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ Pour commencer | https://docs.typo3.org/typo3cms/GettingStartedTutorial/ TypoScript en 45 min| https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/ Syntaxe TypoScript | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/
it: static_template:config, Guida di riferimento TypoScript - TSref | https://docs.typo3.org/typo3cms/TyposcriptReference/ Per iniziare | https://docs.typo3.org/typo3cms/GettingStartedTutorial/ TypoScript in 45 min| https://docs.typo3.org/typo3cms/TyposcriptIn45MinutesTutorial/ La sintassi di TypoScript | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/

# resources.description
source: Resource files for the template. For example a logo, a TTF-font etc.
ar: ملفات المصدر الخاصة بالنموذج. على سبيل المثال a logo, a TTF-font etc.
fr: Fichiers de ressources pour le gabarit. Par exemple un logo, un TTF-font, ...etc.
it: I file di risorse per i Template TypoScript. Per esempio un logo, una font TTF, ecc.

# resources.details
source: Resource files can be referenced in TypoScript Template code by [filename]*.[ext] and has the advantage that the reference from TypoScript is not broken if you copy or export a Template Record where the resources ends up with new names.
ar: يمكن الرجوع إلى ملفات المصدر داخل كود نموذج تيبو بواسطة [filename]*.[ext]والذي يتميز بأن المرجع داخل مخطوطة تيبو لا يتجزء إذا ما قمت بنسخ أو بإرسال إحدى سجلات النموذج المحتوي على مصادر منتهية بأسماء اخرى جديدة.
fr: Les fichiers ressources peuvent être référencés en code gabarit TypoScript par [nomdufichier]*. [ext] et possède l'avantage que la référence par TypoScript n'est pas cassée si vous copiez ou exportez une archive de gabarit là où les ressources se retrouvent avec de nouveaux noms.
it: I file delle risorse possono essere referenziati nel codice del Template TypoScript da [filename]*.[ext] e ha il vantaggio che il riferimento da TypoScript non può essere corrotto, se si copia o si esporta un record Template, dove, poi, le risorse possono assumere nuovi nomi, come nella importazione.

# clear.description
source: Flags that will clear the inheritance of TypoScript code from former templates in the root line. There is a flag for Constants and one for Setup code.
ar: تمسح مؤشرات الراية موروث كود مخطوطة تيبو من النماذج السابقة والموجودة في خط الجذر. حيث يوجد راية للثوابت و راية لكود الأعداد.
fr: Drapeaux qui vont supprimer l'héritage entre les anciens gabarits dans la ligne de racine et le code TypoScript. Il y a un drapeau pour les constantes et un pour le code d'installation.
it: Opzioni che inibiscono l'ereditarietà del codice TypoScript dai precedenti Template, dai livelli superiori dell'Albero delle Pagine. C'è una opzione per le Costanti e una per la Configurazione.

# clear.details
source: In the Web > Template / Template Analyzer module you can see how far back in the template tree that constants and setup code is inherited.
ar: في الويب > قالب/وحدة القوالب النمطية يمكنك أن ترى إلى أي مدى يعود في شجرة القالب التي ترث الثوابت ورمز الإعداد.
fr: Dans le module web>Gabarit / Analyseur de Gabarit, vous pouvez voir jusqu'à quel point dans l'arbre de gabarit, les constantes et le code d'installation est hérité.
it: Nel modulo "Analizza Template", in "Web>Template", puoi vedere, dall'Albero dei Template, a quale livello le Costanti e la Configurazione sono ereditate.

# _clear.image
source: EXT:frontend/Resources/Public/Images/cshimages/systemplate2.png
ar: EXT:frontend/resourcesces/Public/Images/cshimages/systemplate2.png
fr: EXT:context_help/cshimages/systemplate2.png

# root.description
source: Defines that the template represents a root of a website.
ar: التعريفات التي تبين أن النموذج يعرض جذرا لصفحة الوب.
fr: Définit le gabarit comme une racine du site web.
it: Definisce che il Template è la root del sito web.

# includeStaticAfterBasedOn.description
source: If set, static templates will be included after "based-on" templates. It basically swaps the order of inclusion of these external TypoScript sources.
ar: إذا ما تمت عملية الضبط،ستتم إضافة النماذج الإستاتيكة عقب نماذج "based-on".حيث تقوم بتبديل أمر التضمينلهذهالمصادر الخارجية لمخطوطة تيبو الخاصة.
fr: si actif, les gabarits statiques seront inclus après les gabarits de base. Fondamentalement, cela échange l'ordre d'inclusion des ces sources externe de TypoScript.
it: Se impostato, i Template statici saranno inclusi, e quindi eseguiti, dopo i Template base. In altre parole, l'ordine di integrazione è invertito.

# includeStaticAfterBasedOn.details
source: The Web > Template / Template Analyzer module allows you to view the order of inclusion of all TypoScript sources your template uses.
ar: الويب > قالب/وحدة القوالب عرض ترتيب إدراج جميع مصادر TypoScript التي تستخدمها في القالب.
fr: Le module Web > Gabarit / Analyseur de Gabarit vous autorise à voir l'ordre d'inclusion de toutes les source TypoScript que votre gabarit utilise.
it: Il modulo "Template Analyzer", in Web>Template, ti consente di visualizzare l'ordine di inclusione di tutte le fonti TypoScript che il tuo Template usa.

# include_static.description
source: Static Template records to include.
ar: سجلات النموذج الإستاتيكي المقرر إدراجعا
fr: Archives de gabarits statiques à inclure.
it: Record di Template statici da includere.

# include_static_file.description
source: Static Template files to include.
ar: ملفات النموذج الإستاتيكي المقرر إدراجعا
fr: Fichier de gabarit statique à inclure.
it: File di Template statici da includere.

# include_static_file.details
source: Static template files are registered by extensions contrary to Static Template records which come from the static database table, "static_template".
ar: تم تسجيل ملفات النموذج الإستاتيكي بإمتدادات مخالفة لسجلات النموذج الإستاتيكي القادمة من جدول قاعدة المبيانات الإستاتيكية تحت اسم،"static_template".
fr: les fichiers de gabarit statique sont inscrits par extensions contrairement aux archives de gabarit statique, qui viennent du tableau de base de données statique, "static_template".
it: I file di Template statici sono registrati da estensioni, mentre i record di Template statici risiedono in una tabella di database.

# basedOn.description
source: Other Template Records that are included like "static templates".
ar: سجلات نموذج أخرى مدرجة مثل "static_template".
fr: D'autres archives de gabarit qui sont inclus en tant que gabarit statique.
it: Altri record di Template inclusi come "template statici".

# static_file_mode.description
source: Define the mode of inclusion of static template files.
ar: تعريف نمط التضمين الخاص بملفات النموذج الإستاتيكية.
fr: Définir le mode d'inclusion des fichiers de gabarit statique.
it: Definisce la modalità di inclusione dei file di Template statici.

# static_file_mode.details
source: If you are in doubt about the inclusion order, make sure to use the Web > Template / Template Analyzer to view the order.
ar: إذا كنت تشك في إدراج الطلب، تأكد من استخدام الويب > قالب/وحدة القوالب لعرض الطلب.
fr: Si vous doutez de l'ordre d'inclusion, soyez sûr d'utiliser le Web>Gabarit/Gabarit Analyseur pour en voir l'ordre.
it: Se hai dubbi sull'ordine di inclusione, assicurati di utilizzare il modulo "Template Analyzer", in "Web>Template", per visualizzare l'ordine.

# nextLevel.description
source: Defines a template record to make active one level out in the page tree of this branch. This can be used to define another template record for the general website while having a special template for the frontpage.
ar: تعريفات سجل النموذج لتفعيل مستوى واحد لهذا الفرع خارج شجرة الصفحة. و يمكن أن تستخدم ايضاً سجل نموذج آخر للصفحات العامة للوب عندما تحتوي على نماذج خاصة للصفحة الأمامية.
fr: Définit une archive de gabarit pour rendre actif un niveau particulier de cette page de cette branche. cela peut être utilisé pour définir une autre archive de gabarit pour le site en général, en même temps d'avoir un gabarit spécial pour la première page.
it: Definisce un record Template per rendere attivo un livello ulteriore, nell'Albero delle Pagine, di questo ramo. Questo può essere usato per definire un altro record Template per il sito web generale, mentre ha un Template speciale per la pagina principale.

# description.description
source: Enter a description of the template if you like.
ar: إدخل توصيفا للنموذج إن احببت.
fr: Entrez une description du gabarit si vous aimez.
it: Inserisci una descrizione del Template, se vuoi.

# editorcfg.description
source: Editor Configuration for the stylesheet editor extension.
ar: محرر التوصيف لإمتداد محرر ورقة الإسلوب.
fr: Configuration de l'éditeur pour l'extension de l'éditeur de feuille de style.
it: Configurazione per l'estensione dell'editor del foglio di stile.

# _root.seeAlso
source: sys_template:clear
ar: sys_template:مسح
