Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_fe_users.xlf
Languages: ar, it

# username.description
source: Enter the username of the website user. This is needed to login.
ar: إدخال اسم المستخدم على الوب يتطلب تسجيل الدخول
it: Inserisci il nome utente dell'utente del sito. Questo è necessario per effettuare il login.

# username.syntax
source: A username is required and must be in lowercase without spaces in it. The username must be unique among other usernames in the page where it's saved. If it is not unique a number will be prepended automatically.
ar: اسم المستخدم من المتطلبات و يجب أن يكتب بأحرف صغيرة مع عدم ترك مسافات بين الاحرف.ولابد أن يكون اسم المستخدم مختلف عن باقي الاسماء المسجلة داخل صفحة الوب.وإن لم يكن مخلفا عن ما حوله فسيلحق به رقم أوتوماتيكياً.
it: Un nome utente è richiesto e deve essere in minuscolo senza spazi. Il nome utente deve essere unico tra gli altri nomi utente, nella cartella in cui è salvato. Se non è unico, un numero sarà usato come prefisso al nome utente.

# _username.seeAlso
source: Creating Frontend Users and Groups | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ar: إنشاء مستخدمين ومجموعات للواجهة الأمامية | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
it: Creare utenti e gruppi di Frontend | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# password.description
source: Enter the password for the username above. This is needed to login.
ar: إدخال اسم المستخدم على الوب يتطلب تسجيل الدخول
it: Inserisci la password per il nome utente qui sopra. Questo è necessario per il login.

# password.syntax
source: A password is required and must be in lowercase without spaces in it.
ar: كلمة المرور من المتطلبات و يجب أن تكتب بأحرف صغيرة مع عدم ترك مسافات بين الاحرف.
it: È richiesta una password e deve essere in minuscolo e senza spazi.

# usergroup.description
source: Select a user group for the username.
ar: إختيار مجموعة مستخدم لأسم المستخدم.
it: Seleziona un gruppo utente per il nome utente.

# usergroup.details
source: When a user logs in he is able to view all content which is access restricted to the user <em>group(s)</em> the user is a member of. Therefore the user login primarily makes sense with regard to the member groups.
ar: عند تسجيل الدخول للمستخدم فإنه يكون له إمكانيةعرض جميع المحتويات محظورة الدخول للمستخدم و العلامة <em>group(s)</em> تعني أن المستخدم ليس عضوا في المجموعة.وعلى ذلك فإن دخول المستخدم للمرة الأولى يعد منطقياً بالنسبة لعضو في أكثر من مجموعة.
it: Quando un utente fa login potrà vedere tutti i contenuti conformemente alle restrizioni applicate al <em>gruppo(i)</em> di appartenenza. Pertanto fare login per l'utente ha senso esclusivamente se appartiene ad uno o più gruppi.

# name.description
source: Enter the regular name of the user, both first- and surname.
ar: إدخل اسم المستخدم المعتاد سواء الأول أو اسم العائلة
it: Inserisci il nome dell'utente, il nome e il cognome.

# address.description
source: Enter the street address of the user.
ar: إدخل عنوان سكن المستخدم
it: Inserisci l'indirizzo dell'utente.

# www.description
source: Enter the homepage URL
ar: إدخل رابط الصفحة الرئيسية
it: Inserisci l'URL della homepage

# title.description
source: Enter the job title, eg. 'Director' or 'Accountant'.
ar: إدخل اسم الوظيفة ، على سبيل المثال’مدير’ أو ’محاسب,
it: Inserisci la qualifica, ad esempio 'Direttore' o 'Ragioniere'.

# company.description
source: Enter the name of the company in which the user is employed.
ar: إدخل اسم الشركة التى يعمل لديها المستخدم
it: Inserisci il nome dell'azienda in cui l'utente è occupato.

# image.description
source: Insert a photo of the user.
ar: إلحق صورة للمستخدم
it: Inserisci la foto dell'utente.

# disable.description
source: Unchecking this option will temporarily disable the user from logging in.
ar: إلغاء تحديد هذا الخِيار سيؤدي بشكل مؤقت إلى عدم امكانية المستخدم من تسجيل الدخول.
it: Deselezionando quest'opzione disabiliterà temporaneamente l'accesso dell'utente.

# starttime.description
source: Enter the date from which the account is active.
ar: إدخل تاريخ بدء تنشيط الحساب
it: Inserisci la data a partire dalla quale l'account è attivo.

# starttime.syntax
source: The syntax is dd-mm-yy, but you can just enter a "d" in the field to insert todays date. Or "d+10" to insert the date 10 days from now etc. The field will re-format any input to fit the format it understands so you can just experiment and you will be able to clearly see how dates should be entered.
ar: في البنية dd-mm-yy,لإدخال تاريخ اليوم أو إدخال الرمز "d+10"لإدخال التاريخ بعد عشرة أيام من الآن ,"d" يمكنك إدخال الرمز تعيد الخانة تنسيق أي مدخل ليتناسب مع التنسيق الذي تفهمه ، و على ذلك فيمكنك التجربة وسوف ترى بوضوح كيف يمكن إدخال التاريخ.
it: La sintassi è dd-mm-yy, ma puoi semplicemente inserire una "d" nel campo per inserire la data di oggi. Oppure "d+10" per inserire la data di 10 giorni da oggi, ecc Il campo riformatterà qualsiasi input per adattarsi al formato che interpreta, in modo che tu possa sperimentare e sarai in grado di vedere chiaramente come le date dovrebbero essere inserite.

# endtime.description
source: Enter the date from which the account is disabled.
ar: إدخل تاريخ إلغاء الحساب
it: Inserisci la data a partire dalla quale l'account è disabilitato.

# endtime.syntax
source: See "Start"
ar: أنظر "بدء"
it: Vedi "Inizio"

# lastlogin.description
source: This field shows the user's last log in date.
ar: هذا الحقل يُظهر تاريخ آخر تسجيل دخول للمستخدم.
it: Questo campo mostra l'ultima data nella quale l'utente ha fatto login.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
ar: إدخل TSconfig إضافية للمستخدم ( المتقدم).
it: Inserisci TSconfig aggiuntivo per l'utente (avanzato).

# TSconfig.details
source: This field allows you to enter TypoScript style configuration values for the user. Currently there are no system defined keys. If there ever will be, they will be described in detail in the administrative documentation. The primary use of this field (as well as the 'sister'-field in the Website usergroup table) is for custom purposes. In this case, you should use the root-key "user" for your customly defined values. Thus you don't risk any future system keys to interfere with your configuration. You access the values of the configuration from your frontend plugins by calling the function <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> which will return an array with the valuetree in it. <b>Warning:</b> You should use Website user/group TSconfig in your PHP-scripts ONLY if your resulting content is NOT being cached! So call it from TypoScript USER_INT cObjects or disable caching from your PHP-code by calling <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig from Website usergroups:</b> Notice that the configuration from the field TSconfig in the member groups of the user is accumulated and prepended to the TSconfig of the user before it's parsed. This means for instance that a key defined in the TSconfig of the user (this field) will override the same key defined in the last (bottom) usergroup in the list which will again override the same key defined in the first (top) usergroup in the list. <b>Example:</b> Let's imagine you want to define for a user that his name is printed in the bottom of the webpages when he is logged in. First of all you must write a PHP-function and insert the result from it as a USER_INT cObject in the bottom of the page. But your function needs to know, whether or not this user is configured to have his name printed. So you decide to use a custom TSconfig key, 'user.printUserName': <em>In the TSconfig field of the user or usergroup:</em> user.printUserName = 1 <em>In your PHP-function:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }
ar: يتيح لك هذا الحقل إدخال قيم تكوين نمط TypoScript للمستخدم. حالياً، لا توجد مفاتيح محددة من قبل النظام. إذا كان هناك أي وقت مضى، فسيتم وصفها بالتفصيل في الوثائق الإدارية. الاستخدام الأساسي لهذا الحقل (بالإضافة إلى حقل 'الموازي له' في جدول مجموعة مستخدمي موقع الويب) هو لأغراض مُخصّصة. في هذه الحالة، يجب عليك استخدام root-key "user" الرئيسي للقيم المحددة بشكل مُخصص. وبذلك لا تخاطر بأي مفاتيح نظام مستقبلية للتدخل في التكوين الخاص بك. يمكنك الوصول إلى قيم الإعدادات من إضافات الواجهة الأمامية الخاصة بك عن طريق الاتصال بـ <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> التي ستقوم بإرجاع صفيف يحتوي على قيمة شجرة. <b>تحذير:</b> يجب استخدام user/Group TSconfig في PHP-scripts فقط إذا لم يتم تخزين المحتوى الناتج الخاص بك مؤقتاً! لذا استدعه من TypoScript USER_INT cObjects أو ألغ تفعيل ذاكرة التخزين المؤقت عبر استدعاء PHP-code <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig من مجموعات مستخدمي الزاجهة الأمامية:</b> لاحظ أن التكوين من حقل TSconfig في مجموعات أعضاء المستخدم يتم تجميعه وإلحاقه مسبقاً بـ TSconfig الخاص بالمستخدم قبل تحليله. وهذا يعني على سبيل المثال أن مفتاح المُعرّف في TSconfig للمستخدم (هذا الحقل) سيتجاوز نفس المفتاح المعرف في مجموعة المستخدمين الأخيرة (أسفل) في القائمة والذي سيتجاوز مرة أخرى نفس المفتاح المعرف في مجموعة المستخدمين الأولى (الأعلى) في القائمة. <b>مثال:</b> لنتخيل أنك تريد أن تحدد للمستخدم أن يظهر اسمه مكتوباً في أسفل الموقع الإلكتروني عند تسجيل الدخول. أولاً يجب عليك كتابة دالة PHP وإدراج النتيجة منها ككائن USER_INT في الجزء السفلي من الصفحة. لكن وظيفتك تحتاج إلى معرفة ما إذا كان هذا المستخدم قد تم تكوينه ليكون اسمه مكتوباً أم لا. لذا تقرر استخدام مفتاح TSconfig مخصص، 'مستخدم. rintUserName': <em>في حقل TSconfig للمستخدم أو مجموعة المستخدم:</em> المستخدم. rintUserName = 1 <em>في وظيفة PHP الخاصة بك:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); إذا كان ($userTSConfig["user."]["printUserName"]) { العودة $GLOBALS["TSFE"]->fe_user->user["name"]; }
it: Questo campo ti permette di inserire la configurazione in TypoScript per l'utente. Al momento non ci sono chiavi definite dal sistema. Se mai ce ne saranno, verranno descritte in dettaglio nella documentazione di amministrazione. L'uso principale di questo campo (così come per l'omonimo campo nella tabella dei gruppi utente del sito) è per scopi personalizzati. In questo caso, dovresti usare la root-key "user" per la tua configurazione personalizzata. Così non si rischia alcuna futura system-key che possa interferire con la tua configurazione. Puoi accedere ai valori della configurazione dai plugin del frontend, utilizzando la funzione <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> che restituirà un array con tutti i valori in esso configurati. <b>Attenzione:</b> dovresti usare TSconfig di Utenti e Gruppi, del sito web, nel tuo script PHP se, e solo se, i contenuti NON vengono salvati nella cache! Chiamalo da TypoScript con il cObjects USER_INT oppure disabilita la cache dal tuo codice PHP chiamando <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig dai gruppi utente del sito web</b> Nota che la configurazione dal campo TSconfig nei gruppi membri dell'utente è accumulata e dipende dal TSconfig dell'utente prima che venga analizzata. Ciò significa, ad esempio, che una chiave definita nel TSconfig dell'utente (questo campo) sovrascriverà la stessa chiave definita nell'ultimo (in fondo) gruppo di utenti, nella lista, che sovrascriverà nuovamente la stessa chiave definita nel primo (in cima) gruppo di utenti, nella lista. <b>Esempio</b> Immaginiamo di voler definire, per un utente, che il suo nome sia stampato nella parte inferiore delle pagine web quando ha effettuato l'accesso. Prima di tutto è necessario scrivere una funzione PHP e inserire il risultato, da essa, come un cObject USER_INT in fondo alla pagina. Ma la funzione deve sapere se questo utente è configurato per far stampare il suo nome. Quindi decidi di usare una chiave TSconfig personalizzata, 'user.printUserName'. <em>Nel campo TSconfig dell'utente o del gruppo utente:</em> user.printUserName = 1 <em>Nella tua funzione PHP:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
ar: تركيبة مخطوطة تيبو الخاصة دون وجود أي شروط أو ثوابت
it: Sintassi TypoScript, senza condizioni e costanti.

# _TSconfig.seeAlso
source: TSconfig for TSFE | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TCEmain/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig
it: TSconfig per TSFE | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TCEmain/ pages:TSconfig, fe_groups:TSconfig, be_users:TSconfig, be_groups:TSconfig

# .description
source: A website login user.
ar: دخول المستخدم على صفحة الوب
it: Un account utente del sito web.

# .details
source: These are users with a username and password who are allowed specific access to otherwise restricted areas on your website.
ar: يمتلك هؤلاء المستخدمين اسم مستخدم و كلمة سر وكلمة سر و التان تمكنهم من الدخول على أي مناطق محظورة الدخول على صفحة الوب.
it: Si tratta di utenti con nome utente e password a cui è consentito l'accesso specifico ad aree altrimenti limitate sul tuo sito web.

# .image_descr
source: Part of the form for editing a frontend user. A typical login box (standard) on the website where frontend users can login.
ar: جزئ من نموذج التحرير الخاص بتحرير مستخدم الطرف الأمامي . يمكن لمستخدمي الطرف الأمامي الدخول إلى صفحة الوب من خلال صبدوق الدخول التقليدي( المعياري).
it: Parte della form-modifica di un utente di frontend. Una tipica form di login (standard) sul sito web con cui gli utenti di frontend possono accedere.
