Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: ar, fr, it

# imageorient.details
source: The positions above and below the body text are pretty straight forward. The options for "In text" mean that images are displayed with text wrapped around them. When you select this option the template will probably force the images into smaller dimensions to accommodate the width of the template and the width of the text. The bodytext will float <em>under</em> the image block when it reaches the end of the image block. In other words, the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. If you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: subsequent content elements on the page will appear to be layered on top of the image block. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
ar: المَوَاضْع الموجودة أعلى النص الأساسي وأسفله مستقيمة جداً للأمام. تعني الخيارات لـ "In Text" أنه يتم عرض الصور مع التفاف النص حولها. عند تحديد هذا الخِيار، من المحتمل أن يفرض القالب الصور إلى أبعاد أصغر لتلائم عرض القالب وعرض النص. سيطفو المَتن "bodytext" <em>تحت</em> الصورة عندما تصل إلى نهاية الصورة. بعبارة أخرى، سيلتفّ المَتن <em>حول</em> الصورة. إذا حددت خيار "In text" أسفل حاجز "عدم الالتفاف"، فلن يطفو النص الأساسي أسفل الصورة، ولكن ببساطة يستمر في العمود نفسه. بِغضّ النظر عن الاختلاف المرئي، هناك جانب تقني أيضاً. إذا اخترت السماح للمحتوى بالالتفاف حول الصورة، فستواجه ظاهرة غريبة عندما لا يكون لديك نص أساسي كافٍ لجعله يطفو حول الصورة: ستظهر عناصر المحتوى اللاحقة على الصفحة موضوعة في طبقات أعلى كتلة الصورة. ومع ذلك، يمكن حلها بسهولة عن طريق تغيير موضع "In text" إلى القيمة المتساوية ولكن أسفل حاجز "عدم الالتفاف".
fr: Les positions ci-dessus et en dessous du texte du corps sont assez directes. Les options de "Dans le texte" signifient que les images sont affichées avec du texte enveloppé autour d'elles. Lorsque vous sélectionnez cette option, le modèle va probablement forcer les images dans des dimensions plus petites pour tenir compte de la largeur du modèle et de la largeur du texte. Le texte du corps flottera <em>sous</em> le bloc d'image quand il atteint la fin du bloc d'image. En d'autres termes, le texte du corps <em>entoure</em> le bloc d'image. Si vous sélectionnez "Dans le texte" sous le séparateur "Sans Enveloppement", le texte du corps ne flottera pas sous le bloc d'image, mais continuera simplement dans sa colonne. En dehors de la différence visuelle il y a aussi un aspect technique. Si vous choisissez d'autoriser le contenu à envelopper le bloc d'image, vous ressentirez un phénomène étrange lorsque vous n'avez pas assez de texte corporel pour le faire flotter autour de l'image : les éléments de contenu suivants sur la page sembleront être calqués au-dessus du bloc d'image. Cependant il est facilement résolu en changeant la position "Dans le texte" à la valeur égale mais en dessous du séparateur "Pas d'enveloppement".
it: Le posizioni "Sopra, ..." e "Sotto, ..." il testo sono piuttosto intuitive. Le opzioni "Nel testo, ..." significano che le immagini sono visualizzate con il testo che avvolge le immagini stesse. Quando si seleziona una di queste opzioni, il Template probabilmente forzerà le dimensioni delle immagini, più piccole, per adattarsi alla larghezza del Layout e alla larghezza del testo. Il testo riempirà lo spazio <em>sotto</em> l'immagine, nel caso raggiunga il lato inferiore dell'immagine. In altre parole, il testo <em>avvolge</em> l'immagine. Se selezioni "Di fianco al testo, ..." sotto "Senza avvolgere", il testo non andrà sotto l'immagine, ma semplicemente continuerà nella sua colonna. Oltre alla differenza visiva c'è anche un aspetto tecnico. Se si sceglie di consentire al contenuto di avvolgere l'immagine, si verificherà uno strano fenomeno quando non si dispone di un testo sufficientemente lungo per coprire tutt'attorno l'immagine: i successivi elementi di contenuto sulla pagina appariranno allineati alla parte superiore dell'immagine. Tuttavia è facilmente risolvibile cambiando la posizione "Nel testo, ..." al valore uguale, ma del tipo "Senza avvolgere".

# imageborder.description
source: Displays a colored border around the images.
ar: عرض الإطار المُلوّن حول الصورة.
fr: Affiche une bordure colorée autour des images.
it: Visualizza un bordo intorno alla risorsa multimediale nel Frontend del sito web. il bordo sarà applicato a tutte le risorse qui incluse.

# image_link.description
source: Enter a link for the image. For multiple images, separate the links with commas.
ar: أدخل رابط للصورة. للحصول على صور متعددة، افصل الروابط بالفواصل.
fr: Entrez un lien pour l'image. Pour de multiples images, séparez les liens par des virgules.
it: Inserisci un collegamento per l'immagine. Per immagini multiple, separa i collegamenti con le virgole.

# image_link.details
source: By default all images share the same link. Your TypoScript template may be configured to allow a separate link for each image. If this is the case, you simply separate the links with a comma. See Page Content>Link below for details on syntax.
ar: بشكل افتراضي تتشارك جميع الصور نفس الرابط. قد يتم تكوين قالب TypoScript الخاص بك للسماح بربط منفصل لكل صورة. إذا كان هذا هو الحال، فعليك ببساطة أن تفصل الروابط بفاصلة. راجع محتوى Page Content>Link أدناه للحصول على تفاصيل بناء الجملة.
fr: Par défaut, toutes les images partagent le même lien. Votre modèle TypoScript peut être configuré pour autoriser un lien différent pour chaque image. Si c'est le cas, vous séparer tout simplement les liens par des virgules.Voir Contenu de page>Lien ci-dessous pour des détails sur la syntaxe.
it: Per default, tutte le immagini condividono lo stesso collegamento. Il Template TypoScript può essere configurato per consentire un collegamento separato per ogni immagine. Se questo è il caso, è sufficiente separare i collegamenti con una virgola. Vedi "Page Content>Link" qui sotto per i dettagli sulla sintassi.

# image_zoom.description
source: When enabled, clicking an image will open a larger version in a popup window.
ar: عند التفعيل، سيتم فتح الصورة في نافذة منبثقة عند النقر فوقها.
fr: Quand l'option est activée, cliquer sur l'image va en faire apparaitre une version plus grande dans une fenêtre contextuelle.
it: Quando è abilitato, cliccando su una immagine si aprirà una finestra di popup con l'immagine in formato grande.

# image_zoom.details
source: This option overrides the value in the Links field.
ar: هذا الخِيار يتجاوز القيمة في حقل الروابط.
fr: Cette option annule ce qui est entré dans le champ "Lien".
it: Questa opzione sovrascrive il campo "Collegamento", disponibile per ogni immagine.

# image_frames.description
source: Select special image framing options.
ar: حدد خيارات إطار الصورة الخاصة.
fr: Sélectionnez des options spéciales de cadrage d'image.
it: Seleziona le opzioni speciali di posizionamento dell'immagine.

# imagecols.description
source: Set the number of columns when the images are displayed in the Frontend of the website.
ar: قم بتعيين عدد الأعمدة عند عرض الصور في واجهة الموقع. (Automatic Translation).
fr: Fixe le nombre de colonnes quand les images sont affichées dans le Frontend du site.
it: Imposta il numero di colonne quando le immagini vengono visualizzate nel Frontend del sito web.

# imagecaption.description
source: Enter captions for the images. For multiple images, enter one caption per line.
ar: أدخل تسميات توضيحية للصور. بالنسبة للصُور المتعددة، أدخل تسميات توضيحية واحدة لكل سطر.
fr: Entrez les légendes d'images. Pour plusieurs images, entrez une légende par ligne.
it: Inserisci la didascalia per le immagini. Per immagini multiple, inserisci una didascalia per riga.

# imagecaption.details
source: By default, the caption is positioned below the images. However, your TypoScript template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In this case, each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the Content Element type "File Links" where each line represents a description of a file in the list.
ar: بشكل افتراضي، يتم وضع الوَصفْ أسفل الصور. ومع ذلك، يمكن تكوين قالب TypoScript الخاص بك للسماح بتسميات وصف الصور الفردية عن طريق إعداد "styles.content.imgtext.captionSplit=1" في ثوابت "constants" القالب الخاص بك. في هذه الحالة، كل سطر في هذا الحقل سيكون وصف للصورة المقابلة في القائمة. يتم استخدام حقل النص الوَصفيْ أيضاً من نوع عنصر المحتوى "File Links" حيث يمثل كل سطر وصفاً لملف في القائمة.
fr: Par défaut, la légende est placée sous l'image. Cependant, votre modèle TypoScript peut être configuré pour autoriser les légendes d'images individuelle, en fixant "styles.content.imgtext.captionSplit=1" dans les constantes de votre modèle.Dans ce cas, chaque ligne dans ce champ sera la légende de l'image correspondante dans la liste.Le champ de texte pour la légende est aussi utilisé par le type d'élément de contenu "Liens de fichiers", où chaque ligne représente une description d'un fichier de la liste.
it: Per default, la didascalia è posizionata sotto le immagini. Tuttavia, il tuo Template TypoScript può essere configurato per consentire multiple didascalie, impostando "styles.content.imgtext.captionSplit=1" nelle costanti del Template. In questo caso, ogni riga, in questo campo, sarà la didascalia dell'immagine corrispondente nella lista. Il campo di testo della didascalia è utilizzato anche dal tipo di elemento di contenuto "Collegamenti a File" dove ogni riga rappresenta una descrizione di un file nella lista.

# cols.description
source: Select a fixed number of table columns
ar: حدد عدد ثابت من أعمدة الجدول
fr: Sélectionnez un nombre fixe de colonnes
it: Seleziona un numero fisso di colonne in tabella

# pages.description
source: Select a target page or multiple target pages.
ar: حدد صفحة مُستهدفة أو عِدّة صفحات مُستهدفة.
fr: Sélectionner une ou plusieurs pages cibles.
it: Seleziona una o più pagine / cartelle. Questo campo è utilizzato da diversi Elementi di Contenuto, ognuno dei quali ne fa un uso diverso. Vedi i dettagli per maggiori informazioni.

# pages.details
source: This field is used by many of the Content Element types to create a relation to either a single target page or multiple target pages. If no target page is specified, the current page will generally be used. Using the "Search" Content Element, the target page is where search results will appear. You must make sure that this page has a similar "Search" Content Element to display the results. The "Login" Content Element (not to be confused with the Login plugin available when the felogin extension is installed) also uses this field to redirect the login to a certain page. That page does not need to contain a "Login" Content Element in order to perform the authentication since any TYPO3 page can handle a login request. If you specify a second page in this list, the ID will be passed to the login system as the page inside TYPO3 where website users are found. You should use this only if your template is not already configured to pass this value on. In order for the login procedure to work you must make sure that you have created website users and website usergroups, have specified where these website users can be found (typically a SysFolder), a page ID in the page list, and ensured that cookies are enabled for the site. The "Menu/Sitemap" Content Elements also use this field. In this case the page will determine the starting point for the menu or the actual pages shown in the menu. This behavior depends on the menu type you have selected. Finally the "Form" element uses this field as the target page to which the form is submitted. A common use is the "Thank you" page after the form is completed.
ar: يتم استخدام هذا الحقل بواسطة العديد من أنواع عناصر المحتوى لإنشاء رابط إما بصفحة واحدة أو صفحات مُتعددة. إذا لم يتم تحديد صفحة المُستهدفة، فسيتم استخدام الصفحة الحالية بشكل عام. باستخدام عنصر محتوى "البحث"، تكون الصفحة المُستهدفة هي المكان الذي ستظهر فيه نتائج البحث. يجب أن تتأكد من أن هذه الصفحة لها عنصر محتوى "بحث" مشابه لعرض النتائج. يستخدم عنصر محتوى "تسجيل الدخول" (يجب عدم الخلط بينه وبين مكون تسجيل الدخول الإضافي المتاح عند تثبيت إضافة felogin) أيضاً هذا الحقل لإعادة توجيه تسجيل الدخول إلى صفحة معينة. لا تحتاج هذه الصفحة إلى احتواء عنصر محتوى "تسجيل الدخول" من أجل إجراء المصادقة لأن أي صفحة من صفحات TYPO3 يمكنها التعامل مع طلب تسجيل الدخول. إذا قمت بتحديد صفحة ثانية في هذه القائمة، فسيتم تمرير المُعرّف إلى نظام تسجيل الدخول كصفحة داخل TYPO3 حيث يتم العثور على مُستخدمي الموقع. يجب عليك استخدام هذا فقط إذا لم يتم تكوين القالب الخاص بك بالفعل لتمرير هذه القيمة. لكي يعمل إجراء تسجيل الدخول، يجب أن تتأكد من أنك أضفت مُستخدمين جدد للواجهة الأمامية في موقع الويب ومجموعات لمُستخدمي الواجهة الأمامية، وحدد مكان العثور على مُستخدمي موقع الويب هؤلاء (عادةً ما يكون SysFolder)، ومعرف الصفحة "ID" في قائمة الصفحات، وتأكّد من أن ملفات تعريف الارتباط تم تفعيلها للموقع. تستخدم عناصر محتوى "القائمة/فهرس الموقع" هذا الحقل أيضاً. في هذه الحالة ستحدد الصفحة نقطة البداية للقائمة أو الصفحات الفعلية المعروضة في القائمة. يعتمد هذا السلوك على نوع القائمة التي حددتها. أخيراً، يستخدم عنصر "النموذج" هذا الحقل كصفحة مًستهدفة، بحيث يتم إرسال النموذج إليها بعد أن ترسل الطلب. الاستخدام الشائع هو صفحة "شكراً لك" بعد استكمال النموذج.
fr: Ce champ est utilisé par plusieurs types d'éléments de contenu pour créer une relation avec une seule page cible ou plusieurs pages cibles. Si aucune page cible n'est spécifiée, la page courante sera généralement utilisée. En utilisant l'élément de contenu "Rechercher", la page cible est l'endroit où les résultats de recherche apparaîtront. Vous devez vous assurer que cette page a un élément de contenu similaire "Rechercher" pour afficher les résultats. L'élément de contenu "Connexion" (ne pas confondre avec le plugin de connexion disponible lorsque l'extension felogin est installée) utilise également ce champ pour rediriger la connexion vers une certaine page. Cette page n'a pas besoin de contenir un élément de contenu "Connexion" pour effectuer l'authentification car n'importe quelle page TYPO3 peut gérer une requête de connexion. Si vous spécifiez une seconde page dans cette liste, l'ID sera passé au système de connexion en tant que page à l'intérieur de TYPO3 où les utilisateurs du site sont trouvés. Vous ne devriez utiliser cela que si votre modèle n'est pas déjà configuré pour passer cette valeur. Pour que la procédure de connexion fonctionne, vous devez vous assurer que vous avez créé des utilisateurs du site web et des groupes d'utilisateurs du site web, ont spécifié où les utilisateurs de ce site peuvent être trouvés (généralement un Dossier), un ID de page dans la liste des pages et a veillé à ce que les cookies soient activés pour le site. Les éléments de contenu "Menu/Plan de site" utilisent également ce champ. Dans ce cas, la page déterminera le point de départ du menu ou des pages affichées dans le menu. Ce comportement dépend du type de menu que vous avez sélectionné. Enfin, l'élément "Formulaire" utilise ce champ comme la page cible à laquelle le formulaire est soumis. Une utilisation courante est la page « Remerciements » une fois le formulaire rempli.
it: Questo campo è usato da molti tipi di Elementi di Contenuto per creare una relazione a una o più pagine / cartelle. Se non viene specificata nessuna pagina verrà utilizzata la pagina corrente. Il campo, a seconda del tipo di contenuto, assume nomi diversi. <strong>Pagine Selezionate</strong> In questo caso stiamo trattando con elementi di contenuto del tipo: "Abstract": crea un menù a tutte le sottopagine delle <em>pagine selezionate</em>, riportando il contenuto del campo Abstract delle sottopagine "Pagine": crea un menù alle <em>pagine selezionate</em> "Sottopagine": crea un menù a tutte le sottopagine delle <em>pagine selezionate</em> "Pagine Aggiornate Recentemente": elenca le ultime 10 pagine modificate di recente, tra le <em>pagine selezionate</em> "Pagine Correlate": crea una lista di pagine correlate (usando Metadati::Parole Chiave), tra le <em>pagine selezionate</em> "Indice Sezione": crea un menù di sezione con le <em>pagine selezionate</em> che hanno Elementi di Contenuto con "Mostra in 'Indice Sezione'" abilitato "Indice Sezione Sottopagine": crea un menù di sezione con le sottopagine, delle <em>pagine selezionate</em>, che hanno Elementi di Contenuto con "Mostra in 'Indice Sezione'" abilitato "Mappa del Sito delle Pagine Selezionate": mostra la mappa del sito delle <em>pagine selezionate</em> <strong>Pagine Archiviazione Record</strong> In questo caso stiamo trattando con elementi di contenuto del tipo: "Inserisci Plugin": consente di selezionare un plugin, il quale utilizzerà le <em>pagine di archiviazione record</em> per reperire i record necessari ad espletare le proprie funzionalità

# recursive.description
source: The number of subpage levels that should also be included for each page in the list.
ar: عدد مستويات الصفحات الفرعية التي ينبغي إدراجها أيضاً لكل صفحة في القائمة.
fr: Le nombre de niveaux des sous-pages devrait également être inclus pour chaque page de la liste.
it: Il numero di livelli di sottopagine che dovrebbero essere inclusi per ogni pagina dell'elenco.

# recursive.details
source: This feature depends on the TypoScript template configuration and Content Element type. If enabled, each page listed in the "Pages" field will also have its subpages included to the specified depth. <strong>Warning:</strong> If there are many subpages, be aware that this option may return a large number of results
ar: تعتمد هذه المِيزة على تكوين قالب TypoScript ونوع عنصر المحتوى. في حالة التفعيل، كل صفحة مُدرجة في حقل "الصفحات" سوف تحتوي أيضاً على صفحاتها الفرعية حتى العمق المحدد. <strong>تحذير:</strong> إذا كان هناك العديد من الصفحات الفرعية، كن على علم بأن هذا الخِيار قد سيظهر عدداً كبيراً من النتائج
fr: Cette fonctionnalité dépend de la configuration du gabarit TypoScript et du type de l'élément de contenu. Si activé, chaque page listée dans le champ "Pages" aura également ses sous-pages incluses à la profondeur spécifiée. <strong>Avertissement :</strong> S'il y a beaucoup de sous-pages, sachez que cette option peut retourner un grand nombre de résultats
it: Questa funzionalità dipende dalla configurazione del Template TypoScript e dal tipo di elemento di contenuto. Se abilitata, ogni pagina elencata nel campo "Pagine" avrà anche le sue sottopagine incluse, alla profondità specificata. <strong>Attenzione:</strong> se ci sono molte sottopagine, sii consapevole che questa opzione può restituire un gran numero di risultati

# menu_type.description
source: Select the type of menu you wish to create.
ar: حدد نوع القائمة التي ترغب في إنشائها.
fr: Sélectionnez le type de menu que vous souhaitez créer.
it: Seleziona il tipo di menù che desideri creare.
