Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: ar, fr, it

# colPos.details
source: Many websites only use one column of content. Some templates, however, let you put content in multiple columns using the Column option. <strong>Notice:</strong> Selecting a column other than "Normal" may cause the Content Element to disappear if the website template does not use that column. If your Content Element mysteriously disappears make sure the Column and Language selectors are set correctly.
ar: العديد من مواقع الويب تستخدم عموداً واحداً فقط من المحتوى. ولكن بعض القوالب تسمح لك بوضع المحتوى في أعمدة متعددة باستخدام خِيار العمود. <strong>ملاحظة:</strong> اختيار عمود غير "الطبيعي" قد يتسبب في اختفاء عنصر المحتوى إذا كان قالب الموقع لا يستخدم هذا العمود. إذا اختفى عنصر المحتوى الخاص بك بشكل غامض تحقق من تعيين مُحددات العمود واللغة بشكل صحيح.
fr: Beaucoup de sites web utilisent seulement une colonne de contenus. Certains modèles, cependant, vous laissent mettre du contenu dans plusieurs colonnes en utilisant l'option Colonne.Note: Sélectionner une colonne autre que "Normal" peut entraine la disparition de l'élément de contenu si le modèle du site web n'utilise pas cette colonne. Si votre élément de contenu disparait mystérieusement, vérifier que les sélecteurs de Colonne et Langue sont correctement fixés.
it: Molti siti web utilizzano solo una colonna di contenuto. Alcuni Template, tuttavia, consentono di inserire contenuti in più colonne utilizzando l'opzione Colonna. <strong>Nota:</strong> selezionando una colonna diversa da "Normale", può causare la scomparsa dell'elemento di contenuto se il Template di sito web non utilizza quella colonna. Se il tuo Elemento di Contenuto scompare misteriosamente, assicurati che i selettori Generale::Colonna e Lingua::Lingua siano impostati correttamente.

# date.description
source: Enter a date to be displayed above the header.
ar: أدخل تاريخاً ليتم عرضه فوق الترويسة.
fr: Entrez une date à afficher au-dessus du header.
it: Inserisci una data da visualizzare sopra l'intestazione.

# header.description
source: Enter header text for the Content Element.
ar: أدخل نص العنوان لعنصر المحتوى.
fr: Entrez le texte de l'en-tête pour l'élément de contenu.
it: Inserisci il testo per l'intestazione dell'Elemento di Contenuto.

# header.details
source: Almost all Content Elements will display this header above the content. If you don't want the header displayed, set the header Layout to "Hidden". You can also choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One example is the HTML Content Element. The chosen name will then only be displayed in menus, e.g. the section index.
ar: كل عناصر المحتوى تقريباً سوف تعرض هذا الترويسة فوق المحتوى. إذا كنت لا تريد عرض الترويسة، قم بتبديل مظهر الترويسة إلى "مخفي". يمكنك أيضاً اختيار عدم إدخال أي محتوى في هذا الحقل. بعض أنواع عناصر المحتوى لا تعرض الترويسة بشكل افتراضي. في تلك الحالات يتم تسمية حقل الترويسة عادةً بـ "الاسم" بدلاً من ذلك. مثال واحد هو عنصر محتوى HTML. ثم سيتم عرض الاسم المختار فقط في القوائم، مثل فهرس الأقسام.
fr: Pratiquement tous les éléments de contenu afficheront cet en-tête au-dessus de leur contenu. Si vous ne souhaitez pas voir cet en-tête affiché, mettez la disposition de l'en-tête sur "Caché". Vous pouvez aussi choisir de laisser ce champ vide. Certains types d'éléments de contenu n'affichent pas d'en-tête par défaut. Dans ces cas-là, le champ d'en-tête est typiquement renommé par "Nom". C'est par exemple le cas de l'élément de contenu HTML.
it: Quasi tutti gli Elementi di Contenuto visualizzeranno questa intestazione sopra il contenuto. Se non vuoi che l'intestazione venga visualizzata, imposta il "Tipo di Layout" su "Nascosto". Puoi anche scegliere di non inserire alcun contenuto in questo campo. Alcuni tipi di elementi di contenuto non visualizzano l'intestazione per impostazione predefinita. In questi casi il campo Intestazione è tipicamente denominato "Nome". Un esempio è l'elemento di contenuto HTML. Il nome scelto verrà quindi visualizzato solo nei menù, ad esempio l'indice di sezione.

# _header.image
source: EXT:frontend/Resources/Public/Images/cshimages/ttcontent_6.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/ttcontent_6.png

# header_position.description
source: Aligns the header to the left, center, or right.
ar: يحاذي الترويسة إلى اليسار أو الوَسَط أو اليمين.
fr: Aligne les headers sur la gauche, au centre, ou à droite.
it: Allinea l'intestazione a sinistra, al centro oppure a destra.

# header_link.description
source: Creates a link from the header to a Page ID, email address, or URL.
ar: إنشاء رابط من ترويسة الصفحة إلى رقم تعريف الصفحة، أو عنوان البريد الإلكتروني، أو عنوان URL.
fr: Créé un lien entre le header et l'ID d'une page, une adresse mail, ou une URL.
it: Crea un collegamento dall'intestazione a un ID di Pagina, indirizzo email o URL.

# header_link.syntax
source: If you insert a Page ID (ex. 51), the link will point to the page with id=51 <em>inside</em> TYPO3. If you insert an email address (ex. name@my-domain.test), the link will point to that email address. If you insert an URL or domain, (ex. www.typo3.org or http://www.my-domain.org), the link will point to that website.
ar: إذا قمت بإدراج مُعرّف الصفحة (مثلاً: 51)، فسيشير الرابط إلى الصفحة التي تحتوي على معرف = 51 <em>داخل</em> TYPO3. إذا قمت بإدراج عنوان بريد إلكتروني (مثلاً: name@my-domain.test)، سيشير الرابط إلى عنوان البريد الإلكتروني هذا. إذا قمت بإدراج عنوان URL أو النطاق، (مثلا. () www.typo3.org أو http://www.my-domain.org)، ستشير الوصلة إلى ذلك الموقع الإلكتروني.
fr: Si vous insérez une ID de page (ex. 51), le lien va pointer la page avec ID=51 dans TYPO3. Si vous insérez une adresse mail (ex. nom@mon-domaine.test), le lien pointera vers cette adresse mail. Si vous insérez une URL ou un domaine (ex. www.typo3.org ou http://www.mon-domaine.org), le lien pointera vers ce site web.
it: Se inserisci un ID di Pagina (es. 51), il collegamento punterà alla pagina con id=51 <em>dentro</em> TYPO3. Se inserisci un indirizzo email (es. nome@mio-dominio.test), il collegamento punterà a quell'indirizzo email. Se inserisci un URL o un dominio, (es. www.typo3.org o http://www.mio-dominio.org), il collegamento punterà a quel sito web.

# header_layout.description
source: Select a visual design for the header.
ar: حدد تصميماً مرئياً للترويسة.
fr: Sélectionnez un design visuel pour le header.
it: Seleziona un tipo di layout per l'intestazione.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful when you don't need a header to display on the website but still want to identify the Content Element in the Backend.
ar: إذا اخترت "الافتراضي" سيتم استخدام التصميم الافتراضي (الذي هو أحد المخططات 1-5). بدلاً من ذلك، يمكنك الاختيار من تخطيط 1 إلى 5 التي تم تكوينها في قالب الموقع مع التصاميم البصرية الفردية. إذا اخترت "إخفاء" لن يظهر العنوان ببساطة. هذا مفيد عندما لا تحتاج إلى عنوان لعرضه على الموقع ولكن لا تزال تريد تحديد عنصر المحتوى في الواجهة الخلفية.
fr: Si vous sélectionnez "Par défaut", le design standard (qui est l'une des dispositions 1 à 5) sera utilisé.Alternativement, vous pouvez sélectionner les Disposition 1 à 5 qui sont configurée dans le modèle du site avec des design visuels individuels.si vous sélectionnez "Caché", le header n'apparaitre pas, tout simplement. Cela est utile quand vous n'avez pas besoin de l'affichage d'un header mais que vous voulez quand même identifier l'élément de contenu dans le Backend.
it: Se selezioni "Predefinito", verrà utilizzato il layout standard (che è uno dei layout 1-5). In alternativa è possibile selezionare un Layout da 1 a 5, che sono configurati nel Template del sito web con singoli particolari grafici. Se selezioni "Nascosto", l'intestazione non apparirà. Questo è utile quando non hai bisogno di un'intestazione da visualizzare sul sito web, ma vuoi ancora identificare l'Elemento di Contenuto nel Backend con un "titolo".

# subheader.description
source: Enter a subheader to be displayed below the main header. If the Content Element is a "Form" this field is instead used as the Recipient Email.
ar: أدخل عنوان فرعي ليتم عرضه تحت العنوان الرئيس. إذا كان عنصر المحتوى هو "نموذج" هذا الحقل يستخدم بدلاً من ذلك كبريد إلكتروني للمستلم.
fr: Entrez un sous-titre à afficher sous le titre principal. Si l'élément de contenu est une Forme, ce champ est utilisé comme étant l'e-mail du destinataire à la place.
it: Inserisci un sottotitolo che sarà visualizzato sotto l'intestazione.

# subheader.details
source: A subheader is displayed only with "Header" Content Elements and with "Form" Content Elements (as the Recipient Email).
ar: يتم عرض العنوان الفرعي فقط مع عناصر المحتوى "الترويسة" ومع عناصر المحتوى "النموذج" (بوصفه البريد الإلكتروني للمستلم).
fr: Un sous-titre est affiché seulement avec des éléments de contenu "Titre" et avec des éléments de contenu "Forme" ( en tant que mail du destinataire).
it: Il sottotitolo viene visualizzato sempre sotto l'intestazione, in tutti gli Elementi di Contenuto dove previsto; per esempio, nei tipi di contenuto "Form" e "HTML" il sottotitolo non è disponibile.

# bodytext.description
source: Enter the main text.
ar: أدخل النص الرئيس.
fr: Entrez le texte principal.
it: Questo campo ha diverse denominazioni a seconda del Tipo di contenuto. "Testo" (il testo dell'elemento), "Voci in Elenco" (le voci dell'elenco), "Contenuto della Tabella" (righe e colonne della tabella) o "Codice HTML" (il codice HTML).

# bodytext.details
source: The main text of the Content Element is entered here and can be formatted with HTML or a Rich Text Editor. The field is reused in other Content Element types so changing the type will cause any text to be reused in that new Content Element type. When you're using this field with the "Text" and "Text & Images" types, the content is normal body text. Each linebreak signifies a new paragraph, you can use the special TYPO3 tag, &lt;LINK&gt;, for making links. You can use many HTML tags but there are limitations depending on your website configuration. A Rich Text Editor is commonly used to add a visual editing interface for 'Text' and 'Text & Images' Content Elements. <b>Bullet Lists:</b> If the type is "Bullet List" each line in this field is a bullet item. <b>Tables:</b> If the type is "Table" each line represents a table row. Within each line, columns are divided by a vertical bar ('|'). A table row with 3 columns could look like "This is column 1 | Column 2 here | Third column!". The table wizard can also be used for creating tables and is much easier than hand coding them.
ar: يتم إدخال النص الرئيس لعنصر المحتوى هنا ويمكن تنسيقه باستخدام HTML أو محرر نص المتن. يُعاد استخدام الحقل في أنواع عناصر المحتوى الأخرى، لذا فإن تغيير النوع سيؤدي إلى إعادة استخدام أي نص في نوع عنصر المحتوى الجديد هذا. عند استخدام هذا الحقل مع النوعين "نص" و "نص & صورة"، يكون المحتوى نصاً أساسياً عادياً. كل سطر فاصل يشير إلى فِقْرة جديدة، يمكنك استخدام علامة TYPO3 الخاصة، &lt;LINK&gt;, لإنشاء الروابط. يمكنك استخدام العديد من علامات HTML ولكن هناك قيود مبنية على تكوين موقع الويب الخاص بك. يُستخدم محرر نص المتن بشكل شائع لإضافة واجهة تعديل مرئية لعناصر محتوى "النص" و "النص والصور". <b>قوائم متعددة:</b> إذا كان النوع هو "قائمة متعددة"، فإن كل سطر في هذا الحقل يكون عنصر تعداد قائمة <b>الجداول:</b> إذا كان النوع هو "جدول"، فإن كل سطر يمثل صف جدول. داخل كل سطر، يتم تقسيم الأعمدة بواسطة شريط عمودي ("|"). يمكن أن يبدو صف الجدول الذي يحتوي على 3 أعمدة مثل "هذا هو العمود 1 | العمود 2 هنا | العمود الثالث!". يمكن أيضاً استخدام معالج الجدول لإنشاء الجداول وهو أسهل بكثير من كتابته يدوياً.
fr: Le texte principal de l'élément de contenu est entré ici et peut être formaté avec du HTML ou un éditeur de texte riche. Le champ est réutilisé dans d'autres types d'éléments de contenu, donc le changement de type provoquera la réutilisation de n'importe quel texte dans ce nouveau type d'élément de contenu. Lorsque vous utilisez ce champ avec les types "Texte" et "Texte & Images", le contenu est du corps normal. Chaque saut de ligne signifie un nouveau paragraphe, vous pouvez utiliser la balise TYPO3 spéciale, &lt;LINK&gt;, pour créer des liens. Vous pouvez utiliser de nombreuses balises HTML, mais il y a des limitations selon la configuration de votre site Web. Un éditeur de texte enrichi est couramment utilisé pour ajouter une interface d'édition visuelle pour les éléments de contenu 'Texte' et 'Texte & Images' . <b>Listes de puces :</b> Si le type est "Liste de puces" chaque ligne dans ce champ est une puce. <b>Tableaux :</b> Si le type est "Table" chaque ligne représente une ligne de tableau. Dans chaque ligne, les colonnes sont divisées par une barre verticale ('|'). Une ligne de tableau avec 3 colonnes pourrait ressembler à "Ceci est la colonne 1 | Colonne 2 ici | Troisième colonne!". L'assistant de table peut également être utilisé pour créer des tables et est beaucoup plus facile que de les coder à la main.
it: La funzionalità del campo varia a seconda del tipo di contenuto. Vediamo caso per caso. <b>Testo</b> Lo troviamo nei tipi di contenuto "Testo", "Testo e Immagini" e "Testo e Multimedia". In questo caso, il campo, rappresenta il testo principale dell'elemento che sarà visibile nel frontend. Solitamente formattabile via RTE. È possibile inserire collegamenti interni o esterni e utilizzare molti dei tag HTML. La effettiva formattazione del testo, in frontend, dipende dal Template TypoScript e dai file di stile (css) caricati nel frontend. <b>Voci in Elenco</b> In questo caso è il campo relativo al tipo "Elenco": ogni riga nel campo, separate da un a capo, è una voce dell'elenco. <b>Contenuto della Tabella</b> Definisce le righe e le colonne del tipo "Tabella": ogni riga rappresenta una riga di tabella. All'interno di ogni riga, le colonne sono separate da una barra verticale ('|'). Una riga di tabella con 3 colonne potrebbe apparire come "Questa è la colonna 1 | Colonna 2 qui | Terza colonna!". La "Procedura Guidata Tabella" può essere utilizzata per la creazione di tabelle ed è molto più facile che farlo manualmente. <b>Codice HTML</b> È disponibile per il tipo "HTML": puoi inserire l'effettivo codice HTML che sarà utilizzato nel frontend senza nessuna ulteriore elaborazione.

# image.description
source: Insert one or more images.
ar: إدراج صورة واحدة أو أكثر.
fr: Insérez une ou plusieurs images.
it: Inserisci una o più immagini.

# image.details
source: You can attach multiple images to the Content Element. Depending on the configuration of TYPO3, you can attach images in many formats without worrying about size and compression. TYPO3's graphics processing handles these details for you. When you use the "Text & Images" type, it's important to select a proper position for images. For this purpose, use the Position and Alignment selector. See link to "Page Content / Position" below. You can also display images in multiple columns and even enable an option that opens full size images when thumbnails are clicked.
ar: يمكنك إرفاق صور متعددة لعنصر المحتوى. اعتماداً على تكوين TYPO3، يمكنك إرفاق صور في العديد من الصيغ دون القلق بشأن الحجم والضغط. يقوم معالج رسوم TYPO3 بهذه التفاصيل نيابةً عنك. عند استخدام عنصر المحتوى "نص & صور"، من المهم تحديد موضع مناسب للصور. ولهذا الغرض، استخدم أداة الموضع والمحاذاة. راجع الرابط إلى "Page Content / Position" أدناه. يمكنك أيضاً عرض الصور في أعمدة متعددة، وحتى يمكنك تفعيل خِيار يفتح صور الحجم الكامل عند النقر على الصور المصغرة.
fr: Vous pouvez associer plusieurs images à l'élément de contenu. Selon la configuration de TYPO3, vous pouvez attacher des images de formats différents sans vous soucier de la tailler ou de la compression. Le traitement d'image de TYPO3 s'occupera du nécessaire pour vous. Quand vous utilisez le contenu "Texte & Images", il est important de choisir une disposition des images appropriée. A cette fin, utilisez les champs Position et Alignement. Se référer au lien "Contenu de page / Position" ci-dessous. Vous pouvez également afficher des images dans plusieurs colonnes, et aussi activer une option permettant d'ouvrir les images en taille réelle au clic sur les vignettes.
it: È possibile allegare più immagini all'Elemento di Contenuto. A seconda della configurazione di TYPO3, puoi allegare immagini in molti formati senza preoccuparti delle dimensioni e della compressione. L'elaborazione grafica di TYPO3 gestisce questi dettagli per te. Quando utilizzi il tipo "Testo e Immagini", è importante selezionare una posizione corretta per le immagini. A questo scopo, utilizza il selettore "Posizione e Allineamento". Vedi il collegamento a "Contenuto di Pagina / Posizione", qui sotto. È anche possibile visualizzare le immagini in più colonne e anche abilitare un'opzione che apre immagini di dimensione originale, quando le miniature sono cliccate.

# _image.seeAlso
source: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_frames, Using images ("Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Using images (Animation) | FILE:EXT:welcome/modsub/ani_10.gif
fr: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_frames, Utilisation d'images ("Getting Started") | https://docs. ypo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Utilisation d'images (Animation) | FILE:EXT:welcome/modsub/ani_10.gif
it: tt_content:imagewidth, tt_content:imageheight, tt_content:imageorient, tt_content:imageborder, tt_content:image_link, tt_content:image_zoom, tt_content:imagecols, tt_content:imagecaption, tt_content:image_frames, Usare le immagini ("Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Usare le immagini (Animation) | FILE:EXT:welcome/modsub/ani_10.gif

# _image.image
source: EXT:frontend/Resources/Public/Images/cshimages/ttcontent_5.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/ttcontent_5.png

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. Depending on user permissions, you may not be able to use all of them.
ar: هذا يظهر جميع الخيارات المتعلقة بإدراج الصور في عناصر المحتوى. اعتماداً على أُذونات المستخدم، قد لا تكون قادراً على استخدامها.
fr: Cela montre toutes les options relatives à l'insertion d'images dans l'élément de contenu. Suivant les droits d'utilisateur, vous pourrez ou non être capable de toutes les utiliser.
it: Questo mostra tutte le opzioni relative all'inserimento di immagini negli Elementi di Contenuto. A seconda dei permessi dell'utente, potresti non essere in grado di utilizzarli.

# imagewidth.description
source: Enter the width (in pixels) for displaying the image in the Frontend of your website.
ar: أدخل العرض (بالبكسل) لعرض الصورة في الواجهة الأمامية لموقع الويب الخاص بك.
fr: Entrez la largeur (en pixels) pour l'affichage de l'image dans le Frontend de votre site web.
it: Inserisci la larghezza (in pixel) della risorsa multimediale nel Frontend del sito web. La larghezza sarà applicata a tutte le risorse qui incluse.

# imagewidth.details
source: The TypoScript template is normally configured with maximum image width so you shouldn't need to specify a width. In unique cases, this provides additional flexibility though.
ar: عادة ما يتم تكوين قالب TypoScript مع أقصى عرض للصورة حتى لا تحتاج إلى تحديد العرض. غير أن ذلك يوفر مرونة إضافية في الحالات الفريدة.
fr: Le modèle de TypoScript est normalement configuré avec la largeur d'image maximale donc vous ne devriez pas avoir besoin de préciser une largeur. Dans de rares cas particuliers, cela vous procure davantage de fléxibilité.
it: Il Template TypoScript è normalmente configurato con la massima larghezza dell'immagine, quindi non dovresti specificare una larghezza. In casi particolari, tuttavia, ciò offre una maggiore flessibilità.

# imageheight.description
source: Enter the height (in pixels) for displaying the images in the Frontend of your website.
ar: أدخل الارتفاع (بالبكسل) لعرض الصور في واجهة موقعك.
fr: Entrez la hauteur (en pixels) de l'affichage de l'image dans le Frontend de votre site.
it: Inserisci l'altezza (in pixel) della risorsa multimediale nel Frontend del sito web. L'altezza sarà applicata a tutte le risorse qui incluse.

# imageorient.description
source: Select the position and alignment of the images relative to the body text.
ar: حدد موضع الصور ومحاذاتها فيما يتعلق بنص المتن.
fr: Sélectionnez la position et l'alignement des images relatives au corps de texte.
it: Seleziona la posizione e l'allineamento delle immagini rispetto al testo.
