Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: ar, fr, it

# .description
source: All visible content on webpages is typically made by "Page Content" records, often referred to as "Content Elements". Content Elements are managed by the "Page" Module which organizes Content Elements in multiple columns and languages.
ar: يتم عادةً إنشاء كل المحتوى المرئي على صفحات الويب بواسطة سجلات "محتوى الصفحة"، والتي تُسمّى عادةً باسم "عناصر المحتوى". تتم إدارة عناصر المحتوى بواسطة وحدة "الصفحة" التي تنظم عناصر المحتوى ضمن أعمدة ولغات متعددة.
fr: Tout contenu visible sur des pages web est typiquement construit à partir d'archives de contenus de page, auxquelles on se réfère souvent comme élément de contenu. Les éléments de contenu sont gérés par le module Page qui organise les éléments de contenu en multiples colonnes et langages.
it: Tutti i contenuti visibili nelle pagine web sono, solitamente, creati tramite i record "Contenuto di Pagina", che spesso viene definito come "Elemento di Contenuto". Gli elementi di contenuto sono gestiti tramite il modulo "Pagina" che li organizza in colonne multiple e lingua.

# .details
source: "Page Content" records are sortable and can be rearranged. The "Language" and "Column" selectors of the "Page Content" records determines when and where they appear. If you do not change the value of the "Language" and "Column" selectors the Content Element will appear in the default configuration.
ar: سجلات "محتوى الصفحة" قابلة للفرز ويمكن إعادة ترتيبها. تُحدد مُحددات "اللغة" و "العمود" لسجلات "محتوى الصفحة" متى وأين تظهر. إذا لم تغيير قيمة محددات "اللغة" و "العمود"، فسيظهر عنصر المحتوى في التكوين الافتراضي.
fr: Les archives de contenus de page sont triables et peuvent être réarrangées. Les sélecteurs de langue et de colonne des archives de contenus de page déterminent où et quand ils apparaissent. Si vous ne changez pas la valeur dans les sélecteurs de langue et de colonne, l'élément de contenu apparaitra dans la configuration par défaut.
it: I record "Contenuto di Pagina" sono ordinabili e possono essere riordinati. I selettori "Colonne" e "Lingue", dei record "Contenuto di Pagina", determinano quando e dove appariranno. Se non si cambia il valore dei selettori "Colonne" e "Lingue", l'elemento di contenuto apparirà nella configurazione predefinita.

# _.seeAlso
source: Page Content Principles | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
ar: مبادئ محتوى الصفحة | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
fr: Principes du contenu de la page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
it: Principi di Page Content | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout

# .image_descr
source: The Page Module is used to manage Content Elements arranged in columns and languages. A Content Element has an editing form with many options. The "Type" determines which options are visible. In the Frontend, a Content Element like the above could look like this.
ar: تُستخدم وُحدة الصفحة لإدارة عناصر المحتوى المُرتّبة في الأعمدة وحسب اللغات. يحتوي عُنصر المحتوى على نموذج للتعديل عليه، وفيه العديد من الخيارات. يحدد "النوع" الخيارات المرئية. في الواجهة الأمامية، يمكن لعنصر المحتوى مثل ما سبق أن يبدو هكذا.
fr: Le module Page est utilisé pour gérer les éléments de contenu arrangés en colonnes et langues.Un élément de contenu a une forme d'édition avec plusieurs options. Le "Type" détermine quelles options sont visibles. Au niveau Frontend, un élément de contenu comme celui ci-dessus pourrait ressembler à ça.
it: Il modulo Pagina è usato per gestire gli elementi di contenuto, disposti in colonne e lingue. Un elemento di contenuto ha una form-modifica con varie opzioni. Il "Tipo" definisce quali opzioni saranno disponibili. Nel frontend, un elemento di contenuto potrebbe apparire simile a quello sopra.

# CType.description
source: Select the kind of Page Content this element represents. New options will appear when you save the record.
ar: حدد نوع محتوى الصفحة الذي يُمثله هذا العنصر. ستظهر خيارات جديدة عند حفظ السجل.
fr: Sélectionnez le type de contenu de page que cet élément représente. De nouvelles options vont apparaitre quand vous sauvegardez l'archive.
it: Seleziona il tipo di Contenuto di Pagina che l'elemento rappresenta. Nuove opzioni saranno disponibili appena il record sarà salvato.

# CType.details
source: The 'Type' of content you select determines which options are available in the editing form so be sure to save the record before making other changes. This is a description of the various types: <strong>Header</strong> This type allows you to insert a standard Content Element header and nothing more. Almost all the other types described below also include the Header and its options. The Header type provides a way to insert a header without any other content. <strong>Text</strong> The Text type allows you to insert regular page content. It is generally used for text only content. <strong>Text & Images</strong> This is the same as the Text type (regular page content) but with the option of attaching images. <strong>Image</strong> The Image type allows you to insert image only page content. <strong>Bullet List</strong> Lets you create a bullet list. Each line in the text field will appear as a single bullet. <strong>Table</strong> Lets you create <em>simple</em> tables. Each line represents a row in the table and vertical bars ('|') separate each column. A popup wizard is also available. <strong>File Links</strong> Allows you to present a list of files for download. Thumbnails can be attached to the list and you can also display the file size. <strong>Form</strong> Lets you create mail forms using a special syntax or a popup wizard. <strong>Search</strong> This inserts a search box and also shows the search results when a search is performed on the page. <strong>Login</strong> Displays a login box for website users. This is only useful if you have already created website users and usergroups. <strong>Menu/Sitemap</strong> Offers a selection of menus and a sitemap you can insert on a page. <strong>Insert records</strong> This acts as placeholder for other records. With this content element, you can reuse multiple content elements from other pages. <strong>Insert plugin</strong> This will allows you to insert news, forums, guestbooks, lists of addresses, and other functionality. Plugins are typically provided by TYPO3 extensions. The available fields and required configuration depend on the extension. <strong>Divider</strong> This inserts a simple horizontal rule on a page. <strong>HTML</strong> This is plain HTML content. Anything added in the HTML Code of this Content Element will be displayed directly on the page without any preprocessing.
ar: يحدد "نوع" عنصر المحتوى الذي تُحدِدُه الخيارات المُتاحة في نموذج التعديل، لذا تأكّد من حفظ السِجل قبل إجراء تغييرات أخرى. إليك شرح لأنواع عناصر المحتوى المُختلفة: <strong>عنوان رئيس</strong> يسمح لك هذا النوع بإدراج عنوان عنصر محتوى عادي ولا شيء أكثر من ذلك. تشتمل جميع الأنواع الأخرى الموضحة أدناه تقريباً أيضاً على العنوان وخياراته. يوفر نوع العنوان طريقة لإدراج عنوان دون أي محتوى آخر. <strong>نص عادي</strong> يسمح لك نوع النص بإدراج محتوى صفحة عادي. يُستخدم هذا العنصر عُموماً للمحتوى النصّي فقط. <strong>نص & صورة</strong> هذا نفس نوع عنصر النص (محتوى الصفحة العادية) ولكن مع خِيار إرفاق صورة أو أكثر. <strong>صورة</strong> يسمح لك عنصر الصورة بإدراج صورة فقط في محتوى الصفحة. <strong>قائمة</strong> يتيح لك إنشاء قائمة ذات تعداد نقطي. سيظهر كل سطر في حقل النص كرمز نقطي واحد. <strong>جدول</strong> يتيح لك هذا العنصر إنشاء جداول <em>بسيطة</em>. يُمثل كل سطر صفّاً في الجدول بينما تفصل الأشرطة الرأسية ("|") كل عمود. يتوفر أيضاً مُعالج منبثق. <strong>ملفات للتحميل</strong> يسمح لك هذا العنصر تقديم قائمة بالملفات للتحميلها. يمكن إرفاق الصُور المصغّرة بالقائمة ويمكنك أيضاً عرض حجم المِلَفّ. <strong>نموذج</strong> يتيح لك هذا العنصر بإدراج نموذج باستخدام صيغة خاصة أو معالج منبثق. <strong>بحث</strong> يتيح لك هذا العنصر إدراج مربع بحث، ويعرض أيضاً نتائج البحث عند إجراء بحث على الصفحة. <strong>نموذج تسجيل الدخول</strong> لإدراج مربع تسجيل الدخول لمُستخدميّ الموقع الإلكتروني. هذا مفيد فقط إذا كنت قد أنشأت بالفعل مُستخدمين للواجهة الأمامية لموقع الويب ومجموعات المستخدمين. <strong>قائمة / فهرس الموقع الإلكتروني</strong> يقدم هذا العنصر مجموعة مختارة من القوائم وفهرس Sitemap الذي يمكنك إدراجه في الصفحة. <strong>إضافة سجلات</strong> يعمل هذا كعنصر نائب للسجلات الأخرى. باستخدام عنصر المحتوى هذا، يمكنك إعادة استخدام عناصر محتوى مُتعددة من صفحات أخرى. <strong>إدراج إضافة</strong> سيسمح لك ذلك بإدراج الأخبار والمنتديات ودفاتر الزوار وقوائم العناوين والوظائف الأخرى. يتم توفير الإضافات عادَةً بواسطة إضافات TYPO3. تعتمد الحُقول المُتاحة والتكوين المطلوب على الإضافة بحد ذاتها. <strong>خط فاصل</strong> يتيح لك هذا العنصر إدراج خط فاصل أُفقي بسيط على الصفحة. <strong>HTML</strong> هذا محتوى HTML عادي. سيتم عرض أي شيء مُضاف في كود HTML لعنصر المحتوى هذا مُباشرةً على الصفحة، دون أي مُعالجة مسبقة.
fr: Le 'Type' de contenu choisi détermine quelles options sont présentées dans le formulaire d'édition, donc veillez à sauvegarder l'enregistrement avant d'effectuer d'autres modifications. Voici une description des différentes types : <strong>Titre</strong> Ce type vous permet d'insérer simplement un titre de contenu, et rien d'autre. Quasiment tous les autres types de contenus décrits ci-après intègrent un titre. Le type "Titre" permet d'insérer un titre sans autre contenu. <strong>Texte</strong> Le type "Texte" permet d'insérer du contenu texte sur la page. Il est généralement utilisé pour insérer uniquement du texte. <strong>Texte & Images</strong> Similaire au contenu "Texte", avec la possibilité d'associer des images. <strong>Image</strong> Le type "Image" permet d'insérer une image sur la page. <strong>Liste à puce</strong> Permet de créer une liste à puce. Chaque ligne dans le champ texte sera traité comme une nouvelle puce. <strong>Tableau</strong> Permet de créer un tableau <em>simple</em>. Chaque ligne du champ texte représente une ligne du tableau, et les barres verticales ('|') séparent les colonnes. Un assistant est également disponible. <strong>Liens vers des fichiers</strong> Permet d'afficher une liste de fichiers à télécharger. Possibilité d'afficher les vignettes des fichiers et/ou la taille des fichiers. <strong>Formulaire</strong> Permet de créer un formulaire envoyé par email avec une syntaxe spéciale ou par un assistant. <strong>Recherche</strong> Affiche un champ de recherche et présente les résultats de recherche quand une recherche est lancée sur la page. <strong>Identification</strong> Affiche un formulaire d'identification pour les utilisateurs du site. Utile uniquement si vous avez déjà créé des utilisateurs et des groupes. <strong>Menu/Plan de site</strong> Propose une sélection de menus et plan de site que vous pouvez insérer sur la page. <strong>Insérer des enregistrement</strong> Agit comme un emplacement pour d'autre enregistrement. Avec ce type de contenu, vous pouvez réutiliser des enregistrements créés sur d'autres pages du site. <strong>Insérer un plugin</strong> Permet d'insérer le module d'actualité, forum, livre d'or, listes d'adresses et d'autres fonctionnalité. Les plugins sont la plupart du temps fournis par les extensions TYPO3. Les champs disponibles et la configuration nécessaire dépendent de l'extension. <strong>Séparateur</strong> Ceci insère un séparateur horizontal sur la page. <strong>HTML</strong> Permet de saisir du code HTML brut. Tout code HTML inséré dans ce contenu sera affiché directement sur la page, sans aucun traitement particulier.
it: Il "Tipo" di contenuto selezionato determina quali opzioni sono disponibili nella form-modifica, quindi assicurati di salvare il record prima di apportare altre modifiche. Di seguito una breve descrizione dei vari tipi di contenuto. <strong>Intestazione</strong> Questo tipo consente di inserire un'intestazione standard e nient'altro. Quasi tutti gli altri tipi descritti di seguito includono anche l'intestazione e le sue opzioni. Il tipo Intestazione fornisce un modo per inserire un'intestazione senza altri contenuti. <strong>Testo</strong> Il tipo Testo consente di inserire contenuto formattato nella pagina. Viene generalmente utilizzato per contenuti di solo testo. <strong>Testo e Immagini</strong> Questo è lo stesso del tipo Testo, ma con l'opzione di allegare delle immagini. <strong>Immagini</strong> Il tipo Immagini consente di inserire un contenuto, nella pagina, con solo immagini. <strong>Elenco</strong> Consente di creare un elenco. Ogni riga nel campo di testo apparirà come una singola voce dell'elenco. <strong>Tabella</strong> Consente di creare <em>semplici</em> tabelle. Ogni riga rappresenta una riga nella tabella e le barre verticali ('|') separano ogni colonna. È disponibile anche una procedura guidata. <strong>Collegamenti a File</strong> Consente di realizzare un elenco di file da scaricare. Le miniature possono essere allegate all'elenco e puoi anche visualizzare la dimensione del file. <strong>Form</strong> Consente di inserire una form, per l'invio di email, precedentemente creata dal modulo Web>Form. <strong>Form di Login</strong> Visualizza un riquadro di login per gli utenti del sito web. Questo è utile solo se hai già creato utenti del sito Web e gruppi di utenti. <strong>Mappa del Sito</strong> Offre una mappa del sito che puoi inserire in una pagina. <strong>Inserisci Record</strong> Questo funge da segnaposto per altri record. Con questo elemento di contenuto, puoi riutilizzare più elementi di contenuto da altre pagine. <strong>Inserisci Plugin</strong> Ti consentirà di inserire notizie, forum, guestbook, elenchi di indirizzi e altre funzionalità. I plugin sono in genere forniti dalle estensioni TYPO3. I campi disponibili e la configurazione richiesta dipendono dalle estensioni. <strong>Separatore</strong> Questo inserisce una semplice riga orizzontale su una pagina. <strong>HTML</strong> Questo è semplice contenuto HTML. Tutto ciò che viene aggiunto nel codice HTML di questo elemento di contenuto verrà visualizzato direttamente sulla pagina senza alcuna ulteriore elaborazione.

# _CType.seeAlso
source: tt_content:colPos, tt_content:sys_language_uid, About Content Elements | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
ar: tt_content:colPos, tt_content:sys_language_uid, حول عناصر المُحتوى | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
fr: tt_content:colPos, tt_content:sys_language_uid, À propos des éléments de contenu | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
it: tt_content:colPos, tt_content:sys_language_uid, Sugli Elementi di Contenuto | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/

# _CType.image
source: EXT:frontend/Resources/Public/Images/cshimages/ttcontent_4.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/ttcontent_4.png

# hidden.description
source: Uncheck this box if you wish to disable the Content Element and keep it from being displayed on the website.
ar: قم بإلغاء تحديد هذا المربع إذا كنت ترغب في تعطيل عنصر المحتوى ومنع عرضه على موقع الويب.
fr: Décochez cette option si vous souhaitez désactiver l'élément de contenu et ne pas l'afficher sur le site Web.
it: Deseleziona questa casella se desideri disabilitare l'Elemento di Contenuto ed evitare che sia mostrato sul sito web.

# starttime.description
source: Enter the date when the Content Element should be published and displayed on the website.
ar: أدخل التاريخ الذي يجب أن يتم فيه نشر عنصر المحتوى وعرضه على الموقع الإلكتروني.
fr: Entrez la date à laquelle l'élément de contenu devrait être publié et affiché sur le site.
it: Inserisci la data in cui l'Elemento di Contenuto deve essere pubblicato e visualizzato sul sito web.

# endtime.description
source: Enter the date when the Content Element should expire and disappear from the website.
ar: أدخل التاريخ الذي يجب أن ينتهي فيه عرض عنصر المحتوى على الموقع الإلكتروني ويختفي منه.
fr: Entrez la date à laquelle l'élément de contenu devra expirer et disparaitre du site.
it: Inserisci la data in cui l'Elemento di Contenuto dovrebbe scadere e scomparire dal sito web.

# fe_group.description
source: If Usergroup Access Rights are set to a usergroup name, only website users who are logged in and members of the selected usergroup will be able to view the Content Element. The special option 'Hide at Login' means the Content Element will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the Content Element visible for any logged in website user.
ar: إذا تم تعيين حقوق الوصول مجموعة المستخدم إلى اسم مجموعة المستخدم، فقط مُستخدمي الموقع الإلكتروني الذين سجّلوا الدخول وأعضاء مجموعة المستخدم المُحدّدة سيكونون قادرين على عرض عنصر المحتوى. الخِيار الخاص "إخفاء عند تسجيل الدخول" يعني أن عنصر المحتوى <em>لن يكون</em> مرئيّاً لأي من مُستخدمي الموقع الإلكتروني الذين تم سجلوا الدخول. وبالمثل، فإن خِيار "إظهار عند تسجيل دخول" سيجعل عنصر المحتوى مرئياً لأي مستخدم مسجل الدخول.
fr: Si les droits d'accès du groupe utilisateur sont définis pour un nom de groupe utilisateur, seuls les utilisateurs du site qui sont connecté et membres du groupe utilisateur sélectionné seront capable de voir l'élément de contenu. L'option spéciale " Cacher à la connexion" signifie que l'élément de contenu ne sera pas visible par aucun utilisateur du site qui est connecté. De la même manière, "Montrer à tous les connectés" rendra l'élément de contenu visible à tout utilisateur connecté au site.
it: Se i "Diritti di Accesso Gruppo Utenti FE" sono impostati su un gruppo utenti, solo gli utenti del sito web, che hanno effettuato l'accesso e sono membri del gruppo utenti selezionato, potranno visualizzare l'Elemento di Contenuto. L'opzione speciale 'Nascondi al login' significa che l'elemento di contenuto <em>non</em> sarà visibile per tutti gli utenti del sito web che hanno effettuato l'accesso. Allo stesso modo "Mostra al login" renderà visibile l'elemento di contenuto per qualsiasi utente loggato nel sito web.

# fe_group.details
source: The 'Hide at Login' option is is useful if you want to present information like "How to Login" that becomes irrelevant when a website user is actually logged in.
ar: خِيار "الإخفاء عند تسجيل الدخول" مفيد إذا كنت ترغب في تقديم معلومات مثل "كيفية تسجيل الدخول" التي تصبح غير ذات قيمة بعد تسجيل دخول مُستخدم الموقع الإلكتروني.
fr: Le "Cacher lors de la connexion" est utile si vous voulez présenter des informations comme "Comment se connecter" qui deviennent non pertinent quand un utilisateur du site est connecté.
it: L'opzione 'Nascondi al login' è utile se si desidera presentare contenuti informativi come, ad esempio, "Come fare il login", che diventano irrilevanti quando un utente di un sito web è effettivamente loggato.

# sys_language_uid.description
source: Select the system language of this Content Element. <strong>Notice:</strong> This will affect the Content Element visibility by limiting it to a certain language.
ar: حدد لغة النظام لعنصر المحتوى هذا. <strong>ملاحظة:</strong> سيؤثر هذا على رؤية عنصر المحتوى من خلال اقتصاره على لغة معينة.
fr: Sélectionnez le langage du système de cet élément de contenu. Note: Cela affectera la visibilité de l'élément de contenu en le restreignant à certaines langues.
it: Selezionare la lingua di sistema per questo elemento di contenuto. <strong>Nota:</strong> questo influenza l'elemento di contenuto limitandone la visibilità a specifiche lingue.

# sys_language_uid.details
source: This allows you to assign a specific language to the Content Element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
ar: هذا يسمح لك بتعيين لغة مُحددة لعنصر المحتوى. إذا حددت أي شيء غير القيمة الافتراضية، <em>لن يكون</em> العنصر مرئيّاً ما لم يتم تكوين اللغة المعينة أيضاً بواسطة قالب TypoScript. لغات النظام المتاحة يقوم المدير بإنشائها.
fr: Cela vous permet d'assigner un langage spécifique à un élément de contenu. Si vous sélectionner une langue autre que celle par défaut, l'élément ne sera pas visible sauf si la langue assignée est aussi configurée par le modèle du TypoScript.Les langages du système disponibles sont créés par l'administrateur.
it: Questo ti permette di assegnare una lingua specifica all'Elemento di Contenuto. Se selezioni qualcosa tranne il valore predefinito, l'elemento <em>non</em> sarà visibile a meno che la lingua assegnata non sia configurata anche dal Template TypoScript. Le lingue di sistema disponibili sono create dall'amministratore.

# layout.description
source: Select a Layout.
ar: اختر تصميماً.
fr: Sélectionnez une disposition.
it: Seleziona un Layout.

# layout.details
source: This option does not work by default for all Content Elements but your website may display Content Elements differently depending on the layout. The File Links Content Element does make use of the Layout field by default: "Normal" will provide a list of file links with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail for image files and an icon for other files. A black border is wrapped around the icon. "Layout 3" is similar to Layout 2, but without the black border.
ar: هذا الخِيار لا يعمل بشكل افتراضي لجميع عناصر المحتوى ولكن موقعك قد يعرض عناصر المحتوى بشكل مختلف اعتماداً على التخطيط. عنصر المحتوى "روابط الملفات" يستخدم حقل المظهر التالي بشكل افتراضي: "Normal" سيوفر قائمة من روابط الملفات دون صورة مصغرة. "التصميم 1" يضيف رمز مِلَفّ إلى يسار الرابط "التصميم 2" يضيف صورة مصغرة لملفات الصور ورمز لملفات أخرى. يتم تغليف الحدود السوداء حول الأيقونة. "التصميم 3" مماثل للتصميم 2، ولكن دون الحدود السوداء.
fr: Cette option ne marche pas par défaut pour tous les éléments de contenu, mais votre site web pour afficher les élément de contenu différemment suivant la disposition.L'élément de contenu Liens de fichiers fait usage du champ Disposition par défaut:"Normal" fournira une liste des liens de fichiers dans miniature."Disposition 1" ajoute un icône de fichier à gauche du lien."Disposition 2" ajoute un miniature des fichiers images et une icône pour les autres fichiers. Une bordure noire entoure l'icône."Disposition 3" est similaire à la Disposition 2, mais sans la bordure noire.
it: Questa opzione non funziona di default per tutti gli Elementi di Contenuto, ma il tuo sito web può visualizzare gli Elementi di Contenuto in modo diverso a seconda del layout scelto. La modalità di visualizzazione viene definita tramite il tuo Template TypoScript.

# colPos.description
source: Select the column position of this element. <strong>Notice:</strong> This may affect whether the Content Element is visible depending on your website template.
ar: حدد موضع العمود لهذا العنصر. <strong>ملاحظة:</strong> قد يؤثر هذا على ما إذا كان عنصر المحتوى مرئياً تَبَعاً لمظهر موقعك.
fr: Sélectionner la position de colonne de cet élément. <strong>Note:</strong> Cela peut rendre l'élément de contenu visible ou non, suivant le modèle de votre site web.
it: Seleziona la posizione della colonna di questo elemento. <strong>Nota:</strong> questo può influenzare il rendering solo se l'elemento di contenuto è visibile, ma dipende dal Template del tuo sito web.
