Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_ttc.xlf
Languages: ar

# CType_formlabel
source: Type
ar: النوع

# layout.I.1
source: Layout 1
ar: التصميم 1

# layout.I.2
source: Layout 2
ar: التصميم 2

# layout.I.3
source: Layout 3
ar: التصميم 3

# colPos
source: Columns
ar: الأعمدة

# colPos_formlabel
source: Column
ar: العمود

# colPos.I.0
source: Left
ar: اليسار

# colPos.I.1
source: Normal
ar: عادي

# colPos.I.2
source: Right
ar: اليمين

# colPos.I.3
source: Border
ar: إطار

# colPos.I.unused
source: Unused
ar: غير مُستخدم

source: Date
ar: التاريخ

# date_formlabel
source: Date
ar: التاريخ

source: Header
ar: الترويسة

# header_formlabel
source: Header
ar: الترويسة

# header.ALT.shortcut_formlabel
source: Name (not visible in frontend)
ar: الاسم (غير مرئي داخل الواجهة الأمامية)

# header.ALT.script_formlabel
source: Name (not visible in frontend)
ar: الاسم (غير مرئي داخل الواجهة الأمامية)

# header.ALT.div_formlabel
source: Name (not visible in frontend)
ar: الاسم (غير مرئي داخل الواجهة الأمامية)

# header.ALT.html_formlabel
source: Name (not visible in frontend)
ar: الاسم (غير مرئي داخل الواجهة الأمامية)

# header.description.ALT
source: The name won't be displayed as header above the element, but will be used as reference in menus.
ar: لن يتم عرض الاسم كترويسة فوق العنصر، ولكن سيتم استخدامه فقط كمرجع في القوائم.

# header_position
source: Align
ar: محاذاة

# header_position_formlabel
source: Alignment
ar: المحاذاة

# header_position.I.1
source: Center
ar: الوسط

# header_position.I.2
source: Right
ar: اليمين

# header_position.I.3
source: Left
ar: اليسار

# header_link
source: Link
ar: الرابط

# header_link_formlabel
source: Link
ar: الرابط

# header_layout_formlabel
source: Type
ar: النوع

# header_layout.I.1
source: Layout 1
ar: التصميم 1

# header_layout.I.2
source: Layout 2
ar: التصميم 2

# header_layout.I.3
source: Layout 3
ar: التصميم 3

# header_layout.I.4
source: Layout 4
ar: التصميم 4

# header_layout.I.5
source: Layout 5
ar: التصميم 5

# header_layout.I.6
source: Hidden
ar: مخفيّ

# bullets_type
source: Type of bullets
ar: نوع القائمة النُقطيّة

# bullets_type.0
source: Unordered list (bullets)
ar: قائمة غير مرتبة (نُقطيّة)

# bullets_type.1
source: Ordered list (numbers)
ar: قائمة مرتبة (الأرقام)

# bullets_type.2
source: Definition list
ar: قائمة التعريف

# imagewidth
source: Width (pixels)
ar: العرض (بكسل)

# imagewidth_formlabel
source: Width (px)
ar: العرض (px)

# imageheight
source: Height (pixels)
ar: الارتفاع (بكسل)

# imageheight_formlabel
source: Height (px)
ar: الطول (px)

# imageorient
source: Position
ar: الموضع

# imageorient_formlabel
source: Position and Alignment
ar: الموضع والمحاذاة

# imageorient.I.0
source: Above, center
ar: أعلى، وسط

# imageorient.I.1
source: Above, right
ar: أعلى، يمين

# imageorient.I.2
source: Above, left
ar: أعلى، يسار

# imageorient.I.3
source: Below, center
ar: أسفل، وسط

# imageorient.I.4
source: Below, right
ar: أسفل، يمين

# imageorient.I.5
source: Below, left
ar: أسفل، يسار

# imageorient.I.6
source: In text, right
ar: داخل النص، يمين

# imageorient.I.7
source: In text, left
ar: داخل النص، يسار

# imageorient.I.9
source: Beside Text, Right
ar: بجانب النص، يمين

# imageorient.I.10
source: Beside Text, Left
ar: بجانب النص، يسار

# imageborder
source: Border
ar: الحدود

# imageborder_formlabel
source: Border
ar: الحدود

# image_zoom
source: Click-enlarge
ar: انقر للتكبير

# image_zoom_formlabel
source: Enlarge on Click
ar: التكبير عند النقر

# imagecols
source: Columns
ar: الأعمدة

# imagecols_formlabel
source: Number of Columns
ar: عدد الأعمدة

# images.addFileReference
source: Add image
ar: أضف صورة

# cols
source: Columns
ar: الأعمدة

# cols.I.0
source: Auto
ar: تلقائي

# recursive.I.0
source: 0 levels (only selected page)
ar: 0 مستويات (الصفحة المُختارة فقط)

# recursive.I.1
source: 1 level
ar: مستوى 1

# recursive.I.2
source: 2 levels
ar: مستويان

# recursive.I.3
source: 3 levels
ar: 3 مستويات

# recursive.I.4
source: 4 levels
ar: 4 مستويات

# recursive.I.5
source: Infinite
ar: لا نهائي

# list_type
source: Plugin
ar: إضافة

# list_type_formlabel
source: Selected Plugin
ar: الإضافة المُحددة

# media
source: Files
ar: الملفات

# media.ALT.uploads_formlabel
source: Select single files
ar: حدد ملف واحد فقط

# media.addFileReference
source: Add file
ar: إضافة ملف

# multimedia
source: File
ar: الملف

# multimedia_formlabel
source: Selected Media File
ar: مِلَفّ الوسائط المُحدد

source: File collections
ar: مجموعات الملفات

# file_collections.ALT.uploads_formlabel
source: Select file collections
ar: حدد مجموعات الملفات

# filelink_size
source: Show File Size
ar: إظهار حجم الملف

# filelink_sorting
source: Sort file list
ar: تعديل قائمة الملفات

# filelink_sorting.none
source: no sorting
ar: لا يوجد فرز

# filelink_sorting.extension
source: by file extension
ar: حسب امتداد الملف

# filelink_sorting.name
source: by filename
ar: حسب اسم الملف

# filelink_sorting.type
source: by file type
ar: حسب نوع الملف

# filelink_sorting.size
source: by file size
ar: حسب حجم الملف

# filelink_sorting.creation_date
source: by file creation date
ar: حسب تاريخ إنشاء الملف

# filelink_sorting.modification_date
source: by file modification date
ar: حسب تاريخ تعديل الملف

# filelink_sorting.title
source: by file metadata title
ar: حسب عنوان البيانات الوَصفيّة للملف

# filelink_sorting_direction
source: Sorting direction
ar: اتجاه الفرز

# filelink_sorting_direction.ascending
source: Ascending (default)
ar: تصاعدي (افتراضي)

# filelink_sorting_direction.descending
source: Descending
ar: تنازلي

# filelink_size_formlabel
source: Display File Size Information
ar: عرض معلومات حجم الملف

source: Target
ar: الهدف

# target.I.1
source: New window
ar: نافذة جديدة

# records
source: Items
ar: عناصر

# records_formlabel
source: Records
ar: السجلات

# space_before_class
source: Space Before
ar: المسافة قبل

# space_before_class_formlabel
source: Space Before
ar: المسافة قبل

# space_after_class
source: Space After
ar: المسافة بعد

# space_after_class_formlabel
source: Space After
ar: المسافة بعد

# space_class_none
source: None
ar: لا شَيْء

# space_class_extra_small
source: Extra Small
ar: صغير جداً

# space_class_small
source: Small
ar: صغير

# space_class_medium
source: Medium
ar: متوسط

# space_class_large
source: Large
ar: كبير

# space_class_extra_large
source: Extra Large
ar: كبير جداً

# frame_class
source: Frame
ar: الإطار

# frame_class_formlabel
source: Frame
ar: الإطار

# frame_class.default
source: Default
ar: الإفتراضي

# frame_class.ruler_before
source: Ruler Before
ar: خط فاصل قبل

# frame_class.ruler_after
source: Ruler After
ar: خط فاصل بعد

# frame_class.indent
source: Indent
ar: المسافة البادئة

# frame_class.indent_left
source: Indent, 33/66%
ar: الإزاحة، 33/66%

# frame_class.indent_right
source: Indent, 66/33%
ar: الإزاحة، 66/33%

# frame_class.none
source: No Frame
ar: بدون إطار

# sectionIndex
source: Index
ar: الفهرس

# sectionIndex_formlabel
source: Show in Section Menus
ar: إظهار في قسم القوائم

# linkToTop
source: To top
ar: إلى الأعلى

# linkToTop_formlabel
source: Append with Link to Top of Page
ar: إلحاق مع الرابط إلى أعلى الصفحة

# pi_flexform
source: Plugin Options
ar: خيارات الإضافات

# accessibility_title
source: Block title
ar: عنوان الكتلة

# accessibility_bypass
source: Add link to bypass block
ar: إضافة رابط لتجاوز الكتلة

# accessibility_bypass_text
source: Link text to bypass block
ar: نص رابط لتجاوز الكتلة

source: Selected categories
ar: الفئات المُحددة

source: Category field
ar: حقل الفئة

# pages.ALT.menu_formlabel
source: Selected Pages
ar: الصفحات المُحددة

# pages.ALT.list_formlabel
source: Record Storage Page
ar: سجل صفحة التخزين

# menu.ALT.accessibility_title_formlabel
source: Menu block title
ar: عنوان كتلة القائمة

# menu.ALT.accessibility_bypass_formlabel
source: Add link to bypass navigation block
ar: إضافة رابط لتجاوز كتلة التنقل

# menu.ALT.accessibility_bypass_text_formlabel
source: Link text to bypass navigation block
ar: نص الرابط لتجاوز كتلة التنقل

# tabs.text
source: Text
ar: النص

# tabs.media
source: Media
ar: الوسائط

# tabs.plugin
source: Plugin
ar: إضافة

# subheader_formlabel
source: Subheader
ar: عنوان فرعي

# starttime_formlabel
source: Publish Date
ar: تاريخ النشر

# endtime_formlabel
source: Expiration Date
ar: تاريخ الإنتهاء

# fe_group_formlabel
source: Usergroup Access Rights
ar: حقوق وصول مجموعة المُستخدم

# layout_formlabel
source: Layout
ar: التصميم

# bodytext_formlabel
source: Text
ar: النص

# bodytext.ALT.bulletlist_formlabel
source: Bullet List
ar: قائمة نُقطيّة

# bodytext.ALT.html_formlabel
source: HTML Code
ar: التعليمات البرمجية لـ HTML

# field.default.hidden
source: Visibility of content element
ar: ظُهور عنصر المحتوى

# field.table.bodytext
source: Table content
ar: محتوى الجدول

# palette.general
source: Content Element
ar: عنصر المحتوى

# palette.headers
source: Headlines
ar: العناوين

# palette.header
source: Header
ar: الترويسة

# palette.visibility
source: Visibility
ar: الظهور

# palette.access
source: Publish Dates and Access Rights
ar: تواريخ النشر وحقوق الوصول

# palette.frames
source: Content Element Layout
ar: تصميم عنصر المحتوى

# palette.imagelinks
source: Behavior
ar: السلوك

# palette.image_accessibility
source: Accessibility
ar: إمكانية الوصول

# palette.menu_accessibility
source: Accessibility
ar: إمكانية الوصول

# palette.uploads_layout
source: Filelinks Layout
ar: تصميم Filelinks

# palette.table_layout
source: Table Layout
ar: تصميم الجدول

# palette.appearanceLinks
source: Links
ar: روابط

# tabs.access
source: Access
ar: صَلاحِيَة الدخول

# tabs.appearance
source: Appearance
ar: المظهر

# tabs.behaviour
source: Behaviour
ar: السُلوك

# tabs.images
source: Images
ar: الصُور

# tabs.extended
source: Extended
ar: مُوَسَّعْ "Extended"

# tabs.accessibility
source: Accessibility
ar: إمكانية الوصول

# group.default
source: Typical page content
ar: محتوى الصفحة النموذجي "Typical"

# group.lists
source: Lists
ar: القوائم

# group.menu
source: Menu
ar: القائمة

# group.forms
source: Form elements
ar: عناصر النموذج

# group.special
source: Special elements
ar: عناصر خاصة

# group.plugins
source: Plugins
ar: الإضافات

# CType.header
source: Header Only
ar: الترويسة "Header" فقط

# CType.header.description
source: Adds a header only.
ar: إضافة ترويسة "Header" فقط.

# CType.text
source: Regular Text Element
ar: عنصر نصّي عادي "Regular"

# CType.text.description
source: A regular text element with header and bodytext fields.
ar: أضف نص عادي، يتضمّن حقول الترويسة "header" والمَتن "bodytext".

# CType.textpic
source: Text & Images
ar: نص & وصور

# CType.textpic.description
source: Any number of images wrapped right around a regular text element.
ar: أدرج عدداً من الصور المُتناسقة مع النص "مَتن".

# CType.textmedia
source: Text & Media
ar: نص & ووسائط متعددة "Media"

# CType.textmedia.description
source: Any number of media wrapped right around a regular text element.
ar: أضف عدداً من الوسائط "Media" المُتناسقة مع النص "مَتن".

# CType.image
source: Images Only
ar: صُور فقط

# CType.image.description
source: Any number of images aligned in columns and rows with a caption.
ar: أضف عدداً من الصور ليتم مُحاذاتها مع الأعمدة والصفوف،باإضافة إلى شرح توضيحي لها.

# CType.bullets
source: Bullet List
ar: قائمة نُقطيّة

# CType.bullets.description
source: A single bullet list.
ar: قائمة نُقطيّة واحدة.

# CType.table
source: Table
ar: الجدول

# CType.table.description
source: A simple table.
ar: جدول عادي.

# CType.uploads
source: File Links
ar: ملفات للتحميل "File Links"

# CType.uploads.description
source: Makes a list of files for download.
ar: هذا العنصر يقوم بعمل قائمة بالملفات لتحميلها.

# CType.menu_abstract
source: Abstracts
ar: مُلخّص

# CType.menu_abstract.description
source: Menu of subpages of selected pages including abstracts
ar: قائمة الصفحات الفرعية للصفحات المُحددة بما في ذلك الملخصات

# CType.menu_categorized_content
source: Categorized content
ar: مُحتوى تم تصنيفه

# CType.menu_categorized_content.description
source: Content elements for selected categories
ar: عناصر المحتوى للفئات المحددة

# CType.menu_categorized_pages
source: Categorized pages
ar: صفحات مُصنفة

# CType.menu_categorized_pages.description
source: Pages for selected categories
ar: صفحات الفئات المُحددة

# CType.menu_pages
source: Pages
ar: الصفحات

# CType.menu_pages.description
source: Menu of selected pages
ar: قائمة الصفحات المحددة

# CType.menu_subpages
source: Subpages
ar: الصفحات الفرعية

# CType.menu_subpages.description
source: Menu of subpages of selected pages
ar: قائمة الصفحات الفرعية للصفحات المُحددة

# CType.menu_recently_updated
source: Recently updated pages
ar: الصفحات التي تم تحديثها مُؤخرَاً

# CType.menu_recently_updated.description
source: Menu of recently updated pages
ar: قائمة بالصفحات التي تم تحديثها مُؤخراً

# CType.menu_related_pages
source: Related pages
ar: الصفحات ذات الصلة

# CType.menu_related_pages.description
source: Menu of related pages based on keywords
ar: قائمة بالصفحات ذات الصلة استناداً إلى الكلمات المُفتاحية

# CType.menu_section
source: Section index
ar: فهرس القسم

# CType.menu_section.description
source: Page content marked for section menus
ar: تم وضع علامة على محتوى الصفحة لقوائم القسم

# CType.menu_section_pages
source: Section index of subpages from selected pages
ar: فهرس القسم للصفحات الفرعية من الصفحات المُحددة

# CType.menu_section_pages.description
source: Menu of subpages of selected pages including sections
ar: قائمة الصفحات الفرعية للصفحات المُحددة بما في ذلك الأقسام

# CType.menu_sitemap
source: Sitemap
ar: فهرس الصفحة "Sitemap"

# CType.menu_sitemap.description
source: Expanded menu of all subpages of the current site
ar: قائمة مُوسّعَة لجميع الصفحات الفرعية للموقع الحالي

# CType.menu_sitemap_pages
source: Sitemaps of selected pages
ar: فهرس الصفحات المُحددة

# CType.menu_sitemap_pages.description
source: Expanded menu of all subpages for selected pages
ar: قائمة مُوسّعَة لجميع الصفحات الفرعية التابعة للصفحات المُحددة

# CType.shortcut
source: Insert records
ar: ادراج سجلات أو عناصر

# CType.shortcut.description
source: With this element you can embed other content elements.
ar: من خلال هذا العنصر يمكنك تضمين عدة عناصر محتوى من صفحات أُخرى.

# CType.list
source: General Plugin
ar: إضافة عامة

# CType.list.description
source: Select this element type to insert a plugin which cannot be found amongst the options below.
ar: حدد هذا النوع من العناصر لإدراج إضافة ليست موجودة بين الخيارات أدناه.

# CType.div
source: Divider
ar: الفاصل

# CType.div.description
source: This element inserts a visual divider, which is by default a horizontal line.
ar: يُدرج هذا العنصر فاصلاً مرئياً، وهو عبارة عن خط أُفقي يفصل بين العناصر.

# CType.html
source: Plain HTML
ar: HTML عادي

# CType.html.description
source: With this element you can insert raw HTML code on the page.
ar: من خلال هذا العنصر، يمكنك إدراج Code HTML في الصفحة بشكل مباشر.

# asset_references
source: Media elements
ar: عناصر الوسائط

# asset_references.addFileReference
source: Add media file
ar: إضافة ملف الوسائط

# palette.gallerySettings
source: Gallery Settings
ar: إعدادات المعرض

# palette.mediaAdjustments
source: Media Adjustments
ar: تعديلات الوَسائط

# palette.mediaAdjustments.imagewidth
source: Width of each element (px)
ar: عرض كل عنصر (px)

# palette.mediaAdjustments.imageheight
source: Height of each element (px)
ar: طول كل عنصر (px)

# palette.mediaAdjustments.imageborder
source: Border around each element
ar: الإطار حول كل عنصر

# uploads_description
source: Display description
ar: عرض الوَصف

# uploads_type
source: Display file/icon/thumbnail
ar: عرض المِلَفّ/الأيقونة/الصورة المُصغّرة

# uploads_type.0
source: Only file name
ar: فقط اسم المِلَفّ

# uploads_type.1
source: File name and file extension icon
ar: اسم المِلَفّ وأيقونة مِلَفّ الإضافة

# uploads_type.2
source: File name and thumbnail (if possible)
ar: اسم المِلَفّ والصورة المُصغّرة (إن أمكن)

# table_class
source: Table style
ar: مظهر الجدول

# table_class.default
source: Default
ar: الإفتراضي

# table_class.striped
source: Striped
ar: مُخطّطْ

# table_class.bordered
source: Bordered
ar: مُحدّد بإِطار

source: Table caption
ar: وَصف الجدول

# table_delimiter
source: Field Delimiter
ar: مُحدِّد الحقل

# table_delimiter.124
source: | (Pipe)
ar: | (خط عمودي)

# table_delimiter.59
source: ; (Semicolon)
ar: ; (فاصلة منقوطة)

# table_delimiter.58
source: : (Colon)
ar: : (نقطتان)

# table_delimiter.44
source: , (Comma)
ar: ، (فاصلة)

# table_delimiter.9
source: ⇥ (Tab)
ar: ⇥ (مُحاذاة)

# table_enclosure
source: Text enclosure
ar: نطاق النص

# table_enclosure.0
source: None
ar: لا شَيْء

# table_enclosure.39
source: ' (Single quotes)
ar: ' (علامة اقتباس)

# table_enclosure.34
source: " (Double quotes)
ar: " (علامة اقتباس مُزدوجة)

source: Table header position
ar: موضع رأس الجدول

# table_header_position.0
source: No header
ar: بدون ترويسة

# table_header_position.1
source: Top
ar: الأعلى

# table_header_position.2
source: Left
ar: اليسار

# table_tfoot
source: Use table footer (wrap last row with <tfoot> tags)
ar: استخدام تذييل الجدول (غلّف الصف الأخير بهذه العلامات <tfoot>)
