Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_weblayout.xlf
Languages: ar, it

# .alttitle
source: Web > Page Module
ar: الويب > وحدة الصفحة
it: Modulo Web>Pagina

# .description
source: The page module is activated from the backend menu and is the primary module for all basic CMS operations you need to perform when maintaining website content.
ar: يتم تفعيل وحدة الصفحة من قائمة الواجهة الخلفية، وهي الوحدة الأساسية لجميع عمليات نظام إدارة المحتوى التي تحتاج إلى تنفيذها عند الحفاظ على محتوى الموقع الإلكتروني.
it: Il modulo Web>Pagina viene attivato dal menù di backend ed è il modulo principale con il quale effettuare tutte le operazioni di base del CMS che sono necessarie per mantenere i contenuti del sito web.

# .details
source: Selecting the module will display the page tree. Click the title of the page you wish to edit content on, and in the right frame you will see the content of the page displayed by the Page module. The page module has various modes of display of content; <b>Columns</b> The columns view will show Content Elements listed in the columns and in the order that they will appear on the website. A panel of buttons will allow you to hide/unhide, move and edit the elements easily. <b>QuickEdit</b> In QuickEdit the first element on the page will be loaded into a form right away. It will depend on the implementation of your website as well as your general preferences if you like this mode more than the columns view. <b>Languages</b> If your site supports multiple languages and uses the "one-tree-fits-all" concept for localization you will need this mode to control the translations of the content elements on a page. <b>Page information</b> The page information view shows some statistical data about a page. This includes hit statistics if available. <b>General options</b> In the top of the Page module you will find a row of icons that will bring you right to various features such as History/Undo (1), Create new content element (2), Move page (3), Create new page (4) and Edit page properties (5). See image below. <b>Defining number of displayed columns [Admin]</b> Administrators can configure the Page module to display only the content columns that the website uses. This is done by Page TSconfig (so it can be configured per branch in the page tree!) and this particular option has the object path "mod.web_layout.tt_content.colPos_list". For instance "mod.web_layout.tt_content.colPos_list = 0,3" will set the display of the "Normal" and "Border" columns only. There are many other options for customization of the Page module in the object path "mod.web_layout" and Administrators should refer to the "TSconfig" reference linked to below.
ar: سيؤدي تحديد الوحدة هذه إلى عرض شجرة الصفحات. انقر على عنوان الصفحة التي تريد تعديل محتواها، وسيظهر لك محتوى الصفحة المَعرُوضة بواسطة وحدة الصفحة. وحدة الصفحة لديها طرق مختلفة لعرض المحتوى. منها مثلاً: <b>الأعمدة</b> هذه الطريقة تُظهر عناصر المحتوى المُدرجة في الأعمدة، وبالترتيب الذي تظهر به على الموقع الإلكتروني. تسمح لك لوحة الأزرار بإخفاء/إظهار، نقل وتعديل العناصر بسهولة. <b>التعديل السريع</b> بواسطة طريقة QuickEdit، سيتم تحميل العنصر الأول على الصفحة في نموذج على الفور. سيعتمد ذلك على تنفيذ موقع الويب الخاص بك بالإضافة إلى تفضيلاتك العامة إذا كنت تحب هذا الوضع أكثر من عرض الأعمدة. <b>اللغات</b> إذا كان موقعك الإلكتروني يدعم عدّة لُغات ويستخدم مفهوم "one-tree-fits-all" للترجمة، فستحتاج إلى هذا الوضع للتحكم في تَرْجَمَة عناصر المحتوى على الصفحة. <b>معلومات الصفحة</b> هذه الطريقة تعرض بعض البيانات الإحصائية حول الصفحة. يتضمن هذا إحصائيات الزيارات إذا كانت متوفرة. <b>الخيارات العامّة</b> ستجد في الجزء العلوي من وحدة الصفحة صفّاً من الرموز التي ستعيد توجيهك مُباشرةً إلى العديد من الميزات مثل السجل/التراجع عن (1)، إنشاء عنصر محتوى جديد (2)، نقل الصفحة (3)، إنشاء صفحة جديدة (4) وتعديل خصائص الصفحة (5). انظر الصورة أدناه. <b>تحديد عدد الأعمدة المَعرُوضة [Admin]</b> يمكن للمشرفين تكوين وحدة الصفحة لعرض أعمدة المحتوى التي يستخدمها موقع الويب فقط. يتم ذلك عن طريق Page TSconfig (بحيث يمكن تهيئتها لكل فرع في شجرة الصفحة!) وهذا الخِيار المحدد له مسار الكائن "mod.web_layout.tt_content.colPos_list". على سبيل المثال: "mod.web_layout.tt_content.colPos_list = 0،3" سيعين عرض عمودي "Normal" و "Border" فقط. هناك العديد من الخيارات الأخرى لتخصيص وحدة الصفحة في مسار الكائن "mod.web_layout" ويجب على المشرفين الرجوع إلى مرجع "TSconfig" المرتبط أدناه.
it: Selezionando il modulo verrà visualizzato l'Albero delle Pagine. Fai clic sul titolo della pagina per la quale vuoi modificare il contenuto e nel riquadro di destra vedrai i contenuti della pagina visualizzati dal modulo Pagina. Il modulo Pagina ha varie modalità di visualizzazione del contenuto. <b>Colonne</b> La funzionalità "Colonne" mostra gli elementi di contenuto elencati nelle colonne e nell'ordine in cui appariranno sul sito web. Puoi nascondere/mostrare, spostare e modificare facilmente gli elementi. <b>Lingue</b> Se il tuo sito supporta più lingue e utilizza un solo Albero delle Pagine per tutte le lingue, avrai bisogno di questa modalità per controllare le traduzioni degli elementi di contenuto su una pagina. <b>Definizione del numero di colonne visualizzate [Admin]</b> Gli amministratori possono configurare il modulo Pagina per visualizzare solo le colonne di contenuto che il sito web utilizza. Questo è fatto dal TSconfig di Pagina (quindi può essere configurato per ogni singolo ramo nell'Albero delle Pagine! e questa particolare opzione ha il percorso TS "mod.web_layout.tt_content.colPos_list". Per esempio "mod.web_layout.tt_content.colPos_list = 0,3" imposta solo la visualizzazione delle colonne "Normale" e "Bordo". Ci sono molte altre opzioni, per la personalizzazione del modulo Pagina, nel percorso TS "mod.qeb_layout" e gli amministratori possono trovare dettagli nella Guida di Riferimento "TSconfig" allegata a sotto.

# _.seeAlso
source: Configuring the Page module [Technical] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, About the page module | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Editing a page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ The Page Module (Animation) | Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
ar: تكوين وحدة الصفحة [Technical] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, حول وحدة الصفحة | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ تعديل الصفحة | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ وحدة الصفحة (Animation) | باستخدام وحدة الصفحة (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
it: Configurazione modulo Pagina [Tecnico] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, Il modulo Pagina | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Modifica di una pagina | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ Il Modulo Pagina (Animazione) | Uso dell'albero delle pagine (Animazione) | FILE:EXT:welcome/modsub/ani_05.gif

# .image_descr
source: Click the Page module, then the title of a page in the page tree. The page module is now activated in the right frame, showing the content of the page you clicked in the page tree. These buttons are direct links to the History/Undo function (1), Create new content element wizard (2), Move page wizard (3), Create new page wizard (4) and Edit page properties form (5). See the links for more details.
ar: انقر فوق وحدة الصفحة، ثم عنوان صفحة ما في شجرة الصفحة. تم تفعيل وحدة الصفحة الآن في الإطار الصحيح، تظهر محتوى الصفحة التي قمت بالضغط عليها في شجرة الصفحة. هذه الأزرار هي روابط مباشرة إلى السجل/التراجع عن (1)، إنشاء عنصر محتوى جديد (2)، إمكانية نقل الصفحة (3)، إنشاء صفحة جديدة (4) وتعديل نموذج خصائص الصفحة (5). راجع الروابط لمزيد من التفاصيل.
it: Seleziona il modulo Pagina e poi fai clic sul titolo di una pagina nell'Albero delle Pagine. Il modulo Pagina è ora attivo sulla parte destra dello schermo e mostra i contenuti della pagina selezionata nell'Albero delle Pagine. Questi bottoni sono direttamente collegati alle funzioni di Cronologia/Annulla (1), Procedura guidata per la creazione di un nuovo elemento di contenuto (2), Procedura guidata per lo spostamento di una pagina (3), Procedura guidata per la creazione di una nuova pagina (4) e form di modifica delle proprietà della pagina (5). Segui i collegamenti per ulteriori dettagli.

# quickEdit.alttitle
source: Quick Edit
ar: التعديل السريع
it: Modifica Rapida

# quickEdit.description
source: The Quick Editor gives you direct access to the form fields of the page content.
ar: يتيح لك "التعديل السريع" الوصول المباشر إلى حقول النموذج في محتوى الصفحة.
it: La Modifica Rapida ti da la possibilità di poter avere accesso diretto ai campi degli elementi di contenuto.

# quickEdit.details
source: The Quick Editor is designed to cut down the number of clicks involved in getting to edit the page content. Simply by clicking the page title in the page tree you've got the first content element in the normal column loaded in the list frame. In the toolbar in the top you can select the other content elements on the page in the selector box.
ar: تم تصميم "Quick Editor" لتقليل عدد النقرات التي تؤدي إلى الوصول إلى تعديل محتوى الصفحة. ببساطة بالنقر على عنوان الصفحة في شجرة الصفحة لديك عنصر المحتوى الأول في العمود العادي الذي تم تحميله في إطار القائمة. في شريط الأدوات في الجزء العلوي يمكنك تحديد عناصر المحتوى الأخرى في الصفحة في مربع الاختيار.
it: La Modifica Rapida è progettata per ridurre il numero di clic coinvolti nella modifica del contenuto della pagina. Semplicemente facendo clic sul titolo della pagina, nell'albero delle pagine, hai il primo elemento di contenuto nella colonna Normale caricata nel riquadro a destra. Nella barra degli strumenti in alto è possibile selezionare gli altri elementi di contenuto sulla pagina.

# _quickEdit.image
source: EXT:frontend/Resources/Public/Images/cshimages/pagemodule_5.png
ar: EXT:frontend/resourcesces/Public/Images/cshimages/pagemodule_5.png

# quickEdit.image_descr
source: The QuickEdit view cuts of one extra click by bringing the user directly to the editing form after clicking a page title in the page tree. The record shown is always the first content element from the Normal column.
ar: يستطيع "QuickEdit" أخذ المستخدم بنقرة واحدة مباشرةً إلى نموذج التعديل بعد النقر فوق عنوان صفحة ما في شجرة الصفحة. السجل المعروض هو دائماً عنصر المحتوى الأول من العمود العادي.
it: La Modifica Rapida elimina una serie di clic, portando l'utente direttamente alla form-modifica, dopo aver fatto clic su un titolo della pagina, nell'Albero delle Pagine. Il record mostrato è sempre il primo elemento di contenuto dalla colonna Normale.

# quickEdit_selElement.alttitle
source: Content Elements
ar: عناصر المحتوى
it: Elementi di Contenuto

# quickEdit_selElement.description
source: This is an overview of the content elements on this page in QuickEdit mode. Select another element to edit or click a "New" icon to create a new content element.
ar: هذه نظرة عامّة على عناصر المحتوى في هذه الصفحة في وضع التعديل السريع "QuickEdit". حدد عنصراً آخر لتعديله أو انقر على أيقونة "جديد" لإنشاء عنصر محتوى جديد.
it: Questa è una panoramica degli elementi di contenuto di questa pagina in modalità Modifica Rapida. Seleziona un altro elemento per modificare o clicca sull'icona "Nuovo" per creare un nuovo elemento di contenuto.

# quickEdit_selElement.image_descr
source: Overview of page content elements in the QuickEdit view. In the bottom there are links to two wizards: The "Move Content Element Wizard" and the "Create new Content Element Wizard". See the links below.
ar: نظرة عامّة على عناصر محتوى الصفحة في عرض التعديل السريع "QuickEdit". في الأسفل هناك روابط إلى معالجين: "نقل عنصر المحتوى" و "إنشاء عنصر جديد لعنصر المحتوى". انظر الروابط أدناه.
it: Panoramica degli elementi di contenuto della pagina in Modifica Rapida. In basso ci sono collegamenti a due procedure guidate: "Sposta un Elemento di Contenuto" e "Crea Nuovo Elemento di Contenuto". Vedi i riferimenti qui sotto.

# columns_1.alttitle
source: Listing by Columns
ar: الإدراج حسب الأعمدة
it: Lista per Colonne

# columns_1.description
source: In the "Columns" view you can manage the content of a web page. If your web page supports multiple columns, you will be able to arrange your content elements in columns.
ar: في عرض "الأعمدة" يمكنك إدارة محتوى صفحة ويب. إذا كانت صفحة الويب الخاصة بك تدعم أعمدة مُتعددة، فستتمكن من ترتيب عناصر المحتوى الخاصة بك في الأعمدة.
it: Con la visualizzazione "Colonne" è possibile gestire il contenuto di una pagina web. Se la tua pagina web supporta più colonne, sarai in grado di organizzare i tuoi elementi di contenuto in colonne.

# _columns_1.image
source: EXT:frontend/Resources/Public/Images/cshimages/pagemodule_12.png
ar: EXT:frontend/resourcesces/Public/Images/cshimages/pagemodule_12.png

# columns_1.image_descr
source: When your website supports multiple content element zones in the template you will be able to use another column than the "Normal" column. Here the "Left" column is enabled. TYPO3 offers four columns by default, "Normal", "Right", "Left" and "Border". Their significance depends on individual implementations in the frontend templates.
ar: عندما يدعم موقعك الإلكتروني عدّة مناطق عناصر محتوى في القالب، ستتمكن من استخدام عمود آخر من عمود "عادي". هنا يتم تفعيل عمود "اليسار". TYPO3 يقدم أربعة أعمدة بشكل افتراضي، "Normal", "Right", "Left" and "Border". تعتمد أهميتها على التطبيقات الفردية في قوالب الواجهة الأمامية.
it: Quando il tuo sito web supporta più zone di Elementi di Contenuto nel Template, sarai in grado di utilizzare un'altra colonna rispetto alla colonna "Normale". Qui la colonna "Sinistra" è abilitata. TYPO3 offre quattro colonne per impostazione predefinita, "Normale", "Destra", "Sinistra" e "Border". Il loro significato dipende dalle singole implementazioni nei Template di frontend.

# columns_2.alttitle
source: Listing by Language
ar: الإدراج حسب اللغة
it: Lista per Lingua

# columns_2.description
source: In the "Languages" view you can control the content of the web page as it is divided into languages and columns. It enables users to create a new translation of a page.
ar: في طريقة عرض "اللغات" يمكنك التحكم في محتوى صفحة الويب المُقسّم إلى لغات وأعمدة. يُمكّن هذا المُستخدمين من إنشاء تَرْجَمَة جديدة للصفحة.
it: Con la visualizzazione "Lingue" è possibile controllare il contenuto della pagina web, in quanto è diviso in lingue e colonne. Consente agli utenti di creare una nuova traduzione di una pagina.

# columns_2.image_descr
source: In the Language view you can select to create a new translation of the page if one does not exist already. The available languages must be defined first by language records created in the root of the page tree. This example shows how page content for three languages is shown side-by-side in the Page module. In the top of the Page module you can also select between the available translations... ... and if you select any of the additional languages (here "Danish" and "German") you will see the default language displayed side-by-side with the selected language
ar: في طريقة عرض اللغة، يمكنك اختيار إنشاء تَرْجَمَة جديدة للصفحة إذا لم تكن موجودة بالفعل. اللغات المُتاحة يجب تعريفها أولاً بواسطة سِجلات اللغة التي تمَّ إِنشاؤها في جذر شجرة الصفحة. هذا المثال يوضح كيف يتم عرض محتوى الصفحة لثلاث لغات جنباً إلى جنب في وحدة الصفحة. في الجزء العلوي من وحدة الصفحة يمكنك أيضاً الاختيار بين الترجمات المُتاحة. ... وإذا قمت بتحديد أيّ من اللغات الإضافية (هنا "الدنماركية" و "الألمانية") سترى اللغة الافتراضية المعروضة جنباً إلى جنب مع اللغة المُختارة
it: Con la visualizzazione "Lingue" è possibile creare una nuova traduzione della pagina se non esiste già. Le lingue disponibili devono essere definite coi record "Lingua del Sito Web", creati nel nodo TYPO3 (uid=0) dell'Albero delle Pagine. Questo esempio mostra come viene mostrato il contenuto della pagina per tre lingue, nel modulo Pagina. In alto, nel modulo Pagina, puoi anche selezionare tra le traduzioni disponibili. . ... e se selezioni una qualsiasi delle lingue aggiuntive (qui "danese" e "tedesco") vedrai la lingua predefinita visualizzata, con la lingua selezionata

# columns_3.alttitle
source: Page Information
ar: معلومات الصفحة
it: Informazioni pagina

# columns_3.description
source: In the "Page Information" view you can see various statistics about a page.
ar: في عرض "معلومات الصفحة" يمكنك رؤية إحصائيات مختلفة حول الصفحة.
it: In "Informazioni Pagina" puoi visualizzare diverse statistiche riguardanti la pagina.

# columns_3.details
source: The page information reveals information such as the date of creation and last modification of the page and its content. You can also see the subtitle, keywords and descriptions. This information is often used on websites for meta data or searching.
ar: معلومات الصفحة تكشف عن معلومات مثل تاريخ إنشاء الصفحة وتعديلها الأخير ومُحتواها. يمكنك أيضاً رؤية التَّرْجَمَةً والكلمات الرئيسية والأوصاف. غالباً ما تُستخدم هذه المعلومات على مواقع الويب للبيانات الوصفية أو البحث.
it: Le informazioni della pagina rivelano informazioni come la data di creazione e di ultima modifica della pagina e del suo contenuto. Puoi anche vedere il sottotitolo, le parole chiave e le descrizioni. Queste informazioni sono spesso usate sui siti web per i metadati o la ricerca.

# columns_single.alttitle
source: Page content elements in a single column
ar: عناصر محتوى الصفحة في عمود واحد
it: Elementi di contenuto di una pagina in una singola colonna

# columns_single.description
source: The single column view will show the page content elements that define the content on this page of your website. Click an edit icon or element text to edit an element.
ar: عرض العمود الواحد سيُظهر عناصر محتوى الصفحة التي تُحدد المحتوى في هذه الصفحة من موقع الويب الخاص بك. انقر فوق رمز التعديل أو النصوص في العنصر لتعديله.
it: La visualizzazione in singola colonna mostra gli elementi di contenuto della pagina che definiscono il contenuto di questa pagina, del tuo sito web. Fai clic sull'icona di modifica o sul testo dell'elemento per modificare l'elemento di contenuto.

# columns_single.details
source: You can also hide, delete and move elements by using the control panels. Clicking the "New content element" icon you will be able to create new content elements in between the existing elements on the page. Click the icon of a content element if you wish to access the context menu of the element.
ar: يمكنك أيضاً إخفاء وحذف ونقل العناصر باستخدام لوحات التحكم. بالنقر على أيقونة "عنصر محتوى جديد" سوف تكون قادراً على إنشاء عناصر محتوى جديدة بين العناصر الموجودة على الصفحة. انقر فوق أيقونة عنصر المحتوى إذا كنت ترغب في الوصول إلى قائمة السياق للعنصر.
it: È inoltre possibile nascondere, eliminare e spostare elementi. Facendo clic sul bottone "Contenuto", potrai creare nuovi elementi di contenuto tra gli elementi esistenti nella pagina. Fai clic sull'icona di un elemento di contenuto se desideri accedere al menù contestuale dell'elemento.

# columns_single.image_descr
source: Content Elements on a page are arranged in a specific order - the order they appear on the website. This order is also shown in the page module. The control panel allows you to move elements up and down as well as edit, hide and delete them. You can also just click the preview text shown here to access the editing form of the element.
ar: يتم ترتيب عناصر المحتوى على الصفحة بترتيب مُحدّد - الترتيب الذي تظهر على الموقع. هذا الطلب يظهر أيضاً في وحدة الصفحة. لوحة التحكم تسمح لك بنقل العناصر إلى الأعلى والأسفل بالإضافة إلى تعديلها وإخفائها وحذفها. يمكنك أيضاً فقط النقر على نص المعاينة المعروض هنا للوصول إلى نموذج التعديل للعنصر.
it: Gli elementi di contenuto su una pagina sono disposti in un ordine specifico - l'ordine in cui appariranno sul sito web. Questo ordine è mostrato anche nel modulo Pagina. Puoi spostare gli elementi su e giù, modificarli, nasconderli o eliminarli. Puoi anche fare clic sul testo di anteprima qui mostrato per accedere alla form-modifica dell'elemento.

# button_panel.alttitle
source: The "Big Buttons"
ar: "الأزرار الكبيرة"
it: I "Grandi Bottoni"

# button_panel.description
source: These buttons will bring you to four most used functions in relation to building pages. From here you can edit the page properties (eg. the page title), you can move the current page to another position in the page tree, create a new page somewhere in the page tree or create new content elements on this page.
ar: ستأخذك هذه الأزرار إلى أربع وظائف، هي الأكثر استخداماً فيما يتعلق بصفحات البناء. من هنا يمكنك تعديل خصائص الصفحة (على سبيل المثال: عنوان الصفحة)، يمكنك نقل الصفحة الحالية إلى موضع آخر في شجرة الصفحة، إنشاء صفحة جديدة في مكان ما في صفحة شجرة أو إنشاء عناصر محتوى جديدة على هذه الصفحة.
it: Da qui puoi modificare le proprietà della pagina (es. il titolo della pagina), è possibile spostare la pagina corrente in un'altra posizione nell'Albero delle Pagine, creare una nuova pagina da qualche parte nell'albero delle pagine o creare nuovi elementi di contenuto in questa pagina.
