Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/frontend/Resources/Private/Language/*.locallang_csh_ttcontent.xlf
Languages: ar, fr, it

# menu_type.details
source: This is a short description of each type: <strong>Menu of selected pages</strong> This will create a menu with links to the pages in the Selected Pages list. <strong>Menu of subpages of selected pages</strong> This will create in a menu with links to the subpages of the pages in the Selected Pages list. If you do not specify any pages, the subpages to the current page will be used. <strong>Menu of subpages of selected pages (with abstract)</strong> Like the previous option, but also displays the content of the Abstract field (or the Description field) for each page in the menu. The Abstract field is given priority over the Description field if both are complete. <strong>Menu of subpages of selected pages + sections</strong> Like the previous option, but includes links to all Content Elements on the page that are marked to Show In Section Menus. <strong>Sitemap</strong> Generates a classic tree sitemap. Notice that the sitemap will begin from the current page unless you select another page instead. <strong>Section index (page content marked for section menus)</strong> This makes a menu of Content Elements on the selected pages for all Content Elements marked to Show In Section Menu. This is a great way to make an index at the top of the page. If you don't want certain Content Elements to appear in the list, just uncheck the Show in Section Menus checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and the updated page is not included in this list, clearing the Page Cache will resolve the issue. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords of the selected pages matched against the keywords of other pages.
ar: هذا وصف قصير لكل نوع: <strong>قائمة بالصفحات المُحددة</strong> سيؤدي هذا إلى إنشاء قائمة مع روابط للصفحات في قائمة الصفحات المُحددة. <strong>قائمة للصفحات الفرعية للصفحات المُختارة</strong> سيؤدي هذا إلى إنشاء قائمة مع روابط للصفحات الفرعية للصفحات في قائمة الصفحات المختارة. إذا لم تقم بتحديد أي صفحة، سيتم استخدام الصفحات الفرعية كالصفحة الحالية. <strong>قائمة للصفحات الفرعية للصفحات المُختارة (مع مُلخّص)</strong> مثل الخِيار السابق، ولكنه يعرض أيضاً محتوى حقل الخلاصة (أو حقل الوصف) لكل صفحة في القائمة. يتم إعطاء أولوية حقل الخلاصة على حقل الوصف إذا كان كلاهما مُكتملاً. <strong>قائمة الصفحات الفرعية للصفحات المُختارة + الأقسام</strong> مثل الخِيار السابق، ولكن يتضمن روابط لجميع عناصر المحتوى في الصفحة التي تم وضع علامة عليها لعرضها في قوائم القسم. <strong>فهرس الموقع</strong> يُنتج فهرس موقع شجرة كلاسيكية. لاحظ أن فهرس الموقع سيبدأ من الصفحة الحالية، إلا إذا قمت بتحديد صفحة أخرى بدلاً عنها. <strong>فهرس القسم (وضع علامة على محتوى الصفحات لقوائم الأقسام)</strong> وهذا يجعل قائمة عناصر المحتوى على الصفحات المُحددة لجميع عناصر المحتوى المؤشر عليها لعرضها في قائمة القسم. هذه طريقة رائعة لعمل فهرس في الجزء العلوي من الصفحة. إذا كنت لا تريد أن تظهر عناصر محتوى مُعينة في القائمة، فقط قم بإلغاء تحديد العرض في مربع الاختيار لقسم القوائم لتلك العناصر. <strong>الصفحات التي تم تحديثها مؤخراً</strong> وهذا يعرض الصفحات العشر التي تم تحديثها مؤخراً. <strong>إشعار:</strong> إذا قمت بتحديث صفحة ولم يتم تضمين الصفحة المُحدثة في هذه القائمة، قم بمسح ذاكرة التخزين المؤقت للصفحة وسوف تُحل المشكلة. <strong>الصفحات ذات الصلة (استناداً إلى الكلمات المفتاحيّة)</strong> تعرض صفحات أخرى ذات صلة استناداً إلى الكلمات المفتاحيّة للصفحات المُختارة مطابقة للكلمات المفتاحيّة للصفحات الأخرى.
fr: Ceci est une courte description de chaque type : <strong>Menu des pages sélectionnées</strong> Ceci va créer un menu avec des liens vers les pages de la liste des pages sélectionnées. <strong>Menu des sous-pages des pages sélectionnées</strong> Celles-ci seront créées dans un menu avec des liens vers les sous-pages des pages de la liste des pages sélectionnées. Si vous ne spécifiez aucune page, les sous-pages de la page courante seront utilisées. <strong>Menu des sous-pages des pages sélectionnées (avec résumé)</strong> Comme l'option précédente, mais affiche également le contenu du champ Résumé (ou du champ Description de la page) de chaque page du menu. Le champ Résumé a la priorité sur le champ Description si tous les deux sont renseignés. <strong>Menu des sous-pages des pages sélectionnées + sections</strong> Comme l'option précédente, mais inclut des liens vers tous les éléments de contenu de la page qui sont marqués pour afficher les menus de la section. <strong>Plan du site</strong> Génère un plan de site d'arborescence classique. Notez que le plan de site commencera à partir de la page en cours à moins que vous ne sélectionniez une autre page. <strong>Index de section (contenu de la page marqué pour les menus de section)</strong> Ceci affiche un menu d'éléments de contenu sur les pages sélectionnées pour tous les éléments de contenu marqués à afficher dans le menu de la section. C'est un excellent moyen de faire un index en haut de la page. Si vous ne voulez pas que certains éléments de contenu apparaissent dans la liste, décochez simplement la case Afficher dans les menus de section pour ces éléments. <strong>Pages récemment mises à jour</strong> Ceci affiche les 10 pages les plus récemment mises à jour. <strong>Avis :</strong> Si vous mettez à jour une page et que la page mise à jour n'est pas incluse dans cette liste, effacer le cache de la page résoudra le problème. <strong>Pages liées (basées sur des mots clés)</strong> Affiche d'autres pages en fonction des mots-clés des pages sélectionnées qui correspondent aux mots-clés des autres pages.
it: Di seguito una breve descrizione di ogni tipo. <strong>Pagine</strong> Crea un menù con collegamenti alle pagine nell'elenco Pagine selezionate. <strong>Sottopagine</strong> Crea un menù con collegamenti alle sottopagine delle pagine nell'elenco Pagine selezionate. Se non specifichi nessuna pagina, verranno utilizzate le sottopagine della pagina corrente. <strong>Abstract</strong> Esattamente come "Sottopagine", ma con l'aggiunta del contenuto del campo Abstract (o il campo Descrizione) per ogni pagina del menù. Al campo Abstract è data la priorità sul campo Descrizione se entrambi sono valorizzati. <strong>Indice Sezione</strong> Questo crea un menù di Elementi di Contenuto, sulle pagine selezionate, per tutti gli Elementi di Contenuto con l'opzione "Mostra in 'Indice Sezione'" attiva. Questo è un ottimo modo per fare un indice in testa alla pagina. Se non vuoi che qualche Elemento di Contenuto appaia nella lista, deseleziona l'opzione "Mostra in 'Indice Sezione'" per quegli elementi. <strong>Indice Sezione Sottopagine</strong> Esattamente come "Indice Sezione", ma relativo alle sottopagine delle pagine incluse nel campo Pagine selezionate. <strong>Mappa del sito</strong> Genera una mappa del sito web ad albero classico. Nota che la mappa del sito inizierà dalla pagina corrente a meno che tu non selezioni invece un'altra pagina. <strong>Pagine Aggiornate Recentemente</strong> Questo mostra le 10 pagine aggiornate di recente. <strong>Nota:</strong> se aggiorni una pagina e la pagina aggiornata non è inclusa in questo elenco, lo svuotamento della Cache di Pagina risolverà il problema. <strong>Pagine Correlate</strong> Visualizza 'altre pagine' sulla base delle parole chiave delle Pagine selezionate, abbinandole alle parole chiave di 'altre pagine'.

# list_type.description
source: Select a plugin to insert.
ar: حدد إضافة لإدخالها.
fr: Sélectionnez le plugin à insérer.
it: Seleziona un plugin da inserire.

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depend on which extensions are installed.
ar: قائمة الإضافات التي يمكنك إدراجها في الصفحة. تعتمد الإضافات المُتاحة على الإضافات التي تم تثبيتها.
fr: La liste des extensions que vous pouvez insérer sur une page. La disponibilité des extensions dépend des extensions qui sont installées.
it: La lista dei plugin che puoi inserire in una pagina. I plugin disponibili dipendono dalle estensioni installate.

# _list_type.image
source: EXT:frontend/Resources/Public/Images/cshimages/ttcontent_7.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/ttcontent_7.png

# media.description
source: Files can be added to the list here.
ar: يُمكن إضافة الملفات إلى القائمة هنا.
fr: Les fichiers peuvent être ajoutés à cette liste.
it: Aggiungi singoli file alla lista.

# multimedia.description
source: Insert a multimedia element here (ex. Flash movie)
ar: إدراج عنصر الوسائط المتعددة هنا (مثلاً: فيديو)
fr: Insérez un élément multimédia (ex. Film flash)
it: Inserisci qui un elemento multimediale (es. un filmato Flash)

# filelink_size.description
source: Enable the display of file sizes.
ar: تفعيل عرض أحجام الملفات.
fr: Activer l'affichage de la taille du fichier.
it: Abilita la visualizzazione delle dimensioni dei file.

# records.description
source: Insert records to be displayed on this page.
ar: إدراج السجلات التي سيتم عرضها في هذه الصفحة.
fr: Insérez les enregistrement à afficher sur cette page.
it: Inserisci i record da visualizzare in questa pagina.

# sectionIndex.description
source: If set, the Content Element will appear in Section Menus.
ar: في حالة الضبط، سيظهر عنصر المحتوى في قسم القوائم.
fr: Si défini, l'élément de contenu apparaîtra dans les menus de section.
it: Se impostato, l'Elemento di Contenuto apparirà negli Indici Sezione.

# sectionIndex.details
source: See more details about Section Menus by clicking below.
ar: لمراجعة المزيد من التفاصيل حول قوائم القسم، انقر أدناه.
fr: Pour plus de détails sur les menus de la section, cliquez ci-dessous.
it: Vedi maggiori dettagli sugli Indici Sezione.

# linkToTop.description
source: If checked, a small "To Top" link will be added after the Content Element, linking back to the top of the page.
ar: إذا تم تحديده، سيتم إضافة رابط صغير "إلى الأعلى" بعد عنصر المحتوى، يمكنك من العودة إلى أعلى الصفحة.
fr: Si cette case est cochée, un petit lien "Vers le haut" sera ajouté après l'élément de contenu, reliant le haut de la page.
it: Se selezionato, un piccolo "Torna Su" verrà aggiunto dopo l'Elemento Contenuto, per tornare all'inizio della pagina.

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text & Image" types (<em>in this Content Element only</em>).
ar: إذا تم تحديده، سيتم تعطيل مُعالج النصوص لأنواع "النص" و "النص & الصورة" (<em>في عنصر المحتوى هذا</em> فقط).
fr: Si coché, l'éditeur de texte enrichi sera désactivé pour les types "Texte" et "Texte & Image" (<em>dans cet élément de contenu seulement</em>).
it: Se selezionato, l'RTE sarà disabilitato per i tipi "Testo" e "Testo e Immagini" (<em>solo in questo elemento di contenuto</em>).

# pi_flexform.description
source: Plugin Configuration
ar: تكوين الإضافة
fr: Configuration du module
it: Configurazione Plugin

# pi_flexform.details
source: Some plugins may provide configuration options, but the actual options vary based on the plugin. Behind the scenes, these are based on FlexForms and stored as XML.
ar: قد توفر بعض الإضافات خيارات الإعداد، ولكن الخيارات الفعلية تختلف استناداً إلى الإضافة. خلف الكواليس، هذه تعتمد على FlexForms وتخزينها كـ XML.
fr: Certains plugins peuvent fournir des options de configuration, mais les options actuelles varient en fonction du plugin. Techniquement, ils sont basés sur FlexForms et stockés en XML.
it: Alcuni plugin possono fornire opzioni di configurazione, ma le opzioni reali variano in base al plugin. Tecnicamente parlando, queste sono basate su FlexForms e memorizzate come XML.

# _sys_language_uid.seeAlso
source: tt_content:colPos, sys_language, Localization concepts [Technical] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
ar: tt_content:colPos, sys_language, مبادئ التوطين [Technical] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
it: tt_content:colPos, sys_language, I concetti della localizzazione [Tecnico] | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/, _MOD_web_layout:language_list
