Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# onlineDocumentation
source: TYPO3 Online Documentation
it: Documentazione online di TYPO3

source: opens in a new window
ar: تُفتح في نافذة جديدة
it: si apre in una nuova finestra

# no_modules_registered
source: No modules have been registered. Please contact your system administrator.
ar: لم يتم تسجيل أي وحدة. الرجاء التواصل مع مشرف النظام.
it: Nessun modulo è stato registrato. Si prega di contattare l'amministratore del sistema.

source: Show references
ar: أظهر المراجع
it: Mostra riferimenti

# config.loginLogo
source: Logo: If set, this logo will be used instead of the TYPO3 logo above the login credential fields (e.g. fileadmin/images/login-logo.png or EXT:my_theme/Resources/Public/Images/login-logo.png or //domain.tld/login-logo.png).
ar: الشعار: إذا تم تعيينه، سيتم استخدام هذا الشعار بدلاً من شعار TYPO3 فوق حقول بيانات اعتماد الدخول (على سبيل المثال: fileadmin/images/login-logo.png أو EXT:my_theme/Resources/Public/Images/login-logo.png أو //domain.tld/login-logo.png).
it: Logo: se impostato, questo logo, sarà usato al posto del logo di TYPO3 appena sopra i campi delle credenziali di autenticazione (es. fileadmin/images/login-logo.png o EXT:my_theme/Resources/Public/Images/login-logo.png o //domain.tld/login-logo.png).

# config.loginLogoAlt
source: Logo Alt-Text: If a custom logo is set, this text will be used as the alt attribute of the img tag.
ar: نص الشعار البديل: إذا تم تعيين شعار مُخصص، سيتم استخدام هذا النص كسِمة بديلة لعلامة img.
it: Testo "alt" del logo: se è stato impostato un logo personalizzato, questo testo sarà usato come valore dell'attributo alt del tag img.

# config.loginHighlightColor
source: Highlight Color: If set, this color will be used as highlight color in the login screen.
ar: اللون البارز "الأساسي": إذا تم تعيينه، سيتم استخدام هذا اللون كلون ساطع في شاشة تسجيل الدخول.
it: Colore di Evidenziazione: se impostato, questo colore sarà usato come colore di evidenziazione nella schermata di accesso.

# config.loginBackgroundImage
source: Background Image: If set, this image will be used as background image for the login screen (e.g. fileadmin/images/my-background.jpg or EXT:my_theme/Resources/Public/Images/my-background.jpg or //domain.tld/my-background.png).
ar: صورة الخلفية: إذا تم تعيينها، سيتم استخدام هذه الصورة كصورة خلفية لشاشة تسجيل الدخول (مثال: fileadmin/images/my-background.jpg أو EXT:my_theme/Resources/Public/Images/my-background.jpg أو //domain.tld/my-background.png).
it: Immagine di Sfondo: se impostata, questa immagine, sarà usata come immagine di sfondo per la schermata di autenticazione (es. fileadmin/images/my-background.jpg o EXT:my_theme/Resources/Public/Images/my-background.jpg o //domain.tld/my-background.png).

# config.loginFootnote
source: Footnote: If set, this text will be displayed on the login screen to provide copyright information for the background image (e.g. background image © 2017 by John Doe) or a descriptive text.
ar: ملحُوظة على الهامش: إذا تم تعيينها، سيتم عرض هذا النص على شاشة تسجيل الدخول لتوفير معلومات حول حقوق التأليف والنشر لصورة الخلفية (مثال: حقوق النسخ والنشر لصورة الخلفية © 2021 عبد الحميد) أو حتى نص يصف محتوى الصورة.
it: Nota a piè di pagina: se impostata, il testo verrà visualizzato nella schermata di accesso per fornire le informazioni sul copyright per l'immagine di sfondo (es. immagine di sfondo © 2017 di John Doe) o un testo descrittivo.

# config.backendLogo
source: Logo: If set, this logo will be used instead of the TYPO3 logo in the TYPO3 backend in the left top corner (e.g. fileadmin/images/backend-logo.png or EXT:my_theme/Resources/Public/Images/backend-logo.png).
ar: الشعار: إذا تم تعيينه، سيتم استخدام هذا الشعار بدلاً من شعار TYPO3 في الواجهة الخلفية لـ TYPO3 في الزاوية العلوية اليسرى (e. . fileadmin/images/backend logo.png أو EXT:my_theme/Resources/Public/Images/backend logo.png).
it: Logo: se impostato, questo logo verrà utilizzato al posto del logo TYPO3 nel backend TYPO3 nell'angolo superiore sinistro (es. fileadmin/images/backend-logo.png o EXT:my_theme/Resources/Public/Images/backend-logo.png).

# config.backendFavicon
source: Favicon: If set, this favicon will be used instead of the TYPO3 logo (e.g. EXT:my_theme/Resources/Public/Images/favicon.ico).
ar: الصورة المُصغّرة "Favicon": إذا تم تعيينها، سيتم استخدام هذه الصورة المُصغرة بدلاً من شعار TYPO3 (مثل EXT:my_theme/Resources/Public/Images/favicon.ico).
it: Favicon: se impostata, questa favicon verrà usata al posto del logo TYPO3 (es. EXT:my_theme/Resources/Public/Images/favicon.ico).

# foldertreeview.noFolders.title
source: No folders available
ar: لا توجد مجلدات متاحة
it: Nessuna cartella disponibile

# foldertreeview.noFolders.message
source: You do not have access to any folder. Please ask your administrator to fix access permissions for your account.
ar: ليس لديك حق الوصول إلى أي مجلد. الرجاء الطلب من المسؤول الخاص بك تعديل أُذونات الوصول الخاصة بحسابك.
it: Non hai accesso a nessuna cartella. Chiedi all'amministratore di correggere i permessi di accesso per il tuo account.

# login.header
source: Login
ar: تسجيل الدخول
it: Accesso

# login.region.footnote
source: Footnote
ar: تذييل
it: Nota a piè di pagina

# login.link
source: Login with username and password
ar: تسجيل الدخول باستخدام اسم المستخدم وكلمة المرور
it: Accedi con nome utente e password

# login.username
source: Username
ar: اسم المستخدم
it: Nome utente

# login.togglePassword
source: Toggle password visibility
ar: تبديل ظهور كلمة المرور
it: Mostra/Nascondi password

# login.password_forget
source: Forgot your password?
ar: هل نسيت كلمة المرور؟
it: Hai dimenticato la tua password?

# login.error.capslock
source: Attention: Caps lock enabled!
ar: تنبيه: قفل الحد الأقصى مفعل!
it: Attenzione: Blocco maiuscole attivo!

# login.error.capslockStatus
source: Caps lock enabled
ar: تم تمكين Caps lock
it: Blocco maiuscole abilitato

# login.news.header
source: System News
ar: أخبار النظام
it: News di Sistema

# login.news.date
source: Date
ar: التاريخ
it: Data

# login.news.previous
source: Previous
ar: السّابق
it: Precedente

# login.news.next
source: Next
ar: التّالي
it: Successivo

# login.navigation.loginProvider
source: Login Provider
ar: مزوّد تشجيل الدخول
it: Provider di Autenticazione

# login.navigation.typo3
source: Further information about TYPO3
ar: معلومات إضافية عن TYPO3
it: Ulteriori informazioni su TYPO3

# login.error.message
source: Your login attempt did not succeed
ar: لم تنجح محاولة تسجيل الدخول الخاصة بك
it: Tentativo di accesso non riuscito

# login.error.description
source: Make sure to spell your username and password correctly, including upper/lowercase characters.
ar: تأكد من تهجئة وكتابة اسم المستخدم وكلمة المرور بشكل صحيح، مُراعيّاً بذلك: الأحرف الكبيرة/الصغيرة.
it: Assicurati di scrivere correttamente il tuo nome utente e la tua password, inclusi i caratteri maiuscoli/minuscoli.

# login.error.javascript
source: Please activate JavaScript!
ar: الرجاء تفعيل JavaScript!
it: Si prega di attivare JavaScript!

# login.error.cookies
source: Please activate Cookies!
ar: الرجاء تفعيل ملفات تعريف الارتباط!
it: Si prega di attivare i cookie!

# login.error.referrer
source: TYPO3 relies on HTTP referrers for security reasons in the backend. It seems your browser refused to send this information.
ar: يعتمد TYPO3 على إحالات HTTP لأسباب أمنية في الواجهة الخلفية. يبدو أن المتصفح الخاص بك رفض إرسال هذه المعلومات.
it: TYPO3 utilizza il referrer HTTP per verifiche di sicurezza nel backend. Sembra che il tuo browser abbia rifiutato di inviare queste informazioni.

# login.process
source: Verifying Login Data ...
ar: التحقق من بيانات تسجيل الدخول...
it: Sto verificando i dati di accesso ...

# login.submit
source: Login
ar: تسجيل الدخول
it: Accedi

# login.copyrightLink
source: More about TYPO3
ar: المزيد عن نظام TYPO3
it: Maggiori informazioni su TYPO3

# login.typo3Logo
source: TYPO3 logo
ar: شعار TYPO3
it: Logo TYPO3

# login.donate
source: Donate
ar: تبرّع
it: Fai una donazione

# formEngine.databaseRecordErrorInlineChildChild
source: The record with uid %2$s from table %1$s could not be retrieved from the database. This data inconsistency can occur if a base record has been deleted but the intermediate record from table %3$s with uid %4$s still points to it. To fix this situation, either delete the intermediate record, or recover the deleted record using the recycler module.
ar: تعذّر استرجاع السجل الذي يحتوي على uid %2$s من الجدول %1$s من قاعدة البيانات. يمكن أن يحدث هذا عدم اتساق البيانات، إذا تم حذف السجل الأساسي. ولكن السجل الأوسط من الجدول %3$s مع uid %4$s لا يزال يشير إليه. لإصلاح هذه الحالة، إما احذف السجل الأوسط، أو اعمل استرداد للسجل المحذوف باستخدام وحدة إعادة التدوير "recycler module".
it: Il record con uid %2$s dalla tabella %1$s non può essere recuperato dal database. Questa incongruenza dei dati può verificarsi se un record base è stato cancellato, ma il record intermedio dalla tabella %3$s con uid %4$s punta ancora ad esso. Per correggere questa situazione, elimina il record intermedio o recupera il record cancellato utilizzando il modulo Cestino.

# modulemenu.label
source: Module Menu
ar: قائمة الأدوات
it: Menù del Modulo

# module.noAccess.title
source: No module access
ar: لا يوجد صَلاحِيَة للدخول إلى الوحدة
it: Nessun accesso al modulo

# module.noAccess.message
source: You've been redirected to the "%s" module, because you currently can't access the "%s" module. You either don't have the necessary permissions or access is temporarily not possible, e.g. due to workspace restrictions.
ar: تمت إعادة توجيهك إلى الوحدة "%s"، لأنك لا تستطيع حاليّاً الدخول إلى الوحدة "%s". إما أنك لا تمتلك الأُذُونات اللازمة أو أن صَلاحِيَة الدخول غير ممكنة مُؤقتاً، على سبيل المثال بسبب قيود مساحة العمل.
it: Sei stato reindirizzato al modulo "%s", perché attualmente non puoi accedere al modulo "%s. Non hai i permessi necessari oppure l'accesso non è temporaneamente possibile, ad esempio a causa di restrizioni del workspace.

# clearcache.title
source: Page cache
ar: ذاكرة التخزين المؤقت للصفحة
it: Cache di pagina

# clearcache.message.success
source: Successfully cleared page cache
ar: تم مسح ذاكرة التخزين المؤقت للصفحة بنجاح
it: Cache di pagina cancellata con successo

# clearcache.message.error
source: Page cache could not be cleared
ar: تعذر مسح ذاكرة التخزين المؤقت للصفحة
it: La cache della pagina non può essere cancellata

# error.linkHandlerTitleMissing
source: [title missing]
it: [titolo mancante]

# create_folder.title
source: Create new folder
ar: إنشاء مجلد جديد
it: Crea nuova cartella

# create_folder.placeholder
source: Your new folder name
ar: اسم المجلد الجديد الخاص بك
it: Nome della nuova cartella

# create_folder.submit
source: Create folder
ar: إنشاء مجلد
it: Crea cartella

# row.deletePlaceholder.title
source: The live pendant of this record will be deleted when this workspace record is published.
ar: سيتم حذف القُيُود النشطة لهذا السجل عند نشر سجل مساحة العمل هذه.
it: La versione pendente Live, di questo record, sarà eliminata quando il record di questo workspace verrà pubblicato.

# shortcut.title
source: %s%s on page "%s" [%d]
ar: %s%s على الصفحة "%s" [%d]
it: %s%s alla pagina "%s" [%d]

# liveSearch.databaseRecordProvider.filterLabel
source: Database records
ar: سجلات قاعدة البيانات
it: I record del database

# liveSearch.databaseRecordProvider.typeLabel
source: Database record
ar: سجل قاعدة البيانات
it: Il record del database

# liveSearch.pageRecordProvider.filterLabel
source: Pages
ar: الصفحات
it: Pagine

# liveSearch.pageRecordProvider.typeLabel
source: Page
ar: الصفحة
it: Pagina

# liveSearch.backendModuleProvider.filterLabel
source: Backend modules
ar: وِحدات الواجهة الخلفية
it: Moduli del Backend

# liveSearch.backendModuleProvider.typeLabel
source: Backend module
ar: وُِحدة الواجهة الخلفية
it: Modulo del Backend

# resultItem.backendModuleProvider.openModule
source: Open module
ar: فتح الوُحدة
it: Apri modulo

# moduleMenu.dropdown.label
source: Module action
ar: إجراء الوحدة
it: Azione modulo

# pagelayout.moduleMenu.dropdown.label
source: Display mode
ar: وضع العرض
it: Modalità di visualizzazione

# editdocument.moduleMenu.dropdown.label
source: Record language
ar: لغة السجل
it: Lingua record

# login.password
source: Password
ar: كلمة المرور
