Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_download.xlf
Languages: ar

# downloadRecord
source: Download %d record
ar: تحميل %d سجل

# downloadRecords
source: Download %d records
ar: تحميل %d سجلات

source: Download
ar: تحميل

# downloadRecordSettings
source: Download %s: %d Record
ar: تحميل %s: %d سجل

# downloadRecordsSettings
source: Download %s: %d Records
ar: تحميل %s: %d سجلات

# downloadSettings.generalSettings
source: General settings
ar: الإعدادات العامة

# downloadSettings.columnsToDownload
source: Columns to download
ar: أعمدة للتحميل

# downloadSettings.selectedColumns
source: Selected columns
ar: الأعمدة المُحَددة

# downloadSettings.allColumns
source: All columns
ar: جميع الأعمدة

# downloadSettings.valueFormat
source: Format of values
ar: صيغة القِيَمْ

# downloadSettings.rawValues
source: Raw values
ar: القيم الخام

# downloadSettings.processedValues
source: Processed values
ar: القيم المُعالَجة

# downloadSettings.default
source: Default: %s
ar: الافتراضي: %s

# downloadSettings.filename
source: Filename
ar: اسم الملف

# downloadSettings.format
source: Format
ar: الشكل

# downloadSettings.formatOptions.csv
source: CSV options
ar: خيارات CSV

# downloadSettings.formatOptions.csv.delimiter
source: Delimiter
ar: الفواصل

# downloadSettings.formatOptions.csv.delimiter.comma
source: comma
ar: فاصلة

# downloadSettings.formatOptions.csv.delimiter.semicolon
source: semicolon
ar: فاصلة منقوطة

# downloadSettings.formatOptions.csv.delimiter.pipe
source: pipe
ar: أنبوب

# downloadSettings.formatOptions.csv.delimiter.custom
source: user defined
ar: تم تعريف المستخدم

# downloadSettings.formatOptions.csv.quote
source: Quote character
ar: حرف اقتباس

# downloadSettings.formatOptions.csv.quote.doublequote
source: double quote
ar: اقتباس مزدوج

# downloadSettings.formatOptions.csv.quote.singlequote
source: single qoute
ar: اقتباس مُفرد

# downloadSettings.formatOptions.csv.quote.space
source: space
ar: مسافة

# downloadSettings.formatOptions.csv.quote.custom
source: user defined
ar: تم تعريف المستخدم

# downloadSettings.formatOptions.json
source: JSON options
ar: خيارات JSON

# downloadSettings.formatOptions.json.meta
source: Meta information
ar: المعلومات الوَصفِية

# downloadSettings.formatOptions.json.meta.full
source: Add all relevant information to the download
ar: إضافة جميع المعلومات ذات الصلة إلى التحميل

# downloadSettings.formatOptions.json.meta.prefix
source: Prefix the download with table name and page id
ar: بادئة التحميل مع اسم الجدول ومُعرّف الصفحة

# downloadSettings.formatOptions.json.meta.none
source: No information, only download records
ar: لا توجد معلومات، فقط تحميل السجلات

# downloadSettings.preset
source: Preset
ar: إعداد مُسبق
