Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_view_help.xlf
Languages: ar

source: Details
ar: التفاصيل

source: Syntax
ar: قواعد التركيب

source: See also
ar: انظر أيضا

source: Go back
ar: رجوع

# fullDescription
source: See full description of table
ar: شاهد الوصف الكامل للجدول

# fullDescription_module
source: See full description of module
ar: شاهد الوصف الكامل للوحدة

# goToToc
source: << go to Manual Index
ar: انتقل إلى جدول المحتويات

source: To top
ar: إلى الأعلى

# TOC
source: Table Of Contents
ar: جدول المحتويات

# TOC_core
source: TYPO3 Core Features
ar: خصائص تيبو3 الأساسية

# TOC_modules
source: Backend Modules
ar: وحدات الواجهة الخلفية

# TOC_tables
source: Database Tables
ar: جداول قاعدة البيانات

# TOC_extensions
source: Extensions
ar: الامتدادات

# TOC_glossary
source: Glossary
ar: المعجم

# TOC_other
source: Other
ar: غير ذلك

source: Close
ar: إقفال

# title
source: TYPO3 Inline Help
ar: تعليمات مساعدة تيبو3 الخطية

# manual_title
source: TYPO3 Inline User Manual
ar: دليل مستخدم تيبو3 الخطي

source: Introduction
ar: مقدمة

# description
source: The TYPO3 Inline User Manual is composed from the available help in this TYPO3 Installation (Context Sensitive Help). Here you will find a general description of the TYPO3 Core modules, installation specific Backend Modules and Database Tables that are available based on your login credentials.
ar: يتكون دليل مستخدم تيبو3 الخطي من تعليمات المساعدة المتوافرة في هذا الإصدار من تيبو3 (مساعدة حساسة للسياق). وفي هذا الدليل تجدون وصفا عاما لوحدات تيبو3 الأساسية، ووحدات الواجهة الخلفية الخاصة بهذا الإصدار، وجداول قاعدة البيانات المتوافرة اعتمادا على امتيازات دخولك.

# full_manual
source: Full Manual (in one page)
ar: الدليل الكامل (في صفحة واحدة)

# full_manual_chapters
source: Manual Chapters
ar: فصول الدليل
