Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_reset_password.xlf
Languages: ar, it

# headline
source: Reset Your Password
ar: إعادة تعيين كلمة المرور
it: Ripristina la Tua Password

# instructions.email
source: To reset your password, enter the email address stored in the backend user account.
ar: لإعادة تعيين كلمة المرور الخاصة بك، أدخل عنوان البريد الإلكتروني المُخزّن في حساب مستخدم الواجهة الخلفية.
it: Per ripristinare la tua password, inserisci l'indirizzo email memorizzato nel profilo utente del backend.

# instructions.password_requirement
source: To reset your password, ensure that your new password matches the following requirements:
ar: لإعادة تعيين كلمة المرور الخاصة بك، تأكّد من أن كلمة المرور الجديدة تتطابق مع المتطلبات التالية:
it: Per reimpostare la password, assicurati che la tua nuova password rispetti i requisiti seguenti:

# note.other_providers
source: Note: If you're using a centralized user management system such as LDAP, OAuth or Active Directory, you might not receive an email.
ar: ملاحظة: إذا كنت تستخدم "centralized user management system" مثل LDAP أو OAuth أو الدليل المُفعّل، قد لا تتلقى أي بريد إلكتروني.
it: Nota: se stai usando un sistema di gestione degli utenti centralizzato come LDAP, OAuth o Active Directory, potresti non ricevere un'email.

# email_sent.headline
source: Check your inbox!
ar: تحقق من صندوق البريد الوارد الخاص بك!
it: Controlla la tua casella di posta!

# email_sent.message
source: If a backend user with the email address "%s" exists, an email has been sent to this address. Please check your inbox and spam folder.
ar: إذا كان يوجد مستخدم للواجهة الخلفية مع عنوان البريد الإلكتروني هذا "%s"، فسيتم إرسال بريد إلكتروني إلى هذا العنوان. الرجاء التحقق من صندوق البريد الوارد وصندوق البريد العشوائي.
it: Se esiste un utente di backend con l'indirizzo email "%s", un'email è stata inviata a questo indirizzo. Controlla la cartella posta in arrivo e la cartella spam.

# reset_success.headline
source: You've successfully reset your password!
ar: لقد قمت بإعادة تعيين كلمة المرور بنجاح!
it: Hai ripristinato correttamente la tua password!

# reset_success.message
source: With your new credentials you can now log in to the <a href="%s">TYPO3 backend</a>.
ar: باستخدام بيانات اعتمادك الجديدة ، يمكنك الآن تسجيل الدخول إلى <a href="٪s"> الواجهة الخلفية </a>.
it: Con le tue nuove credenziali puoi ora accedere al <a href="%s">backend di TYPO3</a>.

# input.email
source: Enter your email address
ar: أدخل عنوان البريد الإلكتروني الخاص بك
it: Inserisci il tuo indirizzo email

# input.password
source: Enter your new password
ar: أدخل كلمة المرور الجديدة
it: Inserisci la tua nuova password

# input.passwordrepeat
source: Enter your new password again
ar: أدخل كلمة المرور الجديدة مرة أخرى
it: Inserisci di nuovo la tua nuova password

# email_sent.initiate
source: Get Reset Link
ar: احصل على رابط إعادة التعيين
it: Ripristina Password

# button.reset
source: Reset Your Password Now
ar: أعد تعيين كلمة المرور الآن
it: Ripristina Ora la Tua Password

# button.restart
source: Start over
ar: البدء من جديد
it: Ricomincia

# button.back_to_login
source: Go back to login page
ar: العودة إلى صفحة تسجيل الدخول
it: Torna al login

# error.invalid_email
source: The entered email address is invalid. Please try again.
ar: عنوان البريد الإلكتروني الذي تم إدخاله غير صحيح. الرجاء المحاولة مرة أُخرى.
it: L'indirizzo email inserito non è valido. Sei pregato di riprovare.

# error.token_expired
source: The password reset link is invalid or has expired.
ar: رابط إعادة تعيين كلمة المرور غير صالح أو انتهت صلاحيته.
it: Il collegamento di ripristino della password non è valido o è scaduto.

# error.password
source: The password you entered is invalid or the passwords do not match. Please try again.
ar: كلمة المرور التي أدخلتها غير صحيحة أو كلمات المرور غير مُتطابقة. الرجاء المحاولة مرة أخرى.
it: La password che hai inserito non è valida o non corrisponde. Sei pregato di riprovare.
