Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_mfa.xlf
Languages: ar, it

# overview.title
source: Multi-factor Authentication Overview
ar: نظرة عامة على المصادقة مُتعددة العوامل
it: Panoramica sull'Autenticazione Multi-Fattore (MFA)

# overview.badge.active
source: Active
ar: نشط
it: Attivo

# overview.badge.locked
source: Locked
ar: مُقفل
it: Bloccato

# overview.defaultProvider
source: Default provider
ar: المُزوّد الافتراضي
it: Provider predefinito

# overview.unlockLinkTitle
source: Unlock %s
ar: غير مُقفل %s
it: Sblocca %s

# overview.unlockLinkLabel
source: Unlock
ar: غير مُقفل
it: Sblocca

# overview.editLinkTitle
source: Edit %s
ar: تعديل %s
it: Modifica %s

# overview.editLinkLabel
source: Edit / Change
ar: تعديل / تغيير
it: Modifica / Cambia

# overview.deactivateLinkTitle
source: Deactivate %s
ar: غير مُفعّلة %s
it: Disattiva %s

# overview.deactivateLinkLabel
source: Deactivate
ar: غير مُفعّلة
it: Disattiva

# overview.setupLinkTitle
source: Setup %s
ar: الإعداد %s
it: Imposta %s

# overview.setupLinkLabel
source: Setup
ar: الإعداد
it: Imposta

# overview.setupRequired.title
source: Multi-factor authentication required
ar: المُصادقة مُتعددة العوامل مطلوبة
it: Autenticazione multi-fattore richiesta

# overview.setupRequired.message
source: Your installation requires MFA. Therefore please setup one of the following providers to be able to continue to use the backend.
ar: <unk> <unk> <unk> يتطلب التثبيت الخاص بك MFA. لذلك يرجى إعداد أحد المزودين التاليين لتكون <unk> <unk> <unk> <unk> <unk> <unk> قادراً على الاستمرار في استخدام الواجهة الخلفية. <unk> <unk> <unk> <unk>
it: La tua installazione richiede l'autenticazione multi-fattore. Configura uno dei seguenti provider per essere grado di continuare a utilizzare il backend.

# overview.noProviders.title
source: No multi-factor authentication providers
ar: المصادقة المتعددة العوامل غير مُجهّزة أو مُتوفرة
it: Nessun provider di autenticazione multi-fattore

# overview.noProviders.message
source: There are currently no multi-factor authentication providers available.
ar: لا يوجد حالياً مُزوديّ مصادقة متعددي العوامل.
it: Al momento non ci sono provider di autenticazione multi-fattore disponibili.

# overview.noProviders.errorMessage
source: You are required to setup MFA but there are no providers to activate available. You should contact your administrator to solve this.
ar: <unk> <unk> <unk> <unk> أنت مُطالب بإعداد MFA ولكن مُزوديّ الخدمة غير مُتاحين الآن. لذلك يجب عليك الاتصال بـ <unk> <unk> <unk> <unk> المسؤول الخاص بك لحل هذه المشكلة. <unk> <unk> <unk> <unk>
it: Devi impostare l'autenticazione multi-fattore, ma non ci sono provider disponibili. Dovresti contattare il tuo amministratore per risolvere il problema.

# providerNotFound
source: Selected MFA provider was not found!
ar: لم يتم العثور على مُزوّد MFA المُحدد!
it: Il provider MFA selezionato non è stato trovato!

# providerNotActive
source: Selected MFA provider has to be active to perform this action!
ar: يجب أن يكون مُزوّد MFA المُحدد نشطاً لتنفيذ هذا الإجراء!
it: Il provider MFA selezionato deve essere attivo per eseguire questa azione!

# providerActive
source: Selected MFA provider has to be inactive to perform this action!
ar: يجب أن يكون مُزوّد MFA المُحدد غير نَشط لتنفيذ هذا الإجراء!
it: Il provider MFA selezionato deve essere inattivo per eseguire questa azione!

# providerNotFound
source: Selected MFA provider has to be unlocked to perform this action!
ar: يجب أن يكون مُزوّد MFA المحدد غير مُقفل لتنفيذ هذا الإجراء!
it: Il provider MFA selezionato deve essere sbloccato per eseguire questa azione!

source: Setup instructions
ar: تعليمات الإعدادات
it: Istruzioni di configurazione

# setup.instructions.close
source: Close setup instructions
ar: إغلاق تعليمات الإعدادات
it: Chiudi le istruzioni di configurazione

# setup.title
source: Set up %s
ar: الإعداد %s
it: Imposta %s

# edit.title
source: Edit %s
ar: تعديل %s
it: Modifica %s

# edit.defaultProvider
source: Default provider
ar: المُزوّد الافتراضي
it: Provider predefinito

# edit.defaultProvider.description
source: Select this as your default provider for login into the TYPO3 backend.
ar: حدد هذا كمُزوّد افتراضي لتسجيل الدخول إلى الواجهة الخلفية لـ TYPO3.
it: Seleziona questo come tuo provider predefinito per accedere al backend di TYPO3.

# edit.defaultProvider.inputLabel
source: Use as default provider
ar: استخدام كمُزوّد افتراضي
it: Usa come provider predefinito

# edit.deactivateProvider
source: Deactivate provider
ar: إلغاء تنشيط المُزوّد
it: Disattiva provider

# edit.deactivateProvider.description
source: If you don't want to use this provider anymore, you can deactivate it here.
ar: إذا كنت لا تريد استخدام هذا المُزوّد بعد الآن، يمكنك إلغاء تنشيطه هنا.
it: Se non vuoi più usare questo provider, puoi disattivarlo qui.

# edit.deactivateProvider.linkTitle
source: Deactivate %s
ar: تعطيل %s
it: Disattiva %s

# edit.deactivateProvider.linkText
source: Deactivate this provider
ar: تعطيل المُزوّد
it: Disattiva questo provider

# activate.failure
source: Could not activate MFA provider %s. Please try again.
ar: تعذر تنشيط مُزوّد MFA %s. الرجاء المحاولة مرة أخرى.
it: Attivazione del provider MFA %s non riuscita. Riprova.

# activate.success
source: Successfully activated MFA provider %s.
ar: تم تفعيل مُزوّد MFA بنجاح %s.
it: Provider MFA %s attivato con successo.

# deactivate.failure
source: Could not deactivate MFA provider %s. Please try again.
ar: تعذر إلغاء تنشيط مُزوّد MFA %s. الرجاء المحاولة مرة أخرى.
it: Disattivazione del provider MFA %s non riuscita. Riprova.

# deactivate.success
source: Successfully deactivated MFA provider %s.
ar: تم تعطيل مُزوّد MFA بنجاح %s.
it: Provider MFA %s disattivato con successo.

# unlock.failure
source: Could not unlock MFA provider %s. Please try again.
ar: تعذر إلغاء قفل مُزوّد MFA %s. الرجاء المحاولة مرة أخرى.
it: Sblocco del provider MFA %s non riuscito. Riprova.

# unlock.success
source: Successfully unlocked MFA provider %s.
ar: تم إلغاء قفل مُزوّد MFA بنجاح %s.
it: Provider MFA %s sbloccato con successo.

# save.failure
source: Could not update MFA provider %s. Please try again.
ar: تعذر تحديث مُزوّد MFA %s. الرجاء المحاولة مرة أخرى.
it: Aggiornamento del provider MFA %s non riuscito. Riprova.

# save.success
source: Successfully updated MFA provider %s.
ar: تم تحديث مُزوّد MFA بنجاح %s.
it: Provider MFA %s aggiornato con successo.

# auth.authError
source: Authentication was not successful.
ar: المصادقة غير ناجحة.
it: Autenticazione non riuscita.

# auth.submit
source: Verify
ar: التحقق
it: Verifica

# auth.cancel
source: Go back
ar: رجوع
it: Torna indietro

# auth.locked
source: This provider is temporarily locked!
ar: هذا المُزوّد مقفل بشكل مُؤقّت!
it: Questo provider è temporaneamente bloccato!

# auth.alternativeProviders
source: Alternative providers
ar: المُزودون البُدلاء
it: Provider alternativi

# auth.alternativeProviders.use
source: Use %s
ar: استخدم %s
it: Usa %s

# standalone.setupProvider
source: Set up %s
ar: إعداد %s
it: Imposta %s

# standalone.selection.title
source: Set up MFA
ar: إعداد MFA
it: Imposta MFA

# standalone.selection.message
source: %s requires you setting up MFA to secure your account. Please select one of the available providers below.
ar: <unk> <unk> <unk> %s يتطلب منك إعداد MFA لتأمين حسابك. الرجاء اختيار واحد من <unk> <unk> <unk> <unk> <unk> <unk> متوفرة أدناه. <unk> <unk> <unk> <unk>
it: %s richiede di impostare l'MFA per proteggere il tuo account. Seleziona uno dei provider disponibili qui sotto.

# standalone.selection.noAvailableProviders
source: You are required to set up MFA. However, there are no MFA providers available for you to use. This might be a misconfiguration. Please get in touch with your administrator to find a solution.
ar: <unk> <unk> <unk> <unk> أنت مطالبة بإعداد MFA. ومع ذلك، لا يوجد موفري MFA متاحين لك للاستخدام. <unk> <unk> <unk> <unk> هذا قد يكون خطأ في التكوين. يرجى الاتصال بالمسؤول الخاص بك لإيجاد حل لذلك. <unk> <unk> <unk> <unk>
it: È richiesta l'impostazione di un MFA. Comunque, per te, non ci sono provider MFA disponibili. Questo potrebbe essere un errore di configurazione. Si prega di contattare l'amministratore per trovare una soluzione.

# standalone.selection.goBack
source: Go back
ar: رجوع
it: Indietro

# standalone.setup
source: Setup
ar: الإعداد
it: Impostazione

# setup.standalone.cancel
source: Cancel
ar: إلغاء
it: Annulla

# activate.success
source: MFA setup successful
ar: تم إعداد MFA بنجاح
it: Impostazione MFA riuscita

# activate.success
source: You have successfully activated MFA provider %s. This provider was also automatically set as your default provider. You can change this at any time in your user settings.
ar: <unk> <unk> <unk> <unk> ، لقد قمت بتفعيل موفر MFA %sبنجاح. تم تعيين هذا المزود تلقائياً كموفر افتراضي <unk> <unk> <unk> <unk> . يمكنك تغيير هذا في أي وقت في إعدادات المستخدم الخاصة بك. <unk> <unk> <unk>
it: Hai attivato con successo il provider MFA %s. Questo provider è stato impostato automaticamente anche come provider predefinito. È possibile modificarlo in qualsiasi momento nelle impostazioni utente.

# ajax.success
source: Success
ar: نجاح
it: Completato

# ajax.error
source: An error occurred
ar: حدث خطأ ما!
it: Si è verificato un errore

# ajax.invalidRequest
source: Invalid request could not be processed
ar: تعذر معالجة الطلب الغير صالح
it: Richiesta non valida: non può essere eseguita

# ajax.insufficientPermissions
source: Your are not allowed to perform this action
ar: غير مسموح لك بعمل هذا الإجراء
it: Non hai i permessi per eseguire questa azione

# ajax.deactivate.providersNotDeactivated
source: No provider has been deactivated
ar: لم يتم تعطيل أي مُزوّد
it: Nessun provider è stato disattivato

# ajax.deactivate.providersDeactivated
source: Successfully deactivated all active providers for user %s
ar: تم تعطيل جميع المُزودين النشطين للمستخدم %s بنجاح
it: Disattivati con successo tutti i provider attivi per l'utente %s

# ajax.deactivate.providerNotFound
source: Provider %s could not be found
ar: تعذر العثور على المُزوّد %s
it: Non è stato possibile trovare il provider %s

# ajax.deactivate.providerNotDeactivated
source: Could not deactivate provider %s
ar: تعذر تعطيل المزُوّد %s
it: Disattivazione del provider %s non riuscita

# ajax.deactivate.providerDeactivated
source: Successfully deactivated provider %s for user %s
ar: تم تعطيل المُزوّد %s الخاص بالمستخدم بنجاح %s
it: Provider %s disattivato con successo per l'utente %s
