Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_pagetsconfig.xlf
Languages: it

# module.pagetsconfig.title
source: Page TSconfig
it: TSconfig di Pagina

# module.pagetsconfig.description
source: The page TSconfig module lets you manage configuration overrides for editors and option display throughout the Backend.
it: Il modulo del TSconfig di pagina consente di gestire le sovrascritture di configurazione per gli utenti editori e, inoltre, la visualizzazione delle opzioni in tutto il Backend.

# module.pagetsconfig.shortDescription
source: Page TSconfig tools
it: Strumenti per TSconfig di pagina

# module.pagetsconfig.noAccess
source: Access to this module denied.
it: Accesso negato a questo modulo.

# module.pagetsconfig_pages
source: Pages containing page TSconfig
it: Pagine contenenti TSconfig di pagina

# module.pagetsconfig_pages.headline
source: Pages containing page TSconfig
it: Pagine contenenti TSconfig di pagina

# module.pagetsconfig_pages.description
source: Global overview of all pages in the database containing page TSconfig.
it: Panoramica globale di tutte le pagine nel database contenenti TSconfig di pagina.

# module.pagetsconfig_pages.noRecords
source: There are no pages containing page TSconfig settings in the page configuration.
it: Non ci sono pagine contenenti TSconfig di pagina nella configurazione di pagina.

# module.pagetsconfig_pages.pagetitle
source: Page title
it: Titolo della pagina

# module.pagetsconfig_pages.written_tsconfig_lines
source: Number of lines of code in field "TSconfig"
it: Numero di righe di codice nel campo "TSconfig"

# module.pagetsconfig_active
source: Active page TSconfig
it: Pagine con TSconfig attivo

# module.pagetsconfig_active.headline
source: Active page TSconfig of page "%s"
it: Pagine con TSconfig attivo della pagina "%s"

# module.pagetsconfig_active.description
source: Overview of the current page TSconfig of the system. A targeted search for values and names is possible. The list of results can also be filtered according to conditions.
it: Panoramica del TSconfig della pagina corrente, su tutto i sistema. È possibile una ricerca mirata di valori e nomi. L'elenco dei risultati può anche essere filtrato in base a condizioni.

# module.pagetsconfig_active.displayConstantSubstitutions
source: Substitute constants in page TSconfig
it: Sostituisce costanti nel TSconfig di pagina

# module.pagetsconfig_active.displayComments
source: Display comments
it: Visualizza commenti

# module.pagetsconfig_active.sortAlphabetically
source: Sort keys alphabetically
it: Ordina alfabeticamente

# module.pagetsconfig_active.panel.header.conditions
source: Conditions
it: Condizioni

# module.pagetsconfig_active.panel.header.numberOfSearchMatches
source: %s search match(es)
it: %s di corrispondenze nella ricerca

# module.pagetsconfig_active.panel.info.conditionActiveCount.multiple
source: %s active conditions
it: %s di condizioni attive

# module.pagetsconfig_active.panel.info.conditionActiveCount.single
source: %s active condition
it: %s di condizioni attive

# module.pagetsconfig_active.panel.info.conditionWithConstant
source: Site settings usage: [%s]
it: Utilizzo delle impostazioni del sito: [%s]

# module.pagetsconfig_active.panel.header.configuration
source: Configuration
it: Configurazione

# module.pagetsconfig_active.siteSettings
source: Constants from site settings
it: Costanti dalle impostazioni del sito

# module.pagetsconfig_active.activePageTsConfig
source: Page TSconfig
it: TSconfig di Pagina

# module.pagetsconfig_active.noPageTSconfigAvailable
source: No suitable page TSconfig available.
it: Nessun TSconfig di pagina adeguato è disponibile.

# module.pagetsconfig_active.tree.valueWithConstant
source: Constant usage: [%s]
it: Utilizzo costanti: [%s]

# module.pagetsconfig_includes
source: Included page TSconfig
it: TSconfig di pagina inclusi

# module.pagetsconfig_includes.headline
source: Included page TSconfig of page "%s"
it: TSconfig di pagina inclusi nella pagina "%s"

# module.pagetsconfig_includes.description
source: Overview of the included TypoScript and include order for the current page.
it: Panoramica di TypoScript incluso e relativo ordine l'ordine per la pagina corrente.

# module.pagetsconfig_includes.siteSettings
source: Constants from site settings
it: Costanti dalle impostazioni del sito

# module.pagetsconfig_includes.pagetsconfig
source: Page TSconfig
it: TSconfig di Pagina

# module.pagetsconfig_includes.panel.header.configuration
source: Configuration
it: Configurazione

# module.pagetsconfig_includes.panel.header.syntaxErrors
source: Syntax scanner warnings
it: Avvisi dello scanner di sintassi

# module.pagetsconfig_includes.panel.header.conditions
source: Conditions
it: Condizioni

# module.pagetsconfig_includes.panel.info.syntaxErrorCount.single
source: %s syntax warning
it: %s avviso di sintassi

# module.pagetsconfig_includes.panel.info.syntaxErrorCount.multiple
source: %s syntax warnings
it: %s avvisi sintassi

# module.pagetsconfig_includes.panel.info.conditionActiveCount.multiple
source: %s active conditions
it: %s condizioni attive

# module.pagetsconfig_includes.panel.info.conditionActiveCount.single
source: %s active condition
it: %s condizione attiva

# module.pagetsconfig_includes.panel.info.conditionWithConstant
source: Constant usage: [%s]
it: Utilizzo costanti: [%s]

# module.pagetsconfig_includes.syntaxError.sourceCode
source: Show affected code snippet
it: Mostra il frammento di codice interessato

# module.pagetsconfig_includes.syntaxError.type.line.invalid
source: Invalid line in "%1$s", line number "%2$s"
it: Riga non valida in "%1$s", numero di riga "%2$s"

# module.pagetsconfig_includes.syntaxError.type.brace.excess
source: Brace in excess in "%1$s", line number "%2$s"
it: Parentesi graffa in eccesso in "%1$s", numero di riga "%2$s"

# module.pagetsconfig_includes.syntaxError.type.brace.missing
source: Brace missing in "%1$s", line number "%2$s"
it: Parentesi graffa mancante in "%1$s", numero di riga "%2$s"

# module.pagetsconfig_includes.syntaxError.type.import.empty
source: Import does not find a file in "%1$s", line number "%2$s"
it: L'importazione non trova un file in "%1$s", numero di riga "%2$s"

# module.pagetsconfig_includes.tree.child.type.Segment
source: Code segment
it: Segmento di codice

# module.pagetsconfig_includes.tree.child.type.AtImport
source: Included via "@import"
it: Incluso tramite "@import"

# module.pagetsconfig_includes.tree.child.type.Condition
source: Condition (then)
it: Condizione (then)

# module.pagetsconfig_includes.tree.child.type.ConditionElse
source: Condition (else)
it: Condizione (else)

# module.pagetsconfig_includes.tree.child.type.ConditionStop
source: Condition (end)
it: Condizione (end)

# module.pagetsconfig_includes.tree.child.type.ConditionIncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT" (with condition)
it: Incluso tramite "INCLUDE_TYPOSCRIPT" (con condizione)

# module.pagetsconfig_includes.tree.child.type.IncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT"
it: Incluso tramite "INCLUDE_TYPOSCRIPT"

# module.pagetsconfig_includes.tree.child.conditionVerdict.matched
source: Matched
it: Corrispondente

# module.pagetsconfig_includes.tree.child.conditionVerdict.notMatched
source: Not matched
it: Non corrispondente

# module.pagetsconfig_includes.tree.child.btn.sourceCode
source: Show code
it: Mostra codice

# module.pagetsconfig_includes.tree.child.btn.sourceCodeWithResolvedIncludes
source: Show code including possible includes/imports
it: Mostra codice comprensivo di possibili inclusioni/importazioni
