Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.locallang_show_rechis.xlf
Languages: ar, fr, it

# title
source: History/Undo
ar: التاريخ/التراجع
fr: Historique / Annuler
it: Cronologia/Annulla

# title
source: of
ar: لِـ
fr: de
it: di

source: Time
ar: الوقت
fr: Date et heure
it: Ora

source: User
ar: المستخدم
fr: Utilisateur
it: Utente

source: Workspace
ar: مساحة العمل
fr: Espace de travail

# column.action
source: Action
ar: الإجراء
it: Azione

# column.recordTitle
source: Title
ar: العنوان
fr: Titre
it: Titolo

source: Differences
ar: الإختلافات
fr: Différences
it: Differenza

# changes
source: Changelog
ar: سجل التغييرات
it: Log delle modifiche

source: Return
ar: عودة
fr: Retourner
it: Indietro

# returnLink
source: Click here to go back
ar: انقر هنا للرجوع
fr: Cliquez ici pour retourner en arrière
it: Clicca qui per tornare indietro

# revertAll
source: Rollback all changes shown
ar: التراجع عن جميع التغييرات المَعرُوضة
fr: Restaurer tout les changements affichés
it: Ripristina tutte le modifiche visualizzate

# revertRecord
source: Rollback single record
ar: التراجع عن سجل واحد
fr: Restaurer l'élément
it: Ripristina singolo record

# revertField
source: Rollback single field
ar: التراجع عن حقل واحد
fr: Restaurer ce champ
it: Ripristina singolo campo

# userNotFound
source: [Not Found]
ar: [غير موجود]
fr: [Non trouvé]
it: [Non Trovato]

# externalChange
source: Intermediate external change!
ar: مُتوسط التغييرات الخارجية!
fr: Changement intermediaire externe!
it: Cambiamento esterno!

# viaUser
source: via
ar: عبر

# sumUpChanges
source: Rollback all changes to this state (preview)
ar: التراجع عن جميع التغييرات التي طرأت على هذه الحالة (معاينة)
fr: Annuler toutes les modifications à cet état (aperçu)
it: Ripristina tutte le modifiche a questo stato (anteprima)

# markState
source: mark this change
ar: قم بتعليم هذا التغيير
fr: Marquer cette modification
it: contrassegna questa modifica

# unmarkState
source: unMark this change
ar: قم بإلغاء تعليم من هذا التغيير
fr: Démarquer cette modification
it: togli il contrassegno a questa modifica

# elementHistory
source: You are currently seeing the history for an element
ar: أنت ترى حاليّاً سجل العنصر
fr: Vous regardez actuellement l'historique d'un élément
it: Stai vedendo la cronologia di un elemento

# elementHistory_link
source: Show the full page history
ar: إظهار سجل الصفحة كاملاً
fr: Afficher l'historique complet de la page
it: Mostra la cronologia completa della pagina

# linkRecordHistory
source: Limit history to this record
ar: تحديد التاريخ فقط لهذا السجل
fr: Limiter l'historique de cet enregistrement
it: Limita la cronologia a questo record

# differenceMsg
source: In the Difference column you can see the changes at every modification of records. New changes are displayed in green colored text and the red colored text are the old values which were removed.
ar: في عمود الاختلاف يمكنك رؤية التغييرات في كل تعديل للسجلات. يتم عرض التغييرات الجديدة في النص الأخضر اللون و النص الأحمر الملون هي القيم القديمة التي تمت إزالتها.
fr: Dans la colonne "Différences" vous pouvez voir les changements à chaque modification des enregistrements. Les nouvelles valeurs sont affichées en texte vert et les anciennes valeurs qui ont été supprimées sont affichées en texte rouge.
it: Nella colonna "Differenza" puoi vedere le modifiche apportate ad ogni record. Il nuovo valore è visualizzato in colore verde, mentre quello in rosso corrisponde al valore precedente.

# fullView
source: Return to full view
ar: العودة إلى العرض الكامل
fr: Retour à la vue complète
it: Ritorna alla lista completa

# historyRow.actiontype.1
source: created
ar: تم الإنشاء
fr: créé(e)
it: creato

# historyRow.actiontype.2
source: modified
ar: مُصَحَّح
fr: modifié
it: modificato

# historyRow.actiontype.3
source: moved
ar: مَنقُول
fr: déplacé
it: spostato

# historyRow.actiontype.4
source: deleted
ar: مَحذُوف
fr: supprimé
it: eliminato

# historyRow.actiontype.5
source: undeleted
ar: غير محذوف
fr: restauré
it: ripristinato

# historyRow.actiontype.6
source: stage changed
ar: تم تغيير المرحلة
fr: étape modifiée
it: fase modificata

# rollback.plannedAction.insert
source: The record has been deleted and will be restored again with the rollback.
ar: تم حذف السجل وسيتم استعادته مرة أخرى مع العودة إلى الحالة السابقة.
fr: L'enregistrement a été supprimé et sera restauré à nouveau avec l'annulation.
it: Il record è stato eliminato e sarà nuovamente ripristinato.

# rollback.plannedAction.delete
source: The record will be deleted with the rollback.
ar: سيتم حذف السجل مع عملية الرجوع.
fr: L'enregistrement sera supprimé avec l'annulation.
it: Il record sarà eliminato con il ripristino.

source: undelete
ar: تراجع عن الحذف
fr: restaurer
it: ripristina

# mergedDifferences
source: Preview for rollback
ar: معاينة التراجع
fr: Aperçu pour l'annulation
it: Anteprima di ripristino

# mergedDifferences.description
source: It is possible to rollback either individual fields or entire elements. Alternatively, all displayed changes can be rolled back.
ar: من الممكن التراجع عن حقول فردية أو عناصر كاملة. إضافةً إلى ذلك، يمكن التراجع عن جميع التغييرات المعروضة.
fr: Il est possible d'annuler soit les champs individuels, soit les éléments entiers. Autrement, toutes les modifications affichées peuvent être annulées.
it: È possibile il ripristino di singoli campi o interi elementi. In alternativa, tutte le modifiche visualizzate possono essere annullate.

source: Settings
ar: الإعدادات
fr: Option
it: Impostazioni

# maxSteps
source: Show entries
ar: إظهار المُدخلات
fr: Afficher les entrées
it: Visualizza voci

# maxSteps_all
source: ALL
ar: الكل
fr: TOUS
it: TUTTO

# maxSteps_marked
source: marked
ar: مُعَلَّم
fr: marquer
it: contrassegnato

# showDiff
source: Show differences
ar: إظهار الاختلافات
fr: Afficher les différences
it: Visualizza differenze

source: Show sub elements
ar: إظهار العناصر الفرعية
fr: Afficher les sous-éléments
it: Visualizza sottoelementi

source: No
ar: لا
fr: Non

source: Yes
ar: نعم
fr: Oui
it: Sì

# noDifferences
source: There are no differences to the current page
ar: لا توجد اختلافات في الصفحة الحالية
fr: Il n'y a aucune différence avec la page actuelle
it: Non ci sono differenze rispetto alla pagina corrente

# editLockIsActive
source: Editing is blocked for non-admins
ar: تم حظر التعديل لغير المُشرفين
fr: L'édition est bloquée pour les non-administrateurs
it: La modifica è bloccata per non-amministratori
