Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.siteconfiguration_fieldinformation.xlf
Languages: ar, it

# site.rootPageId
source: You must create a page with a site root flag.
ar: يجب عليك إنشاء صفحة بعلامة جذر الموقع.
it: Devi creare una pagina con l'opzione "Usa come Pagina Root" attiva.

# site.identifier
source: This name will be used to create the configuration directory. Mind the recommendations for directory names (only a-z,0-9,_,-) and make it unique.
ar: سيتم استخدام هذا الاسم لإنشاء دليل التكوين. ضع في الاعتبار التوصيات الخاصة بأسماء الدليل (أ-z0-9,_,-) واجعلها فريدة.
it: Questo nome sarà utilizzato per creare la cartella di configurazione. E' necessario tenere in considerazione i suggerimenti per i nomi delle cartelle (utilizzare solo i caratteri a-z,0-9,_,-) e il nome deve essere unico.

# site.base
source: Main URL to call the frontend in default language. Can be https://www.example.com/ or just /, if it is just a / you cannot rely on TYPO3 creating full URLs
ar: عنوان URL الرئيسي للوصول إلى الواجهة الأمامية في اللغة الافتراضية. يمكن أن يكون https://www.example. om/ أو فقط /، إذا كان مجرد A / لا يمكنك الإعتماد على TYPO3 لإنشاء عناوين URLs كاملة
it: URL principale per il frontend nella lingua predefinita. Può essere https://www.esempio.com/ o solo /. Nel caso fosse solo /, non potrai avere la certezza che TYPO3 possa creare URL completi

# site.websiteTitle
source: The title of the website is used for the title tag in the frontend
ar: يتم استخدام عنوان الموقع كـ علامة العنوان في الواجهة الأمامية
it: Il titolo del sito web è usato per il tag 'title' nel frontend

# site.baseVariants
source: This allows you to specify variants of the site's base. Can be used, for example, if you have a different domain for your staging environment.
ar: هذا يسمح لك بتحديد مُتغيرات قاعدة الموقع. يمكن استخدامها، على سبيل المثال: إذا كان لديك نطاق مُختلف لبيئة المنصّة الخاصة بك.
it: Questo ti consente di specificare varianti del Punto di Ingresso base del sito. Può essere usato, ad esempio, se hai un dominio differente per l'ambiente di pre-produzione.

# site.dependencies
source: Site sets ship parts of site configuration as composable pieces. Sets deliver Settings, TypoScript, and Page TSConfig for the scope of this site.
ar: يُعيّن الموقع أجزاء من تكوين الموقع كقطع قابلة للتكوين. هذه المجموعات تُقدم الإعدادات، TypoScript، وصفحة TSConfig لنطاق هذا الموقع.
it: I corredi includono parti di configurazione come pezzi componibili. I corredi forniscono configurazioni, TypoScript e TSConfig di Pagina nell'ambito di questo sito.

# site_language.base
source: Use a full qualified domain "https://www.mydomain.fr/" or "/fr/". Use "/" to keep the main URL for the default language. Add language specific suffixes to use those, or configure complete URLs for independent domains.
ar: استخدم نطاق كامل ومؤهل "https://www.mydomain.fr/" أو "/fr/". استخدم "/" للحفاظ على عنوان URL الرئيسي للغة الافتراضية. أضف مُلحقات خاصة بلغة معينة لاستخدام تلك العناوين أو تكوين عناوين URL كاملة لنطاقات مستقلة.
it: Usa un dominio qualificato "https://www.mydomain.fr/" o "/fr/". Usa "/" per mantenere l'URL principale per la lingua predefinita. Aggiungi suffissi specifici per la lingua per usarli o configurare URL completi per domini indipendenti.

# site_language.locale
source: Used for localized date and currency formats. E.g. "de_DE" or "en_US.UTF-8".
ar: تُستخدم لتنسيق التاريخ والعملة. على سبيل المثال: "de_DE" أو "en_US.UTF-8".
it: Utilizzato per i formati data e valuta localizzati. Es. "it_IT" o "en_US.UTF-8".

# site_language.hreflang
source: Optional, used for "hreflang" attributes - if empty, the information is retrieved from the locale
ar: اختياري، يستخدم لِسِمات "hreflang" - إذا كانت فارغة، يتم استرداد المعلومات من الموقع
it: Facoltativi, utilizzati per gli attributi "hreflang" - se non presenti, le informazioni vengono recuperate dal parametro "locale"

# site_language.websiteTitle
source: With this language based Website title, you can override the Website title for this language
ar: باستخدام عنوان موقع الويب المُستند إلى اللغة، يمكنك تجاوز عنوان موقع الويب لهذه اللغة
it: Con questo titolo puoi sovrascrivere il titolo del Sito Web per questa lingua

# site_language.navigationTitle
source: Used within language-related menus
ar: تُستخدم ضمن القوائم المرتبطة باللغة
it: Utilizzato nei menù relativi alla lingua

# site_errorhandling.errorCode
source: Make sure to have at least 0 (not defined otherwise) configured in order to serve helpful error messages to your visitors.
ar: تأكد من تكوين على الأقل 0 (غير مُعرّف) لتقديم رسائل خطأ مفيدة للزائرين.
it: Assicurati di avere impostato almeno 0 (altrimenti non definito) per fornire messaggi di errore utili ai tuoi visitatori.

# site_errorhandling.errorFluidTemplate
source: Path to the fluid template file given by absolute, relative path (from site root) or by referring the template file inside an extension with "EXT:" prefix.
ar: المسار إلى ملف قالب Fluid المُقدم من خلال المسار الحتمي النسبي (من جذر الموقع) أو عن طريق إحالة ملف القالب داخل الإضافات بالبادئة "EXT:".
it: Percorso al file di template Fluid: percorso assoluto, percorso relativo (dalla radice del sito) o con prefisso "EXT:" se stai facendo riferimento a un file template di una estensione.

# site_errorhandling.errorPhpClassFQCN
source: Fully qualified class name to a class that implements the PageErrorHandlerInterface.
ar: اسم مؤهل بالكامل لفئة تقوم بتنفيذ PageErrorHandlerInterface.
it: Nome completo (FQCN) della classe PHP che implementa "PageErrorHandlerInterface".

# site_base_variant.base
source: For example "https://staging.domain.tld" or "http://www.domain.local"
ar: على سبيل المثال: "https://staging.domain.tld" أو "http://www.domain.local"
it: Per esempio "https://staging.domain.tld" o "http://www.domain.local"

# site_base_variant.condition
source: Expression to match this base variant.
ar: تعبير يُطابق هذا المُتغير الأساسي.
it: Espressione per abbinare questa variante di base.
