Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/*.SudoMode.xlf
Languages: ar, it

source: Cancel
ar: إلغاء
it: Annulla

source: Verify
ar: التحقق
it: Verifica

source: Password
ar: كلمة المرور

source: Verify with user password
ar: التحقق باستخدام كلمة مرور المستخدم
it: Verifica con la password utente

source: Verify with Install Tool password
ar: التحقق باستخدام كلمة مرور أداة التثبيت
it: Verifica con la password dell'Install Tool

source: Access granted
ar: تم منح صلاحية الوصول
it: Accesso autorizzato

source: Invalid password
ar: كلمة مُرور غير صالحة
it: Password non valida

# userPasswordMode
source: Use user password instead
ar: استخدم كلمة مرور المستخدم بدلاً من ذلك
it: Usa invece la password utente

# installToolPasswordMode
source: Use Install Tool password instead
ar: استخدم كلمة مرور أداة التثبيت بدلاً من ذلك
it: Usa invece la password dell'Install Tool

source: Verification failed
ar: فشل التحقق
it: Verifica non riuscita

# verificationExpired
source: Confirmation has expired. Please try again.
ar: انتهت صَلاحِيَة التأكيد. الرجاء المحاولة مرة أخرى.
it: La conferma Ã¨ scaduta. Per favore riprova.
