Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/reports/Resources/Private/Language/*.locallang_reports.xlf
Languages: ar

# status_report_title
source: Status Report
ar: تقرير الحالة

# status_report_description
source: Get a status report about your site's operation and any detected problems.
ar: احصل على تقرير حالة عن تشغيل موقعك وأي مشاكل تم اكتشافها.

# status_report_explanation
source: Here you can find a short overview of your site's parameters as well as any problems detected with your installation. It may be useful to copy and paste this information into support requests filed on TYPO3's support mailinglists and project issue trackers.
ar: هنا يمكنك العثور على نَظْرَة عامّة مختصرة على مُعلِمات موقعك بالإضافة إلى أيّة مشاكل تم اكتشافها خلال التثبيت. قد يكون من المفيد نسخ هذه المعلومات ولصقها في طلبات الدعم المُودعة في القوائم البريدية لدعم TYPO3 ومتعقبات مشكلات المشروع.

# status_ok
source: OK
ar: موافق

# status_wrongValue
source: Wrong value detected
ar: تم اكتشاف قيمة خاطئة

# status_info
source: Information
ar: المعلومات

# status_insecure
source: Insecure
ar: غير آمن

# status_disabled
source: Disabled
ar: مُعطّل

# status_enabled
source: Enabled
ar: مُفعَّل

# status_enabledPermanently
source: Enabled permanently
ar: تفعيل دائم

# status_enabledTemporarily
source: Enabled temporarily
ar: تفعيل مؤقت

# status_empty
source: Empty
ar: فارغ

# status_none
source: None
ar: لا شَيْء

# status_connectionFailed
source: Connection Failed
ar: فشل الاتصال

# status_checkFailed
source: Check Failed
ar: فشل التحقق

# status_updateComplete
source: Update Complete
ar: اكتمل التحديث

# status_updateIncomplete
source: Update Incomplete
ar: التحديث غير مُكتمل

# status_problemNotification
source: One or more problems were detected with your TYPO3 installation. Please check the %sstatus report%s for more information.
ar: تم اكتشاف مشكلة واحدة أو أكثر مع تثبيت TYPO3 الخاص بك. الرجاء التحقق من %sتقرير حالة%s لمزيد من المعلومات.

# status_allNotification
source: This report contains all System Status Notifications from your TYPO3 installation. Please check the %sstatus report%s for more information.
ar: يحتوي هذا التقرير على جميع إشعارات حالة النظام من تثبيت TYPO3 الخاص بك. الرجاء التحقق من %sتقرير حالة%s لمزيد من المعلومات.

# status_typo3
source: TYPO3 System
ar: نظام TYPO3

# status_system
source: System
ar: النظام

# status_security
source: Security
ar: الأمان

# status_configuration
source: Configuration
ar: التكوين

# status_referenceIndex
source: Reference Index
ar: فهرس المرجع

# status_fal
source: File Abstraction Layer
ar: طبقة تجريد المِلَفّ

# status_missingFiles
source: Files flagged as missing
ar: تم وضع علامة على الملفات على أنها مفقودة

# status_missingFilesCount
source: %1$s files
ar: ملفات %1$s

# status_missingFilesMessage
source: These files are flagged as missing. Restore the files and run the indexer to reset the missing flag.
ar: تم وضع علامة على هذه الملفات على أنها مفقودة. قم باستعادة الملفات وتشغيل المُفَهرِس لإعادة تعيين العلامة المفقودة.

# status_memcachedConfiguration
source: Memcached Configuration
ar: إعدادات نظام ذاكرة التخزين المؤقت "Memcached"

# status_CreatedFilePermissions
source: Permissions of created files
ar: أُذُونات الملفات التي تم إنشاؤها

# status_CreatedFilePermissions.writable
source: Files created by TYPO3 are configured to be world writable. Depending on your server configuration, this can be a security risk. It is usually better to configure the create mask to not allow writing to files by "others". A sane default is often '0660' for $GLOBALS['TYPO3_CONF_VARS']['SYS']['fileCreateMask']. This can be set in the install tool.
ar: تم تكوين الملفات التي أنشأها TYPO3 بحيث يمكن كتابتها عالميّاً. اعتمادًا على تكوين الخادم الخاص بك، يمكن أن يشكل ذلك خطرًا على الأمان. عادةً ما يكون من الأفضل تكوين القناع لعدم السماح بالكتابة إلى الملفات من قِبل "الآخرين". قيمة افتراضية معقولة هي عادةً '0660' لـ $GLOBALS['TYPO3_CONF_VARS']['SYS']['fileCreateMask']. يمكن تعيين هذا في أداة التثبيت.

# status_CreatedDirectoryPermissions
source: Permissions of created directories
ar: أذونات الدلائل التي تم إنشاؤها

# status_CreatedDirectoryPermissions.writable
source: Directories created by TYPO3 are configured to be world writable. Depending on your server configuration, this can be a security risk. It is usually better to configure the create mask to not allow writing to directories by "others". A sane default is often '2770' for $GLOBALS['TYPO3_CONF_VARS']['SYS']['folderCreateMask']. This can be set in the install tool.
ar: يتم تكوين الدلائل التي تم إنشاؤها بواسطة TYPO3 لتكون قابلة للكتابة عالميّاً. اعتمادًا على تكوين الخادم الخاص بك، يمكن أن يشكل ذلك خطرًا على الأمان. عادةً ما يكون من الأفضل تكوين قناع الإنشاء لعدم السماح بالكتابة في الدلائل من قِبَل "الآخرين". قيمة افتراضية معقولة هي '2770' لـ $GLOBALS['TYPO3_CONF_VARS']['SYS']['folderCreateMask']. يمكن تعيين هذا في أداة التثبيت.

# status_MysqlDatabaseCharacterSet
source: MySQL Database Character Set
ar: مجموعة أحرف قاعدة بيانات MySQL

# status_MysqlDatabaseCharacterSet_CheckFailed
source: Checking database character set failed, got key "%1$s" instead of "character_set_database"
ar: فشل التحقق من مجموعة أحرف قاعدة البيانات، احصل على المفتاح "%1$s" بدلاً من "character_set_database"

# status_MysqlDatabaseCharacterSet_Unsupported
source: Your default database uses character set "%1$s", but only "utf8", "utf8mb3" or "utf8mb4" is supported with TYPO3.
ar: قاعدة البيانات الافتراضية الخاصة بك تستخدم مجموعة الحُروف "%1$s"، ولكن فقط "utf8" أو "utf8mb3" مَدعُوم مع TYPO3.

# status_MysqlDatabaseCharacterSet_Ok
source: Your default database uses utf-8. All good.
ar: قاعدة البيانات الافتراضية الخاصة بك تستخدم utf-8. كل شيء يسير بشكل جيد.

# status_MysqlDatabaseCharacterSet_Info
source: Your default database uses a different charset, but all tables uses utf-8. All good. But consider fixing your database collation and check the table creation settings.
ar: قاعدة البيانات الافتراضية الخاصة بك تستخدم حرف مُختلف، ولكن جميع الجداول تستخدم utf-8. ككل شيء يسير بشكل جيد. لكن فكّر في إصلاح تجميع قاعدة البيانات الخاصة بك والتحقق من إعدادات إنشاء الجدول.

# status_MysqlDatabaseCharacterSet_MixedCollations
source: Your default database is set to create tables with character set "%1$s", but contains tables or columns with different collations. Please fix these tables to avoid "illegal mix of collations" errors.
ar: تم تعيين قاعدة البيانات الافتراضية الخاصة بك لإنشاء جداول مع مجموعة الأحرف "%1$s"، ولكن تحتوي على جداول أو أعمدة مع مقارنات مختلفة. الرجاء إصلاح هذه الجداول لتجنب أخطاء "مزيج غير قانوني من التصادمات".

# status_encryptedConnectionStatus
source: Encrypted backend connection (HTTPS)
ar: اتصال الواجهة الخلفية المُشفّر (HTTPS)

# status_encryptedConnectionStatus_insecure
source: Your backend access is not secured using HTTPS but relies on HTTP which sends all your data (including login passwords) over an insecure connection. All modern web sites should rely on HTTPS and only sites secured differently, for instance some intranet installations may use HTTP only.
ar: إن الوصول إلى الواجهة الخلفية الخاصة بك غير مُؤمن باستخدام بروتوكول HTTPS ولكنه يعتمد على بروتوكول HTTP الذي يُرسل جميع بياناتك (بما في ذلك كلمات مرور تسجيل الدخول) عبر اتصال غير آمن. يجب على جميع المواقع الحديثة الاعتماد على HTTPS فقط، وقد تكون بعض التثبيتات الداخلية مُؤمّنة بشكل مختلف، مثل بعض تثبيتات الشبكة الداخلية، يمكنها استخدام HTTP فقط.

# status_lockSslStatus
source: Backend only accessible through HTTPS
ar: يمكن الوصول إلى الواجهة الخلفية فقط بواسطة HTTPS

# status_lockSslStatus_insecure
source: It is highly recommended to activate the option (<code>$GLOBALS['TYPO3_CONF_VARS']['BE']['lockSSL']</code>).
ar: يُوصى بشدة تفعيل الخِيار (<code>$GLOBALS['TYPO3_CONF_VARS']['BE']['lockSSL']</code>).

# status_trustedHostsPattern
source: Trusted Hosts Pattern
ar: نَمط المُضِيفِين الموثُوق بهم

# status_encryptionKey
source: Encryption Key
ar: مفتاح التشفير

# status_fileDenyPattern
source: File Deny Pattern
ar: نمط رفض الملف

# status_htaccessUploadProtection
source: .htaccess Upload Protection
ar: تحميل حماية .htaccess

# status_exceptionHandler
source: Exception Handler / Error Reporting
ar: معالج الاستثناء / الإبلاغ عن الأخطاء

# status_exportedFiles
source: XML/T3D export files
ar: ملفات التصدير XML/T3D

# status_exceptionHandler_warningMessage
source: Display Errors is set to 1 - errors will be displayed with the DebugExceptionHandler including stack traces.
ar: تم تعيين عرض الأخطاء إلى 1 - سيتم عرض الأخطاء مع DebugExceptionHandler بما في ذلك تتبع الكومة "stack traces".

# status_exceptionHandler_errorMessage
source: Debug Exception Handler enabled in Production Context - will show full error messages including stack traces.
ar: تم تفعيل معالج استثناء التصحيح في سياق الإنتاج - سيعرض رسائل الخطأ الكاملة بما في ذلك تتبع الكومة "stack traces".

# status_exportedFiles_warningMessage
source: The following exported files were found:
ar: تم العثور على الملفات المُصدّرة التالية:

# status_exportedFiles_warningRecommendation
source: It is recommended to delete exported files to avoid possible disclosure of exported data to backend users with lower/different access rights than user(s) who originally created the export(s).
ar: يُوصى بحذف الملفات المُصدّرَة لتجنب إمكانية الكشف عن البيانات لمُستخدِمي الواجهة الخلفية، الذين لهم صَلاحِيَة دخول منخفضة/مختلفة عن المستخدمين الذين أنشأوا التصدير في الأصل.

# status_installTool
source: Install Tool
ar: أداة التثبيت

# status_phpModules
source: PHP Modules
ar: وحدات PHP

# status_phpModulesMissing
source: One or more modules are missing.
ar: وحدة واحدة أو أكثر مفقودة.

# status_phpModulesList
source: The following PHP module(s) is/are missing: %s.
ar: وحدة (وحدات) PHP التالية مفقودة: %s.

# status_phpModulesInfo
source: You need to install and enable these modules to let TYPO3 function correctly.
ar: تحتاج إلى تثبيت وتمكين هذه الوحدات للسماح لوظيفة TYPO3 بالعمل بشكل صحيح.

# status_phpModulesGroup
source: one of: %s
ar: واحد من: %s

# status_phpModulesPresent
source: All required modules are installed.
ar: تم تثبيت جميع الوحدات المطلوبة.

# status_installEnabledTemporarily
source: The Install Tool is temporarily enabled. Delete the file "%s" when you have finished setting up TYPO3. If not used the Install Tool will be disabled automatically in %s minutes.
ar: أداة التثبيت مُفعّلة مؤقتاً. احذف المِلَفّ "%s" عند الانتهاء من إعداد TYPO3. إذا لم يتم استخدام أداة التثبيت سيتم تعطيلها تلقائياً في %s دقيقة.

# status_updateTaskTitle
source: System Status Update
ar: تحديث حالة النظام

# status_updateTaskDescription
source: Runs a system status check and sends notifications if problems have been found.
ar: يُجري فحصًا لحالة النظام ويرسل إشعارات إذا تم العثور على مشاكل.

# status_updateTaskField_notificationEmail
source: Notification Email Address
ar: عنوان البريد الإلكتروني للإشعارات

# status_updateTaskField_notificationEmails
source: Notification Email Addresses (one per line)
ar: عنوان البريد الإلكتروني للإشعارات (واحد لكل سطر)

# status_updateTaskField_notificationEmail_invalid
source: Empty or invalid notification email address.
ar: عنوان البريد الإلكتروني للإشعارات فارغ أو غير صالح.

# status_updateTaskField_notificationEmails_invalid
source: Empty or invalid notification email addresses.
ar: عناوين البريد الإلكتروني للإشعارات فارغة أو غير صالحة.

# status_updateTaskField_notificationAll
source: Always send notification mail (not only on errors or warnings)
ar: إرسال إشعار البريد دائمًا (ليس فقط على الأخطاء أو التحذيرات)

# status_updateTask_email_subject
source: System Status Notification for site %s
ar: إشعار حالة النظام للموقع %s

# status_updateTask_email_site
source: Site
ar: الموقع

# status_updateTask_email_issues
source: Issues
ar: المُشكِلات

# status_xclassUsageFound
source: Your system registers XCLASS
ar: النظام الخاص بك يسجل XCLASS

# status_xclassUsageFound_message
source: XCLASS can overwrite methods or classes of the core or other extensions. This is not necessarily a bad thing, but those XCLASS might break during extension or core upgrades. You should keep an eye on extension compatibility and make sure the intended functionality is still given after updates.
ar: يمكن لـ XCLASS الكتابة فوق طرق أو فئات من النواة أو إضافات أخرى. هذا ليس بالضرورة أمراً سيئًا، لكن تلك XCLASS قد تنهار خلال الترقيات أو التحديثات الأساسية. يجب أن تأخذ بعين الاعتبار على توافق الإضافات وأن تتأكد من استمرار إعطاء الوظيفة المطلوبة بعد التحديثات.

# status_xclassUsageFound_message_detail
source: %2$s registers an XCLASS of %1$s
ar: %2$s يسجل XCLASS من %1$s

# status_imageprocessing
source: Image Processing
ar: مُعالَجة الصورة

# status_imageprocessing_webp
source: WebP support and availability
ar: دعم WebP وتوافره

# status_imageprocessing_disabled
source: Image processing via ImageMagick/GraphicsMagick is disabled
ar: تم تعطيل مُعالجة الصورة عن طريق ImageMagick/GraphicsMagick

# status_imageprocessing_webp_not_configured
source: Support for WebP image generation is not configured in $TYPO3_CONF_VARS[GFX][imagefile_ext]. No WebP image files will be generated.
ar: لم يتم تكوين دعم إنشاء صور WebP في $TYPO3_CONF_VARS[GFX][imagefile_ext]. لن يتم إنشاء ملفات صورة WebP.

# status_imageprocessing_webp_available
source: Support for WebP image generation is not configured in $TYPO3_CONF_VARS[GFX][imagefile_ext], but ImageMagick/GraphicsMagick supports generation of WebP image files.
ar: لم يتم تكوين الدعم لتوليد صور WebP في $TYPO3_CONF_VARS[GFX][imagefile_ext]، ولكن ImageMagick/GraphicsMagick يدعم إنشاء ملفات صورة WebP.

# status_imageprocessing_webp_not_available
source: Support for WebP image generation is configured in $TYPO3_CONF_VARS[GFX][imagefile_ext], but ImageMagick/GraphicsMagick does NOT support generation of WebP image files, update your system environment or disable webp support in TYPO3 Configuration.
ar: تم تكوين دعم إنشاء صور WebP في $TYPO3_CONF_VARS[GFX][imagefile_ext]، لكن ImageMagick/GraphicsMagick لا يدعم إنشاء ملفات صورة WebP أو تحديث بيئة النظام لديك أو تعطيل دعم webp في تكوين TYPO3.

# status_imageprocessing_webp_available_and_configured
source: Support for WebP image generation is configured in $TYPO3_CONF_VARS[GFX][imagefile_ext] and ImageMagick/GraphicsMagick supports generation of WebP image files - all fine!
ar: تم تكوين دعم إنشاء صور WebP في $TYPO3_CONF_VARS[GFX][imagefile_ext]، ويدعم ImageMagick/GraphicsMagick إنشاء ملفات صورة WebP - كل الأمور بخير!
