Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/form/Resources/Private/Language/*.Database.xlf
Languages: ar, it

# formEditor.elements.DatePicker.validators.DateRange.editor.maximum
source: Maximum date
ar: الحد الأقصى للتاريخ
it: Data fine

# formEditor.elements.DatePicker.validators.DateRange.editor.minimum.placeholder
source: A date in format Y-m-d (e.g 2018-03-17)
ar: تاريخ بصيغة Y-m-d (مثل 2018-03-17)
it: Una data nel formato aaaa-mm-gg (es. 2018-03-17)

# formEditor.elements.DatePicker.validators.DateRange.editor.maximum.placeholder
source: A date in format Y-m-d (e.g 2018-03-17)
ar: تاريخ بصيغة Y-m-d (مثل 2018-03-17)
it: Una data nel formato aaaa-mm-gg (es. 2018-03-17)

# formEditor.elements.Password.label
source: Password
ar: كلمة المرور

# formEditor.elements.AdvancedPassword.label
source: Advanced password
ar: كلمة المرور مُتقدِمة
it: Password avanzata

# formEditor.elements.AdvancedPassword.editor.confirmationLabel.label
source: Confirmation label
ar: تسمية التأكيد
it: Etichetta di conferma

# formEditor.element.AdvancedPassword.editor.confirmationLabel.predefinedDefaults
source: Confirmation
ar: التأكيد
it: Conferma

# formEditor.elements.Textarea.label
source: Textarea
ar: حقل نَصّي
it: Area di testo

# formEditor.elements.Checkbox.label
source: Checkbox
ar: مربع الاختيار
it: Opzione

# formEditor.elements.CountrySelect.label
source: Country select
ar: اختيار الدولة
it: Seleziona Paese

# formEditor.elements.MultiCheckbox.label
source: Multi checkbox
ar: مُربع الاختيار المُتعدد
it: Opzione a scelta multipla

# formEditor.elements.MultiSelect.label
source: Multi select
ar: اختيار متعدد
it: Menù a scelta multipla

# formEditor.elements.RadioButton.label
source: Radio button
ar: زر اختيار
it: Pulsante radio

# formEditor.elements.SingleSelect.label
source: Single select
ar: اختيار واحد
it: Selezione singola

# formEditor.elements.DatePicker.label
source: Date picker (jQuery)
ar: مُنتَقي التاريخ (jQuery)
it: Selettore data (jQuery)

# formEditor.elements.DatePicker.editor.dateFormat.label
source: Date format
ar: تنسيق التاريخ
it: Formato data

# formEditor.elements.DatePicker.editor.enableDatePicker.label
source: Enable datepicker (needs jQuery UI)
ar: تفعيل مُنتقِي التاريخ (يحتاج jQuery UI)
it: Abilita selettore data (richiede jQuery UI)

# formEditor.elements.DatePicker.editor.displayTimeSelector.label
source: Display time selector
ar: عرض مُحدّد التاريخ
it: Mostra il selettore dell'ora

# formEditor.elements.DatePicker.editor.validators.label
source: Validators
ar: المُدقّقُون
it: Validazioni

# formEditor.elements.DatePicker.editor.validators.EmptyValue.label
source: Add validator
ar: إضافة مُدقق
it: Aggiungi validazione

# formEditor.elements.DatePicker.editor.validators.DateTime.label
source: Date/time
ar: التاريخ/الوقت
it: Data/ora

# formEditor.elements.DatePicker.validators.DateTime.editor.header.label
source: Date/time
ar: التاريخ/الوقت
it: Data/ora

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي تظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.StaticText.label
source: Static text
ar: نص ثابت
it: Testo statico

# formEditor.elements.StaticText.editor.label.label
source: Header
ar: الترويسة
it: Intestazione

# formEditor.elements.StaticText.editor.staticText.label
source: Text
ar: النص
it: Testo

# formEditor.elements.Hidden.label
source: Hidden
ar: إخفاء
it: Nascosto

# formEditor.elements.Hidden.editor.defaultValue.label
source: Value
ar: القيمة
it: Valore

# formEditor.elements.ContentElement.label
source: Content element
ar: عنصر المحتوى
it: Elemento di contenuto

# formEditor.elements.ContentElement.selectContentElement
source: No content element selected
ar: لم يتم تحديد عنصر المحتوى
it: Nessun elemento di contenuto selezionato

# formEditor.elements.ContentElement.editor.contentElement.label
source: Content element uid
ar: UID عنصر المحتوى
it: Elemento di contenuto (Uid)

# formEditor.elements.ContentElement.editor.contentElement.buttonLabel
source: Page Content
ar: محتوى الصفحة
it: Contenuto di pagina

# formEditor.elements.FileUpload.label
source: File upload
ar: تحميل الملف
it: Carica file

# formEditor.elements.FileUpload.editor.allowedMimeTypes.label
source: Allowed file mime types
ar: السماح بأنواع mime الملفات
it: Tipi mime file consentiti

# formEditor.elements.FileUpload.editor.maximumFileSize.label
source: Your servers' maximum upload file size is {0}. Be aware setting higher values can result in errors when submitting the form. If you need higher values contact your administrator for help.
ar: الحد الأقصى لحجم مِلَفّ التحميل الخاص بك على الخادم هو {0}. كن على علم أن تعيين قيم أعلى قد يؤدي إلى حدوث أخطاء عند إرسال النموذج. إذا كنت بحاجة إلى قيم أعلى فاتصل بالمسؤول الخاص بك للمساعدة.
it: La dimensione massima, impostata sul server, per il caricamento di file è {0}. Attenzione: l'impostazione di valori più elevati può causare errori durante l'invio della form. Se hai bisogno di valori maggiori, contatta l'amministratore per ricevere assistenza.

# formEditor.elements.FileUpload.editor.allowedMimeTypes.doc
source: Documents (doc)
ar: المستندات (doc)
it: Documenti (doc)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.docx
source: Documents (docx)
ar: المستندات (docx)
it: Documenti (docx)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.xls
source: Documents (xls)
ar: المستندات (xls)
it: Documenti (xls)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.xlsx
source: Documents (xlsx)
ar: المستندات (xlsx)
it: Documenti (xlsx)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.pdf
source: Documents (pdf)
ar: المستندات (pdf)
it: Documenti (pdf)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.odt
source: Documents (odt)
ar: المستندات (odt)
it: Documenti (odt)

# formEditor.elements.FileUpload.editor.allowedMimeTypes.ods
source: Documents (ods)
ar: المستندات (ods)
it: Documenti (ods)

# formEditor.elements.ImageUpload.label
source: Image upload
ar: تحميل الصورة
it: Carica immagine

# formEditor.elements.ImageUpload.editor.allowedMimeTypes.label
source: Allowed file mime types
ar: أنواع ملفات mime المسموح بها
it: Tipi mime file consentiti

# formEditor.elements.ImageUpload.editor.allowedMimeTypes.jpg
source: Images (jpg)
ar: الصُوُر (jpg)
it: Immagini (jpg)

# formEditor.elements.ImageUpload.editor.allowedMimeTypes.png
source: Images (png)
ar: الصُوُر (png)
it: Immagini (png)

# formEditor.elements.ImageUpload.editor.allowedMimeTypes.bmp
source: Images (bmp)
ar: الصُوُر (bmp)
it: Immagini (bmp)

# formEditor.elements.CountrySelect
source: Country Select
ar: اختيار الدولة
it: Seleziona Paese

# formEditor.elements.CountrySelect.editor.prioritizedCountries.label
source: Prioritized countries
ar: الدُوُل ذات الأولوية
it: Paesi prioritari

# formEditor.elements.CountrySelect.editor.onlyCountries.label
source: Only countries
ar: فقط الدُوُل
it: Solo paesi

# formEditor.elements.CountrySelect.editor.excludeCountries.label
source: Exclude countries
ar: استبعاد الدُوُل
it: Escludi paesi

# formEditor.elements.UnknownElement
source: Unknown element
ar: عنصر غير معروف
it: Elemento sconosciuto

# formEditor.stage.toolbar.new_element
source: Create new element
ar: إنشاء عنصر جديد
it: Crea nuovo elemento

# formEditor.stage.toolbar.remove
source: Remove
ar: إزالة
it: Rimuovi

# formEditor.stage.toolbar.new_element.inside
source: Inside
ar: بالداخل
it: Dentro

# formEditor.stage.toolbar.new_element.after
source: After
ar: بعد
it: Dopo

# formEditor.inspector.editor.formelement_selector.title
source: Insert formelement identifier
ar: أدخل مُعرّف العنصر
it: Inserisci identificativo dell'elemento-form

# formEditor.inspector.editor.formelement_selector.no_elements
source: No elements available
ar: لا توجد عناصر مُتَوَفرة
it: Nessun elemento disponibile

# formEditor.inspector.editor.formelement.remove
source: Remove this Element
ar: إزالة هذا العنصر
it: Rimuovi questo elemento

# formEditor.inspector.editor.grid.add
source: Add a new row
ar: إضافة صف جديد
it: Aggiungi una nuova riga

# formEditor.inspector.editor.grid.remove
source: Remove this row
ar: إزالة هذا الصف
it: Rimuovi questa riga

source: [Empty]
it: [Vuoto]
