Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/form/Resources/Private/Language/*.Database.xlf
Languages: ar, it

# module.shortcut_name
source: Form manager
ar: مدير النموذج
it: Gestore form

source: Default
ar: افتراضي
it: Predefinito

# tt_content.pi_flexform.formframework.persistenceIdentifier
source: Form definition
ar: تعريف النموذج
it: Definizione Form

# tt_content.pi_flexform.formframework.sheet_general
source: General
ar: عام
it: Generale

# tt_content.pi_flexform.formframework.selectPersistenceIdentifier
source: Please select a form definition
ar: الرجاء تحديد تعريف النموذج
it: Selezionare una definizione di form

# tt_content.pi_flexform.formframework.overrideFinishers
source: Override finisher settings
ar: تجاوز إعدادات اللمسات الأخيرة
it: Sovrascrivi Impostazioni Azioni Post-invio

# tt_content.pi_flexform.formframework.overrideFinishers.empty
source: There are no finishers or finisher options in the current form definition.
ar: لا يوجد أي لمسات أخيرة أو خيارات أخيرة في تعريف النموذج الحالي.
it: Non ci sono azioni post-invio o relative opzioni nella definizione della form corrente.

# tt_content.preview.noPersistenceIdentifier
source: No form selected.
ar: لم يتم تحديد أي نموذج.
it: Nessuna form selezionata.

# tt_content.preview.invalidPersistenceIdentifier
source: Invalid form "%s".
ar: نموذج غير صالح "%s".
it: Form "%s" non valida.

# tt_content.preview.inaccessiblePersistenceIdentifier
source: "%s" (no read access).
ar: "%s" (لا يوجد صَلاحِيَة للقراءة).
it: "%s" (nessun accesso in lettura).

# tt_content.preview.notExistingdPersistenceIdentifier
source: The form "%s" does not exist.
ar: النموذج "%s" غير موجود.
it: La form "%s" non esiste.

# tt_content.preview.invalidFrameworkConfiguration
source: "%s" (Invalid ext:form configuration).
ar: "%s" (تكوين ext:form غير صالح).
it: "%s" (Configurazione di ext:form non valida).

# tt_content.preview.invalidFrameworkConfiguration.text
source: Invalid ext:form configuration in form "%s": %s
ar: تكوين ext:form غير صالح في شكل "%s": %s
it: Configurazione di ext:form non valida per il form "%s": %s

# tt_content.preview.invalidFrameworkConfiguration.title
source: Invalid configuration.
ar: تكوين غير صالح.
it: Configurazione non valida.

# tt_content.finishersDefinition.Confirmation.label
source: Confirmation
ar: تأكيد
it: Conferma

# tt_content.finishersDefinition.Confirmation.message.label
source: Text
ar: النص
it: Testo

# tt_content.finishersDefinition.Confirmation.contentElementUid.label
source: Record
ar: السجل

# tt_content.finishersDefinition.EmailToSender.label
source: Email to sender (form submitter)
ar: إرسال بريد إلكتروني إلى المُرسل (مُقدّم النموذج)
it: Invia email al mittente

# tt_content.finishersDefinition.EmailToSender.subject.label
source: Subject of the email
ar: عنوان البريد الإلكتروني
it: Oggetto dell'email

# tt_content.finishersDefinition.EmailToSender.recipients.label
source: Recipients
ar: المُستلِمون
it: Destinatari

# tt_content.finishersDefinition.EmailToSender.recipients.item.label
source: Recipient
ar: المُستلم
it: Destinatario

# tt_content.finishersDefinition.EmailToSender.recipients.email.label
source: Email Address
ar: عنوان البريد الإلكتروني
it: Indirizzo email

# tt_content.finishersDefinition.EmailToSender.recipients.name.label
source: Name
ar: الاسم
it: Nome

# tt_content.finishersDefinition.EmailToSender.senderAddress.label
source: Email address of the sender
ar: عنوان البريد الإلكتروني للمُرسل
it: Indirizzo email del mittente

# tt_content.finishersDefinition.EmailToSender.senderName.label
source: Human-readable name of the sender
ar: اسم المُرسل بشكل واضح ومقروء
it: Nome del mittente

# tt_content.finishersDefinition.EmailToSender.replyToRecipients.label
source: Reply-To Recipients
ar: الرد على المُستلِمِين
it: Destinatari per la risposta

# tt_content.finishersDefinition.EmailToSender.replyToRecipients.item.label
source: Reply-To Recipient
ar: الرد على المُستلِم
it: Destinatario per la risposta

# tt_content.finishersDefinition.EmailToSender.carbonCopyRecipients.label
source: CC Recipients
ar: إرسال نسخة إلى المُستلِمين (CC)
it: Destinatari cc

# tt_content.finishersDefinition.EmailToSender.carbonCopyRecipients.item.label
source: CC Recipient
ar: إرسال نسخة إلى المُستلِم (CC)
it: Destinatario cc

# tt_content.finishersDefinition.EmailToSender.blindCarbonCopyRecipients.label
source: BCC Recipients
ar: إرسال نسخة مخفيّة الوجهة إلى المُستلِمين (BCC)
it: Destinatari ccn

source: BCC Recipient
ar: إرسال نسخة مخفيّة الوجهة إلى المُستلِم (BCC)
it: Destinatario ccn

# tt_content.finishersDefinition.EmailToSender.addHtmlPart.label
source: Add HTML mail part
ar: إضافة جزء من HTML إلى البريد
it: Aggiungi HTML all'email

# tt_content.finishersDefinition.EmailToSender.language.label
source: Translation language
ar: لغة الترجمة
it: Lingua di traduzione

# tt_content.finishersDefinition.EmailToSender.language.1
source: Default
ar: افتراضي
it: Predefinito

# tt_content.finishersDefinition.EmailToSender.title.label
source: Title
ar: عنوان
it: Titolo

# tt_content.finishersDefinition.EmailToReceiver.label
source: Email to receiver (you)
ar: البريد الإلكتروني إلى المُستلم (أنت)
it: Invia email al ricevente (tu)

# tt_content.finishersDefinition.EmailToReceiver.subject.label
source: Subject of the email
ar: عنوان البريد الإلكتروني
it: Oggetto dell'email

# tt_content.finishersDefinition.EmailToReceiver.recipients.label
source: Email addresses and human-readable names of the recipients
ar: عناوين البريد الإلكتروني وأسماء المُستلمين القابلة للقراءة بشكل واضح
it: Indirizzi email e nomi dei destinatari

# tt_content.finishersDefinition.EmailToReceiver.senderAddress.label
source: Email address of the sender
ar: عنوان البريد الإلكتروني للمُرسل
it: Indirizzo email del mittente

# tt_content.finishersDefinition.EmailToReceiver.senderName.label
source: Human-readable name of the sender
ar: اسم المُرسل بشكل واضح ومقروء
it: Nome del mittente

# tt_content.finishersDefinition.EmailToReceiver.replyToRecipients.label
source: Reply-To Recipients
ar: الرد على المُستلِمِين
it: Destinatari per la risposta

# tt_content.finishersDefinition.EmailToReceiver.carbonCopyRecipients.label
source: CC Recipients
ar: إرسال نسخة إلى المُستلِمين (CC)
it: Destinatari cc

# tt_content.finishersDefinition.EmailToReceiver.blindCarbonCopyRecipients.label
source: BCC Recipients
ar: إرسال نسخة مخفيّة الوجهة إلى المُستلِمين (BCC)
it: Destinatari ccn

# tt_content.finishersDefinition.EmailToReceiver.addHtmlPart.label
source: Add HTML part
ar: إضافة جزء من HTML إلى البريد
it: Aggiungi HTML all'email

# tt_content.finishersDefinition.EmailToReceiver.language.label
source: Translation language
ar: لغة الترجمة
it: Lingua di traduzione

# tt_content.finishersDefinition.EmailToReceiver.language.1
source: Default
ar: افتراضي
it: Predefinito

# tt_content.finishersDefinition.EmailToReceiver.title.label
source: Title
ar: العنوان
it: Titolo

# tt_content.finishersDefinition.Redirect.label
source: Redirect
ar: إعادة توجيه
it: Reindirizzamento

# tt_content.finishersDefinition.Redirect.pageUid.label
source: Page
ar: الصفحة
it: Pagina

# tt_content.finishersDefinition.Redirect.additionalParameters.label
source: Additional link parameter
ar: مُتَغيّر الرابط الإضافي
it: Parametri aggiuntivi del collegamento

# tt_content.finishersDefinition.Redirect.fragment.label
source: Add fragment to the redirect link
ar: إضافة جزء إلى رابط إعادة التوجيه
it: Aggiungi segmento al collegamento di reindirizzamento

# formManagerController.deleteAction.error.title
source: Delete error
ar: حذف الخطأ
it: Errore durante l'eliminazione

# formManagerController.deleteAction.error.body
source: The form "%s" could not be deleted.
ar: تعذّر حذف النموذج "%s".
it: La form "%s" potrebbe non essere stata eliminata.

# formManager.headline
source: Form Management
ar: إدارة النموذج
it: Gestione Form

# formManager.create_new_form
source: Create new form
ar: إنشاء نموذج جديد
it: Crea una nuova form

# formManager.form_name
source: Form name
ar: اسم النموذج
it: Nome form

# formManager.location
source: Location
ar: الموقع
it: Posizione

# formManager.references
source: Ref
ar: مَرجِع
it: Rif

# formManager.options
source: Options
ar: الخيارات
it: Opzioni

# formManager.edit_form
source: Edit this form
ar: تعديل هذا النموذج
it: Modifica questa form

# formManager.duplicate_this_form
source: Duplicate this form
ar: تكرار هذا النموذج
it: Duplica questa form

# formManager.delete_form
source: Delete this form
ar: حذف هذا النموذج
it: Elimina questa form

# formManager.forms_not_found.title
source: No forms found!
ar: لم يتم العثور على أي نماذج!
it: Nessuna form trovata!

# formManager.forms_not_found.message
source: There are currently no forms found in the system.
ar: لم يتم العثور حالياً أي نماذج في النظام.
it: Al momento non ci sono form nel sistema.

# formManager.forms_not_found_by_search_term.message
source: There are currently no forms found containing the search term %1s.
ar: لم يتم العثور حالياً على أيّة نماذج تحتوي على مصطلح البحث هذا %1s.
it: Non sono state trovate form contenenti il termine di ricerca %1s.

# formManager.remove_search_term
source: Remove search term
ar: إزالة مصطلح البحث
it: Rimuovi termine di ricerca

# formManager.edit_form_not_allowed
source: Edit this form is not allowed.
ar: غير مسموح لك بتعديل هذا النموذج.
it: La modifica di questa form non è consentita.

# formManager.duplicate_form_not_allowed
source: Duplicate this form is not allowed.
ar: غير مسموح لك بتكرار هذا النموذج.
it: Non è consentito duplicare questa form.

# formManager.invalid
source: Invalid YAML file!
ar: ملف YAML غير صالح!
it: File YAML non valido!

# formManager.duplicate_identifier
source: Duplicate identifier!
ar: تكرار المُعرّف!
it: Identificativo duplicato!

# formManager.selectablePrototypesConfiguration.standard.label
source: Standard
ar: افتراضي

source: Blank form
ar: نموذج فارغ
it: Form vuota

source: Simple contact form (ext:form example)
ar: نموذج تواصل بسيط (ext:form مثال)
it: Semplice form di contatto (esempio ext:form)

# formEditor.header
source: Form editor
ar: محرر النموذج
it: Editor di form

# formEditor.loading
source: Loading...
ar: جارِ التحميل...
it: Caricamento...

# formEditor.spinner
source: Loading...
ar: جارٍ التحميل...
it: Caricamento...

# formEditor.save_button
source: Save
ar: حفظ
it: Salva

# formEditor.form_settings_button
source: Settings
ar: الإعدادات
it: Impostazioni

# formEditor.undo_button
source: Undo
ar: تراجع
it: Annulla

# formEditor.redo_button
source: Redo
ar: إعادة
it: Ripeti

# formEditor.new_page_button
source: Create new step
ar: إنشاء خطوة جديدة
it: Crea nuovo passo

# formEditor.edit_mode_button
source: Previous step
ar: الخطوة السابقة
it: Passo precedente

# formEditor.edit_mode_button
source: Next step
ar: الخطوة التالية
it: Passo successivo

# formEditor.preview_mode_button
source: Preview mode
ar: وضع المُعاينة
it: Modalità anteprima

# formEditor.edit_mode_button
source: Edit mode
ar: وضع التعديل
it: Modalità modifica

# formEditor.structure
source: Structure
ar: الهيكل
it: Struttura

# formEditor.insert_elements
source: Insert elements
ar: إدراج عناصر
it: Inserisci elementi

# formEditor.formElementPropertyValidatorsDefinition.NotEmpty.label
source: Required
ar: مطلُوب
it: Obbligatorio

# formEditor.formElementPropertyValidatorsDefinition.Integer.label
source: Not a number
ar: ليس رقماً
it: Non è un numero

# formEditor.formElementPropertyValidatorsDefinition.NaiveEmail.label
source: Invalid email address
ar: عنوان البريد الإلكتروني غير صالح
it: Indirizzo email non valido

source: Invalid form element
ar: عنصر النموذج غير صالح
it: Elemento della form non valido

# formEditor.formElementPropertyValidatorsDefinition.FileSize.label
source: Invalid file size format, valid e.g. "10B|K|M|G"
ar: تنسيق حجم المِلَفّ غير صالح، صالح مثل "10B|K|M|G"
it: Formato non valido della dimensione del file; ammessi valori come "10B|K|M|G"

# formEditor.formElementPropertyValidatorsDefinition.RFC3339FullDate.label
source: Invalid date format. Valid format: Y-m-d (2018-03-17)
ar: تنسيق التاريخ غير صالح. تنسيق صالح: Y-m-d (2018-03-17)
it: Formato non valido della data. Formato valido: aaaa-mm-gg (2018-03-17)

source: Invalid pattern
ar: نَمَط غير صالح
it: Pattern non valido

# formEditor.formElementGroups.input.label
source: Basic elements
ar: عناصر أساسية
it: Elementi base

# formEditor.formElementGroups.html5.label
source: Special elements
ar: عناصر خاصة
it: Elementi speciali

# formEditor.formElementGroups.select.label
source: Select elements
ar: حَدّد العناصر
it: Elementi selezione

# formEditor.formElementGroups.custom.label
source: Advanced elements
ar: عناصر مُتَقدِمة
it: Elementi avanzati

# formEditor.formElementGroups.container.label
source: Container elements
ar: عناصر الحاوية
it: Elementi contenitore

# formEditor.formElementGroups.page.label
source: Step types
ar: أنواع الخُطُوات
it: Tipi di passo

# formEditor.elements.BaseFormElementMixin.editor.label.label
source: Form name
ar: اسم النموذج
it: Nome form

# formEditor.elements.Form.saveSuccessFlashMessageTitle
source: Save
ar: حفظ
it: Salva

# formEditor.elements.Form.saveSuccessFlashMessageMessage
source: The form has been successfully saved.
ar: تم حفظ النموذج بنجاح.
it: La form è stata salvata correttamente.

# formEditor.elements.Form.saveErrorFlashMessageTitle
source: Save
ar: حفظ
it: Salva

# formEditor.elements.Form.saveErrorFlashMessageMessage
source: The form could not be saved:
ar: تَعذّر حفظ النموذج:
it: Non è stato possibile salvare la form:

# formEditor.modals.validationErrors.dialogTitle
source: Alert
ar: تنبيه
it: Avviso

# formEditor.modals.validationErrors.dialogMessage
source: Some elements are not configured properly. Please check the following elements:
ar: لم يتم تكوين بعض العناصر بشكل صحيح. الرجاء التحقق من العناصر التالية:
it: Alcuni elementi non sono configurati correttamente. Controllare i seguenti elementi:

# formEditor.modals.validationErrors.confirmButton
source: OK
ar: موافق

# formEditor.modals.insertElements.dialogTitle
source: New element
ar: عنصر جديد
it: Nuovo elemento

# formEditor.modals.newPages.dialogTitle
source: New step
ar: خُطوة جديدة
it: Nuovo passo

# formEditor.modals.removeElement.dialogTitle
source: Remove element?
ar: إزالة العنصر؟
it: Rimuovi elemento?

# formEditor.modals.removeElement.dialogMessage
source: Are you sure that you want to remove this element?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟
it: Sei sicuro di voler rimuovere questo elemento?

# formEditor.modals.removeElement.confirmButton
source: Remove
ar: إزالة
it: Rimuovi

# formEditor.modals.removeElement.cancelButton
source: Cancel
ar: إلغاء
it: Annulla

# formEditor.modals.removeElement.lastAvailablePageFlashMessageTitle
source: Error
ar: خطأ
it: Errore

# formEditor.modals.removeElement.lastAvailablePageFlashMessageMessage
source: There must be at least one step within your form.
ar: يجب أن يكون هناك خُطوة واحدة على الأقل في النموذج الخاص بك.
it: Deve esserci almeno un passo nella form.

# formEditor.modals.close.dialogMessage
source: You have currently unsaved changes. Are you sure that you want to discard all changes?
ar: لديك حالياً تغييرات غير محفُوظة. هل أنت متأكد من أنك تريد تجاهل هذه التغييرات؟
it: Ci sono modifiche non ancora salvate. Sei sicuro di voler ignorare tutte le modifiche effettuate?

# formEditor.modals.close.dialogTitle
source: Do you want to quit without saving?
ar: هل تريد الخروج دون حفظ؟
it: Vuoi uscire senza salvare?

# formEditor.modals.close.confirmButton
source: Yes, discard my changes
ar: نعم، تجاهل التغييرات
it: Sì, ignora le mie modifiche

# formEditor.modals.close.cancelButton
source: No, I will continue editing
ar: لا، سوف أستمر في التعديل
it: No, voglio continuare la modifica

# formEditor.pagination.title
source: Step {0} of {1}
ar: الخطوة {0} من {1}
it: Passo {0} di {1}

# formEditor.elements.MinimumMaximumEditorsMixin.editor.minimum.label
source: Minimum
ar: الحد الأدنى
it: Minimo

# formEditor.elements.MinimumMaximumEditorsMixin.editor.maximum.label
source: Maximum
ar: الحد الأقصى
it: Massimo

# formEditor.elements.TextMixin.editor.placeholder.label
source: Placeholder
ar: النص البديل
it: Segnaposto

# formEditor.elements.TextMixin.editor.defaultValue.label
source: Default value
ar: القيمة الافتراضية
it: Valore predefinito

# formEditor.elements.TextMixin.editor.pattern.label
source: Pattern
ar: النمط

# formEditor.elements.TextMixin.editor.pattern.fieldExplanationText
source: Additional client-side validation as JavaScript regular expression
ar: التحقق الإضافي من جانب العميل كتعبير عادي لـ JavaScript
it: Validazione aggiuntiva lato client, come espressione regolare JavaScript

# formEditor.elements.TextMixin.editor.step.label
source: Step
ar: الخطوة
it: Passo

# formEditor.elements.TextMixin.editor.validators.label
source: Validators
ar: المُدقّقُون
it: Validazioni

# formEditor.elements.TextMixin.editor.validators.EmptyValue.label
source: Add validator
ar: إضافة مُدقق
it: Aggiungi validazione

# formEditor.elements.TextMixin.editor.validators.Alphanumeric.label
source: Alphanumeric
ar: أبجدي رقمي
it: Alfanumerico

# formEditor.elements.TextMixin.editor.validators.Text.label
source: Non-XML text
ar: نص ليس XML
it: Testo Non-XML

# formEditor.elements.TextMixin.editor.validators.StringLength.label
source: String length
ar: طول النص
it: Lunghezza della stringa

# formEditor.elements.TextMixin.editor.validators.EmailAddress.label
source: Email
ar: البريد الإلكتروني

# formEditor.elements.TextMixin.editor.validators.Integer.label
source: Integer number
ar: عدد صحيح
it: Numero intero

# formEditor.elements.TextMixin.editor.validators.Float.label
source: Floating-point number
ar: العدد الفاصل العائم
it: Numero decimale

# formEditor.elements.TextMixin.editor.validators.Number.label
source: Number
ar: رقم
it: Numero

# formEditor.elements.TextMixin.editor.validators.NumberRange.label
source: Number range
ar: نطاق الرقم
it: Intervallo numerico

# formEditor.elements.TextMixin.editor.validators.RegularExpression.label
source: Regular expression
ar: التعبير العادي
it: Espressione regolare

# formEditor.elements.MultiSelectionMixin.editor.validators.Count.label
source: Number of submitted values
ar: عدد القِيم المُقدَّمة
it: Numero dei valori inviati

# formEditor.elements.TextMixin.validators.Alphanumeric.editor.header.label
source: Alphanumeric
ar: أبجدي رقمي
it: Alfanumerico

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.Text.editor.header.label
source: Non-XML text
ar: نص ليس XML
it: Testo Non-XML

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.StringLength.editor.header.label
source: String length
ar: طول النص
it: Lunghezza della stringa

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.EmailAddress.editor.header.label
source: Email
ar: البريد الإلكتروني

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي تظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.Integer.editor.header.label
source: Integer number
ar: عدد صحيح
it: Numero intero

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي تظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.Float.editor.header.label
source: Floating-point number
ar: العدد الفاصل العائم
it: Numero decimale

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.Number.editor.header.label
source: Number
ar: رقم
it: Numero

# formEditor.elements.TextMixin.validators.NumberRange.editor.header.label
source: Number range
ar: نطاق الأرقام
it: Intervallo numerico

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.TextMixin.validators.RegularExpression.editor.header.label
source: Regular expression
ar: التعبير العادي
it: Espressione regolare

# formEditor.elements.TextMixin.validators.RegularExpression.editor.regex.label
source: Regular expression
ar: التعبير العادي
it: Espressione regolare

source: Enter a valid PHP PCRE regular expression here.
ar: أدخل تعبير عادي صالح لـ PHP PCRE هنا.
it: Inserisci un'espressione regolare PHP PCRE valida.

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.MultiSelectionMixin.validators.Count.editor.header.label
source: Number of submitted values
ar: عدد القِيم المُقدَّمة
it: Numero di valori inviati

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي ستظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.SelectionMixin.editor.inactiveOption.label
source: First option (empty value)
ar: الخيار الأول (قيمة فارغة)
it: Prima opzione (valore vuoto)

# formEditor.elements.SelectionMixin.editor.inactiveOption.fieldExplanationText
source: If set, this label will be shown as first option.
ar: إذا تم تعيينه، سيتم عرض هذه التسمية كخيار أول.
it: Se definita, questa etichetta verrà mostrata come prima opzione.

# formEditor.elements.SelectionMixin.editor.options.label
source: Choices
ar: الخيارات
it: Opzioni

# formEditor.elements.MultiSelectionMixin.editor.validators.label
source: Validators
ar: المُدقّقُون
it: Validazioni

# formEditor.elements.MultiSelectionMixin.editor.validators.EmptyValue.label
source: Add validator
ar: إضافة مُدقق
it: Aggiungi validazione

# formEditor.elements.FileUploadMixin.editor.saveToFileMount.label
source: Uploads save path
ar: تحميلات مسار الحفظ
it: Percorso di salvataggio file caricati

# formEditor.elements.FileUploadMixin.editor.validators.label
source: Validators
ar: المُدقّقُون
it: Validazioni

# formEditor.elements.FileUploadMixin.editor.validators.EmptyValue.label
source: Add validator
ar: إضافة مُدقق
it: Aggiungi validazione

# formEditor.elements.FileUploadMixin.editor.validators.FileSize.label
source: File size
ar: حجم الملف
it: Dimensione del file

# formEditor.elements.FileUploadMixin.validators.FileSize.editor.header.label
source: File size
ar: حجم الملف
it: Dimensione del file
