Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/form/Resources/Private/Language/*.Database.xlf
Languages: ar, it

# formEditor.elements.Form.editor.submitButtonLabel.label
source: Submit label
ar: إرسال التسمية
it: Etichetta di invio

# formEditor.elements.Form.editor.submitButtonLabel.value
source: Submit
ar: إرسال
it: Invia

# formEditor.elements.Form.editor.finishers.label
source: Finishers
ar: اللمسات الأخيرة
it: Azioni post-invio

# formEditor.elements.Form.editor.finishers.EmptyValue.label
source: Add finisher
ar: إضافة لمسة أخيرة
it: Aggiungi azione post-invio

# formEditor.elements.Form.editor.finishers.EmailToSender.label
source: Email to sender (form submitter)
ar: إرسال بريد إلكتروني إلى المُرسل (مُقدّم النموذج)
it: Invia email al mittente

# formEditor.elements.Form.editor.finishers.EmailToReceiver.label
source: Email to receiver (you)
ar: إرسال بريد إلكتروني إلى المُستلم (أنت)
it: Invia email al ricevente (tu)

# formEditor.elements.Form.editor.finishers.Redirect.label
source: Redirect to a page
ar: إعادة التوجيه إلى صفحة ما
it: Reindirizza a una pagina

# formEditor.elements.Form.editor.finishers.DeleteUploads.label
source: Delete uploads
ar: حذف التحميلات
it: Elimina file caricati

# formEditor.elements.Form.editor.finishers.Confirmation.label
source: Confirmation message
ar: رسالة التأكيد
it: Messaggio di conferma

# formEditor.elements.Form.finisher.EmailToSender.editor.header.label
source: Email to sender (form submitter)
ar: إرسال بريد إلكتروني إلى المُرسل (مِن مُقدّم النموذج)
it: Invia email al mittente

# formEditor.elements.Form.finisher.EmailToSender.editor.subject.label
source: Subject
ar: الموضوع
it: Oggetto

# formEditor.elements.Form.finisher.EmailToSender.editor.recipients.label
source: Recipients
ar: المُستلِمون
it: Destinatari

source: The email addresses and names of the website visitors to which the email should be sent.
ar: عناوين البريد الإلكتروني وأسماء زوار الموقع التي ينبغي إرسال البريد الإلكتروني إليها.
it: Gli indirizzi email e i nomi dei visitatori del sito web a cui l'email dovrebbe essere inviata.

source: Email Address
ar: عنوان البريد الإلكتروني
it: Indirizzo email

source: Name
ar: الاسم
it: Nome

# formEditor.elements.Form.finisher.EmailToSender.editor.senderAddress.label
source: Sender address
ar: عنوان المُرسِل
it: Indirizzo del mittente

source: The email address of the sender (e.g. your company's email address) which appears in the website visitor email client.
ar: عنوان البريد الإلكتروني للمُرسِل (على سبيل المثال عنوان البريد الإلكتروني لشركتك) الذي يظهر في البريد الإلكتروني لزوّار الموقع.
it: L'indirizzo email del mittente (es. l'indirizzo email della tua azienda) che appare nel client di posta elettronica del visitatore del sito.

# formEditor.elements.Form.finisher.EmailToSender.editor.senderName.label
source: Sender name
ar: اسم المُرسِل
it: Nome del mittente

source: The name of the sender (e.g. your company's name) which appears in the website visitor email client.
ar: عنوان البريد الإلكتروني للمُرسِل (على سبيل المثال اسم شركتك) الذي يظهر في البريد الإلكتروني لزوّار الموقع.
it: Il nome del mittente (es. il nome della tua azienda) che appare nel client di posta elettronica del visitatore del sito.

# formEditor.elements.Form.finisher.EmailToSender.editor.replyToRecipients.label
source: Reply-To Recipients
ar: الرد على المُستلِمِين
it: Destinatari per la risposta

source: CC Recipients
ar: إرسال نسخة إلى المُستلِمين (CC)
it: Destinatari cc

source: BCC Recipients
ar: إرسال نسخة مخفيّة الوجهة إلى المُستلِمين (BCC)
it: Destinatari ccn

# formEditor.elements.Form.finisher.EmailToSender.editor.addHtmlPart.label
source: Add HTML part
ar: إضافة جزء من HTML إلى البريد
it: Aggiungi HTML all'email

source: If enabled, the email will contain a plaintext and an HTML part, otherwise only a plaintext part.
ar: في حالة التفعيل، سوف يحتوي البريد الإلكتروني على plaintext وجزء من HTML، وإلا فإن جزء plaintext فقط.
it: Se abilitata, l'email conterrà un testo semplice e una parte HTML, altrimenti solo una parte di testo semplice.

# formEditor.elements.Form.finisher.EmailToSender.editor.attachUploads.label
source: Attach uploads
ar: إرفاق التحميلات
it: Allega file caricati

# formEditor.elements.Form.finisher.EmailToSender.editor.language.label
source: Translation language
ar: لغة الترجمة
it: Lingua di traduzione

# formEditor.elements.Form.finisher.EmailToSender.editor.title.label
source: Title
ar: العنوان
it: Titolo

source: The title, being shown in the Email. The title is rendered in the header section right above the email body. Do not confuse this field with the subject of your email.
ar: العنوان الذي يظهر في البريد الإلكتروني. العنوان يتم تقديمه في قسم الترويسة أعلى البريد الإلكتروني. لا تخلط بين هذا الحقل وبين موضوع بريدك الإلكتروني.
it: Il titolo del messaggio. Il titolo viene visualizzato nella sezione intestazione proprio sopra il corpo dell'email. Non confondere questo campo con l'oggetto della tua email.

# formEditor.elements.Form.finisher.EmailToReceiver.editor.header.label
source: Email to receiver (you)
ar: إرسال بريد إلكتروني إلى المُستلم (أنت)
it: Invia email al ricevente (tu)

# formEditor.elements.Form.finisher.EmailToReceiver.editor.subject.label
source: Subject
ar: الموضوع
it: Oggetto

# formEditor.elements.Form.finisher.EmailToReceiver.editor.recipients.label
source: Recipients
ar: المُستلِمون
it: Destinatari

source: The email addresses and names of the recipients to which the email should be sent (e.g. your company's email addresses).
ar: عناوين البريد الإلكتروني وأسماء المُستلِمين التي يجب إرسال البريد الإلكتروني إليها (على سبيل المثال عناوين البريد الإلكتروني لشركتك).
it: Gli indirizzi email e i nomi dei destinatari ai quali l'email dovrebbe essere inviata (es. gli indirizzi email della tua azienda).

# formEditor.elements.Form.finisher.EmailToReceiver.editor.senderAddress.label
source: Sender address
ar: عنوان المُرسِل
it: Indirizzo del mittente

source: The email address of the sender which appears in your email client. If you want, you can use the "insert formelement identifier" dropdown to choose a form element which holds the website visitors email address.
ar: عنوان البريد الإلكتروني للمُرسِل الذي يظهر في عميل البريد الإلكتروني الخاص بك. إذا أردت، يمكنك استخدام القائمة المُنسدِلَة "إدراج عنصر الاستمارة" لاختيار عنصر الاستمارة الذي يحمل عنوان البريد الإلكتروني لزوار الموقع.
it: L'indirizzo email del mittente che appare nel client di posta elettronica. Se vuoi, puoi usare il menù a tendina "Inserisci identificativo dell'elemento-form" per scegliere un elemento di form che contiene l'indirizzo email dei visitatori del sito web.

# formEditor.elements.Form.finisher.EmailToReceiver.editor.senderName.label
source: Sender name
ar: اسم المُرسِل
it: Nome del mittente

source: The name of the sender which appears in your email client. If you want, you can use the "insert formelement identifier" dropdown to choose one or more form elements which holds the website visitors name.
ar: اسم المُرسل الذي يظهر في البريد الإلكتروني الخاص بعميلك. إذا أردت، يمكنك استخدام القائمة المُنسدِلة "إدراج عنصر الاستمارة" لاختيار عنصر أو أكثر من عناصر النموذج التي تحمل اسم زوار الموقع.
it: Il nome del mittente che appare nel client di posta elettronica. Se vuoi, puoi usare il menù a tendina "Inserisci identificativo dell'elemento-form" per scegliere uno o più elementi di form che contengono il nome dei visitatori del sito.

# formEditor.elements.Form.finisher.EmailToReceiver.editor.replyToRecipients.label
source: Reply-To Recipients
ar: الرد على المُستلِمِين
it: Destinatari per la risposta

source: CC Recipients
ar: إرسال نسخة إلى المُستلِمين (CC)
it: Destinatari cc

source: BCC Recipients
ar: إرسال نسخة مخفيّة الوجهة إلى المُستلِمين (BCC)
it: Destinatari ccn

# formEditor.elements.Form.finisher.EmailToReceiver.editor.addHtmlPart.label
source: Add HTML part
ar: إضافة جزء من HTML إلى البريد
it: Aggiungi HTML all'email

source: If enabled, the email will contain a plaintext and an HTML part, otherwise only a plaintext part.
ar: في حالة التفعيل، سوف يحتوي البريد الإلكتروني على نص مُجرّد وجزء من HTML، وإلا فقط جزء نص مُجرّد.
it: Se abilitata, l'email conterrà un testo semplice e una parte HTML, altrimenti solo una parte di testo semplice.

# formEditor.elements.Form.finisher.EmailToReceiver.editor.attachUploads.label
source: Attach uploads
ar: إرفاق التحميلات
it: Allega file caricati

# formEditor.elements.Form.finisher.EmailToReceiver.editor.language.label
source: Translation language
ar: لغة الترجمة
it: Lingua di traduzione

# formEditor.elements.Form.finisher.Redirect.editor.header.label
source: Redirect to a page
ar: إعادة التوجيه إلى صفحة ما
it: Reindirizza a una pagina

# formEditor.elements.Form.finisher.Redirect.editor.pageUid.label
source: Page
ar: الصفحة
it: Pagina

# formEditor.elements.Form.finisher.Redirect.editor.pageUid.buttonLabel
source: Page
ar: الصفحة
it: Pagina

# formEditor.elements.Form.finisher.Redirect.editor.additionalParameters.label
source: Additional parameters
ar: مُتَغيّرات إضافيّة
it: Parametri addizionali

# formEditor.elements.Form.finisher.Redirect.editor.fragment.label
source: URL fragment
ar: مقطع URL
it: Segmento URL

# formEditor.elements.Form.finisher.Redirect.editor.fragment.buttonLabel
source: Page Content
ar: محتوى الصفحة
it: Contenuto di Pagina

# formEditor.elements.Form.finisher.Redirect.editor.fragment.fieldExplanationText
source: You can use a content element identifier as URL fragment or set a custom fragment identifier.
ar: يمكنك استخدام مُعرّف عنصر المحتوى كأجزاء URL أو تعيين مقطع مُعرّف مُخصص.
it: Puoi utilizzare un identificatore di elemento di contenuto come segmento di URL o impostare un identificatore di segmento personalizzato.

# formEditor.elements.Form.finisher.DeleteUploads.editor.header.label
source: Delete uploads
ar: حذف التحميلات
it: Elimina file caricati

# formEditor.elements.Form.finisher.Confirmation.editor.header.label
source: Confirmation message
ar: تأكيد الرسالة
it: Messaggio di conferma

# formEditor.elements.Form.finisher.Confirmation.editor.contentElement.label
source: Content element uid
ar: المُعرّف uid لعنصر المحتوى
it: Elemento di contenuto (Uid)

# formEditor.elements.Form.finisher.Confirmation.editor.contentElement.buttonLabel
source: Page Content
ar: محتوى الصفحة
it: Contenuto di pagina

# formEditor.elements.Form.finisher.Confirmation.editor.message.label
source: Text
ar: النصوص
it: Testo

source: Will be ignored if "Content element" is set
ar: سيتم تجاهله إذا تم تعيين "عنصر المحتوى"
it: Verrà ignorato se "Elemento di Contenuto" è impostato

# formEditor.elements.Form.finisher.Closure.editor.header.label
source: Execute a closure
ar: تنفيذ الإغلاق
it: Esegui chiusura

# formEditor.elements.Form.finisher.FlashMessage.editor.header.label
source: Flash message
ar: رسالة سريعة
it: Messaggio Flash

# formEditor.elements.Form.finisher.SaveToDatabase.editor.header.label
source: Save the mail to the Database
ar: حفظ البريد الإلكتروني في قاعدة البيانات
it: Salva l'email nel Database

# formEditor.elements.ReadOnlyFormElement.editor.label.label
source: Label
ar: التسمية
it: Etichetta

# formEditor.elements.FormElement.editor.label.label
source: Label
ar: التسمية
it: Etichetta

# formEditor.elements.FormElement.editor.elementDescription.label
source: Description
ar: الوَصف
it: Descrizione

# formEditor.elements.FormElement.editor.autocomplete.label
source: Autocomplete
ar: الإكمال التلقائي
it: Completamento automatico

# formEditor.elements.FormElement.editor.autocomplete.option.none
source: None
ar: لا شَيْء
it: Nessuno

# formEditor.elements.FormElement.editor.autocomplete.option.off
source: off - disable the autocomplete functionality
ar: إيقاف - تعطيل وظيفة الإكمال التلقائي
it: off - disabilita la funzionalità di completamento automatico

# formEditor.elements.FormElement.editor.autocomplete.option.name
source: name - Full name
ar: الاسم - الاسم الكامل
it: nome - Nome completo

# formEditor.elements.FormElement.editor.autocomplete.option.honorific-prefix
source: Prefix or title (e.g., "Mr.", "Ms.", "Dr.")
ar: بادئة أو عنوان (على سبيل المثال "السيد "،"السيدة"، "م."، "د.")
it: Prefisso o titolo (ad es., "Sig.", "Sig.ra", "Dott.")

# formEditor.elements.FormElement.editor.autocomplete.option.given-name
source: given-name - first name
ar: الاسم - الاسم الأول
it: given-name - nome

# formEditor.elements.FormElement.editor.autocomplete.option.additional-name
source: additional-name - middle name
ar: اسم إضافي - الاسم الأوسط
it: additional-name - secondo nome

# formEditor.elements.FormElement.editor.autocomplete.option.family-name
source: family-name - last name
ar: اسم العائلة - الكُنية
it: family-name - cognome

# formEditor.elements.FormElement.editor.autocomplete.option.honorific-suffix
source: honorific-suffix - Name suffix (e.g., "Jr.", "II")
ar: تذييل الاسم (مثلاً: "Jr.", "المحترم")
it: honorific-suffix - Suffisso (ad es., "Jr.", "II")

# formEditor.elements.FormElement.editor.autocomplete.option.nickname
source: Nickname, screen name
ar: اللقب، الاسم الشائع
it: Nickname, nome sullo schermo

# formEditor.elements.FormElement.editor.autocomplete.option.organization-title
source: organization-title - Job title
ar: الموقع في المؤسسة - الوَصف الوظيفي
it: organization-title - Titolo professionale

# formEditor.elements.FormElement.editor.autocomplete.option.username
source: username
ar: اسم المستخدم
it: nome utente

# formEditor.elements.FormElement.editor.autocomplete.option.organization
source: organization - Company name
ar: المنظمة - اسم الشركة
it: organization - Nome azienda

# formEditor.elements.FormElement.editor.autocomplete.option.address-line1
source: address-line1 - Street address, line 1
ar: عنوان-السطر1 - عنوان الشارع، السطر1
it: address-line1 - Indirizzo stradale, riga 1

# formEditor.elements.FormElement.editor.autocomplete.option.address-line2
source: address-line1 - Street address, line 2
ar: عنوان-السطر1 - عنوان الشارع، السطر2
it: address-line1 - Indirizzo stradale, riga 2

# formEditor.elements.FormElement.editor.autocomplete.option.address-level1
source: address-level1 - State, Canton etc
ar: العنوان - المستوى 1 - الدولة، المقاطعة والخ
it: address-level1 - Regione, provincia, ecc

# formEditor.elements.FormElement.editor.autocomplete.option.address-level2
source: address-level2 - City
ar: العنوان المستوى 2 - المدينة
it: address-level2 - Città

# formEditor.elements.FormElement.editor.autocomplete.option.country-name
source: country-name
ar: اسم الدولة
it: country-name - Paese

# formEditor.elements.FormElement.editor.autocomplete.option.postal-code
source: postal-code - ZIP
ar: الرمز البريدي - ZIP
it: postal-code - CAP

# formEditor.elements.FormElement.editor.autocomplete.option.tel
source: tel - Full telephone number
ar: الهاتف - رَقَم الهاتف كاملاً
it: tel - Numero di telefono completo

# formEditor.elements.FormElement.editor.autocomplete.option.impp
source: impp - URL representing an instant messaging protocol endpoint
ar: impp - يُمثّل عنوان URL نقطة نهاية بروتوكول الرسائل الفورية
it: impp - URL che rappresenta un endpoint del protocollo di messaggistica istantanea

# formEditor.elements.FormElement.editor.autocomplete.option.sex
source: sex - Gender identity
ar: الجنس
it: sex - Identità di genere

# formEditor.elements.FormElement.editor.autocomplete.option.language
source: language - Preferred language
ar: اللغة - اللغة المُفضّلة
it: language - Lingua preferita

# formEditor.elements.FormElement.editor.autocomplete.option.street-address
source: street-address
ar: عنوان الشارع
it: street-address - Indirizzo

# formEditor.elements.FormElement.editor.autocomplete.option.tel-country-code
source: tel-country-code - Country code component of the telephone number
ar: رمز هاتف البلد - مُكوّن رمز البلد لرقم الهاتف
it: tel-country code - Codice del Paese per il numero di telefono

# formEditor.elements.FormElement.editor.autocomplete.option.tel-national
source: tel-national - Telephone number without the county code
ar: الهاتف المحلّي - رَقَم الهاتف دون رمز المقاطعة
it: tel-national - Numero di telefono senza prefisso di zona

# formEditor.elements.FormElement.editor.autocomplete.option.tel-area-code
source: tel-area-code - Area code component of the telephone number
ar: رمز منطقة الهاتف - مُكوّن رمز المنطقة لرقم الهاتف
it: tel-area-code - Prefisso di zona del numero di telefono

# formEditor.elements.FormElement.editor.autocomplete.option.tel-local
source: tel-local - Telephone number without the country code and area code component
ar: الهاتف الأرضي - رَقَم الهاتف دون رمز البلد ورمز المنطقة
it: tel-local - Numero di telefono senza codice paese e prefisso di zona

# formEditor.elements.FormElement.editor.autocomplete.option.tel-extension
source: tel-extension - Telephone number internal extension code
ar: المُلحق الهاتفي -رَقَم هاتف رمز الملحق الداخلي
it: tel-extension - Codice di estensione per numero di telefono interno

# formEditor.elements.FormElement.editor.autocomplete.option.url
source: url - Home page
ar: رابط - الصفحة الرئيسة
it: url - Pagina iniziale

# formEditor.elements.FormElement.editor.autocomplete.option.new-password
source: new-password - A new password to create / change
ar: كلمة المرور الجديدة - كلمة المرور الجديدة لإنشاء / تغيير
it: new-password - Una nuova password da creare/modificare

# formEditor.elements.FormElement.editor.autocomplete.option.current-password
source: current-password - Current password for the selected username
ar: كلمة المرور الحالية - كلمة المرور الحالية لاسم المستخدم المُحدد
it: current-password - Password attuale per il nome utente selezionato

# formEditor.elements.FormElement.editor.autocomplete.option.bday-day
source: bday-day - Day component of birthday
ar: يوم الميلاد - مُكوّن اليوم لعيد الميلاد
it: bday-day - Giorno della data di nascita

# formEditor.elements.FormElement.editor.autocomplete.option.bday-month
source: bday-month - Month component of birthday
ar: شهر الميلاد - مُكوّن الشهر لعيد الميلاد
it: bday-month - Mese della data di nascita

# formEditor.elements.FormElement.editor.autocomplete.option.bday-year
source: bday-year - Year component of birthday
ar: سنة الميلاد - مُكوّن السنة لعيد الميلاد
it: bday-year - Anno della data di nascita

# formEditor.elements.FormElement.editor.autocomplete.option.photo
source: photo
ar: صورة
it: foto

# formEditor.elements.FormElement.editor.autocomplete.option.email
source: email
ar: البريد الإلكتروني
it: email - Indirizzo email

# formEditor.elements.FormElement.editor.autocomplete.option.bday
source: bday - Birthday
ar: عيد الميلاد - يوم الميلاد
it: bday - Compleanno

# formEditor.elements.FormElement.editor.autocomplete.option.country
source: country - Country code
ar: البلد - رمز البلد
it: country - Codice del Paese

# formEditor.elements.FormElement.editor.requiredValidator.label
source: Field required
ar: حقل مطلوب
it: Campo richiesto

source: Custom error message
ar: تخصيص رسالة الخطأ
it: Messaggio di errore personalizzato

source: Error message which is shown if the validation does not succeed
ar: رسالة الخطأ التي تظهر إذا لم تنجح عملية التحقق
it: Messaggio di errore che verrà mostrato se la validazione non avrà successo

# formEditor.elements.FormElement.validators.DateRange.editor.header.label
source: Date range
ar: الفترة الزمنية
it: Intervallo di date

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.label
source: Grid viewport configuration
ar: إعدادات عرض الشبكة
it: Configurazione viewport a griglia

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.xs.label
source: Extra small
ar: صغير جداً
it: Molto piccolo

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.sm.label
source: Small
ar: صغير
it: Piccolo

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.md.label
source: Medium
ar: متوسط
it: Medio

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.lg.label
source: Large
ar: كبير
it: Grande

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.xl.label
source: Extra large
ar: كبير جداً
it: Molto grande

# formEditor.elements.FormElement.editor.gridColumnViewPortConfiguration.xxl.label
source: Extra extra large
ar: كبير جداً جداً
it: Molto, molto grande

source: Numbers of columns for viewport "{@viewPortLabel}"
ar: عدد الأعمدة لشاشة العرض "{@viewPortLabel}"
it: Numero di colonne per viewport "{@viewPortLabel}"

source: Leave empty for auto calculation
ar: اتركه فارغاً للحساب التلقائي
it: Lascia vuoto per calcolo automatico

# formEditor.elements.Page.label
source: Step
ar: الخطوة
it: Passo

# formEditor.elements.Page.editor.label.label
source: Step name
ar: اسم الخطوة
it: Nome passo

# formEditor.elements.Page.editor.previousButtonLabel.label
source: Previous button label
ar: تسمية زر الشريحة السابقة
it: Etichetta per il bottone "Indietro"

# formEditor.elements.Page.editor.previousButtonLabel.value
source: Previous step
ar: الخطوة السابقة
it: Passo precedente

# formEditor.elements.Page.editor.nextButtonLabel.label
source: Next button label
ar: تسمية الزر التالي
it: Etichetta per il bottone "Avanti"

# formEditor.elements.Page.editor.nextButtonLabel.value
source: Next step
ar: الخطوة التالية
it: Passo successivo

# formEditor.elements.SummaryPage.label
source: Summary step
ar: الخطوة المُوجَزة
it: Riepilogo dei passi

# formEditor.elements.SummaryPage.editor.label.label
source: Step name
ar: اسم الخطوة
it: Nome passo

# formEditor.elements.SummaryPage.editor.previousButtonLabel.label
source: Previous button label
ar: تسمية الزر السابق
it: Etichetta per il bottone "Indietro"

# formEditor.elements.SummaryPage.editor.previousButtonLabel.value
source: Previous step
ar: الخطوة السابقة
it: Passo precedente

# formEditor.elements.SummaryPage.editor.nextButtonLabel.label
source: Next button label
ar: تسمية الزر التالي
it: Etichetta per il bottone "Avanti"

# formEditor.elements.SummaryPage.editor.nextButtonLabel.value
source: Next step
ar: الخطوة التالية
it: Passo successivo

# formEditor.elements.Fieldset.label
source: Fieldset
ar: مجموعة الحُقُول
it: Gruppo di elementi

# formEditor.elements.Fieldset.editor.label.label
source: Fieldset name
ar: إسم مجموعة الحقول
it: Nome gruppo di elementi

# formEditor.elements.GridRow.label
source: Grid: Row
ar: شبكة: صف
it: Griglia: Riga

# formEditor.elements.GridRow.editor.label.label
source: Row name (not visible within frontend)
ar: اسم الصف (غير مرئي داخل الواجهة الأمامية)
it: Nome della riga (non visibile nel frontend)

# formEditor.elements.Text.label
source: Text
ar: النص
it: Testo

# formEditor.elements.Email.label
source: Email address
ar: عنوان البريد الإلكتروني
it: Indirizzo email

# formEditor.elements.Telephone.label
source: Telephone number
ar: رقم الهاتف
it: Numero di telefono

# formEditor.elements.Url.label
source: URL
ar: رابط URL

# formEditor.elements.Number.label
source: Number
ar: رقم
it: Numero

# formEditor.elements.Number.editor.validators.Number.label
source: Number
ar: رقم
it: Numero

# formEditor.elements.Date.label
source: Date
ar: التاريخ
it: Data

# formEditor.elements.Date.editor.defaultValue.placeholder
source: A date in format Y-m-d (e.g 2018-03-17)
ar: تاريخ بصيغة Y-m-d (مثل 2018-03-17)
it: Una data nel formato aaaa-mm-gg (es. 2018-03-17)

# formEditor.elements.Date.editor.step.fieldExplanationText
source: Specify the number of days between each occurrence of this event.
ar: حدد عدد الأيام بين كل تكرار لهذا الحدث.
it: Specifica il numero di giorni tra due occorrenze di questo evento.

# formEditor.elements.Date.editor.step.label
source: Frequency
ar: التردّد
it: Frequenza

# formEditor.elements.Date.editor.validators.DateRange.label
source: Date range
ar: نطاق التاريخ
it: Intervallo di date

# formEditor.elements.DatePicker.validators.DateRange.editor.header.label
source: Date range
ar: نطاق التاريخ
it: Intervallo di date

# formEditor.elements.DatePicker.validators.DateRange.editor.minimum
source: Minimum date
ar: الحد الأدنى للتاريخ
it: Data inizio
