Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/form/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# element.ImageUpload.properties.SummaryPage.altText
source: Uploaded image
ar: الصُور المَرفُوعة
it: Immagine caricata

# element.DatePicker.properties.timeSelectorHourLabel
source: Hour
ar: ساعة
it: Ora

# element.DatePicker.properties.timeSelectorMinuteLabel
source: Minute
ar: دقيقة
it: Minuto

# validation.error.1221560910
source: This field is mandatory.
ar: هذا الحقل إلزامي.
it: Questo campo è obbligatorio.

# validation.error.1221560718
source: This field is mandatory.
ar: هذا الحقل إلزامي.
it: Questo campo è obbligatorio.

# validation.error.1347992400
source: This field is mandatory.
ar: هذا الحقل إلزامي.
it: Questo campo è obbligatorio.

# validation.error.1347992453
source: This field is mandatory.
ar: هذا الحقل إلزامي.
it: Questo campo è obbligatorio.

# validation.error.1238087674
source: You must enter a valid date.
ar: يجب عليك إدخال قيمة صحيحة.
it: Devi inserire una data valida.

# validation.error.1221551320
source: You can only enter letters or digits.
ar: يمكنك فقط إدخال الأحرف أو الأرقام.
it: Puoi inserire solo lettere o numeri.

# validation.error.1221565786
source: You can only enter non formatted text without any markup (e.g without XML tags).
ar: يمكنك فقط إدخال نص غير مُنسّق دون أي علامة (على سبيل المثال دون علامات XML).
it: Puoi inserire solo testo non formattato senza alcun marcatore (es. senza tag XML).

# validation.error.1238110957
source: You can only enter non formatted text without any markup (e.g without XML tags).
ar: يمكنك فقط إدخال نص غير مُنسّق دون أي علامة (على سبيل المثال دون علامات XML).
it: Puoi inserire solo testo non formattato senza alcun marcatore (es. senza tag XML).

# validation.error.1269883975
source: You can only enter non formatted text without any markup (e.g without XML tags).
ar: يمكنك فقط إدخال نص غير مُنسّق دون أي علامة (على سبيل المثال دون علامات XML).
it: Puoi inserire solo testo non formattato senza alcun marcatore (es. senza tag XML).

# validation.error.1428504122
source: Your text must be a minimum of %s characters in length and no longer than %s.
ar: يجب أن يكون النص الخاص بك مُكوّناً على الأقل من %s حرفاً وألا يزيد عن %s حرف.
it: Il testo deve avere un minimo di %s caratteri di lunghezza e non più di %s.

# validation.error.1238108068
source: You must enter text which is longer than %s characters.
ar: يجب إدخال نص أطول من %s حرفاً.
it: Devi inserire un testo che sia più lungo di %s caratteri.

# validation.error.1238108069
source: You must enter text which is no longer than %s characters.
ar: يجب إدخال نص لا يتجاوز %s حرفاً.
it: Devi inserire un testo che non sia più lungo di %s caratteri.

# validation.error.1221559976
source: You must enter a valid email address.
ar: يجب إدخال عنوان بريد إلكتروني صحيح.
it: Devi inserire un indirizzo email valido.

# validation.error.1221560494
source: You must enter a valid number.
ar: يجب إدخال رقم صحيح.
it: Devi inserire un numero valido.

# validation.error.1221560288
source: You must enter a valid floating point number.
ar: يجب إدخال رقم نقطة عائمة صحيح.
it: Devi inserire un numero decimale valido.

# validation.error.1221563685
source: You must enter a valid number.
ar: يجب إدخال رقم صحيح.
it: Devi inserire un numero valido.

# validation.error.1221561046
source: You must enter a valid number between %s and %s.
ar: يجب إدخال رقم صحيح بين %s و %s.
it: Devi inserire un numero tra %s e %s.

# validation.error.1221565130
source: You must enter a valid value. Please refer to the description of this field.
ar: يجب إدخال قيمة صحيحة. الرجاء الرجوع إلى وصف هذا الحقل.
it: Devi inserire un valore valido. Fai riferimento alla descrizione di questo campo.

# validation.error.1475002976
source: You must enter a countable subject.
ar: يجب إدخال مادة قابلة للعد.
it: Devi inserire un valore numerabile.

# validation.error.1475002994
source: You must select between %s to %s elements.
ar: يجب تحديد ما بين %s إلى %s عناصر.
it: Devi selezionare da %s a %s elementi.

# validation.error.1471708997
source: You must enter an instance of \TYPO3\CMS\Extbase\Domain\Model\FileReference or \TYPO3\CMS\Core\Resource\File.
ar: يجب إدخال مَثِيلْ من \TYPO3\CMS\Extbase\domain\Model\FileReference أو \TYPO3\CMS\Core\Resource\file.
it: Devi inserire un'istanza di \TYPO3\CMS\Extbase\Domain\Model\FileReference o \TYPO3\CMS\Core\Resource\File.

# validation.error.1471708998
source: You entered an incorrect media type, "%s" is not allowed for this file. Please refer to the description of this field.
ar: لقد أدخلت نوع وسائط غير صحيح، غير مسموح لهذا المِلَفّ "%s". الرجاء الرجوع إلى وصف هذا الحقل.
it: Hai inserito un tipo di risorsa multimediale non corretta, "%s" non è consentito per questo file. Fai riferimento alla descrizione di questo campo.

# validation.error.1613126216
source: The file extension provided "%s" does not match to expected media types. Please refer to the description of this field.
ar: ملف الإضافة المُقدّم "%s" لا يتطابق مع أنواع الوسائط المُتوَقّعة. يرجى الرجوع إلى وصف هذا الحقل.
it: L'estensione di file "%s" non corrisponde ai tipi di risorsa multimediale previsti. Fai riferimento alla descrizione di questo campo.

# validation.error.1476396435
source: You must NOT fill this field.
ar: يجب عدم ملء هذا الحقل.
it: NON devi compilare questo campo.

# validation.error.1505303626
source: You must enter an instance of \TYPO3\CMS\Extbase\Domain\Model\FileReference or \TYPO3\CMS\Core\Resource\File.
ar: يجب إدخال مَثِيلْ لـ \TYPO3\CMS\Extbase\Domain\Model\FileReference أو \TYPO3\CMS\Core\Resource\File.
it: Devi inserire un'istanza di \TYPO3\CMS\Extbase\Domain\Model\FileReference o \TYPO3\CMS\Core\Resource\File.

# validation.error.1505305752
source: You must select a file that is larger than %s in size.
ar: يجب تحديد مِلَفّ أكبر من %s في الحجم.
it: Devi selezionare un file più grande di %s.

# validation.error.1505305753
source: You must select a file that is no larger than %s.
ar: يجب تحديد مِلَفّ لا يزيد حجمه عن %s.
it: Devi selezionare un file non più grande di %s.

# validation.error.1521293685
source: You must enter an instance of \DateTime.
ar: يجب إدخال مثيل لـ \DateTime.
it: Devi inserire un'istanza di tipo \DateTime.

# validation.error.1521293686
source: You must select a date before %s.
ar: يجب تحديد تاريخ قبل %s.
it: Devi selezionare una data antecedente al %s.

# validation.error.1521293687
source: You must select a date after %s.
ar: يجب تحديد تاريخ بعد %s.
it: Devi selezionare una data successiva al %s.

# validation.error.1556283177
source: Password does not match confirmation
ar: كلمة المرور لا تتطابق مع التأكيد
it: La password non coincide con la conferma

# form_new_wizard_title
source: Form
ar: النموذج

# form_new_wizard_description
source: A form that allows website users to submit messages.
ar: نموذج يسمح لًمُستخدِمي الموقع بإرسال الرسائل.
it: Una form precedentemente creata tramite il modulo Web>Form.

# upload.error.150530345
source: Maximum file size exceeded.
ar: تم تجاوز الحجم الأقصى للملف.
it: Dimensione massima del file superata.

# upload.error.150530346
source: Upload failed. The file was only partially uploaded, please try again.
ar: فشل التحميل. تم تحميل المِلَفّ جُزئياً فقط، الرجاء المحاولة مرة أخرى.
it: Il caricamento è fallito. Il file è stato caricato solo parzialmente, riprova.

# upload.error.150530347
source: No file was uploaded.
ar: لم يتم تحميل أي ملف.
it: Nessun file è stato caricato.

# upload.error.150530348
source: Upload failed.
ar: فشل التحميل.
it: Caricamento fallito.

# form.configuration.module.provider
source: Form: YAML Configuration
ar: نموذج: تكوين YAML
it: Form: Configurazione YAML

# pagination.previous
source: Previous
ar: السّابق
it: Precedente

# pagination.next
source: Next
ar: التّالي
it: Successivo

# pagination.first
source: First
ar: الأوّل
it: Primo

# pagination.last
source: Last
ar: الأخير
it: Ultimo

# pagination.forms
source: Forms
ar: النماذج
it: Form

# pagination.page
source: Page
ar: الصفحة
it: Pagina

# pagination.refresh
source: Refresh
ar: تحديث
it: Aggiorna
