Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/form/Resources/Private/Language/*.locallang_formManager_javascript.xlf
Languages: ar

# formManager.form_name
source: Name
ar: الاسم

# formManager.form_name_description
source: Enter a meaningful and descriptive name for the form. The name is displayed only in the TYPO3 backend.
ar: أدخل اسماً ذا معنى يَصف لنموذج. سيتم عرض الاسم فقط في الواجهة الخلفية لـ TYPO3.

# formManager.new_form_name
source: New form name
ar: اسم ملف جديد

# formManager.form_save_path
source: Storage
ar: التخزين

# formManager.form_save_path_description
source: Select the storage where you want to save your form definition.
ar: حدد وحدة التخزين حيث تريد حفظ النموذج الخاص بك.

# formManager.form_prototype
source: Form prototype
ar: النموذج الأولي

# formManager.form_template
source: Template
ar: القالب

# formManager.form_template_description
source: Select a template on which you want to build your new form.
ar: حدد القالب الذي تريد بناء النموذج الجديد الخاص بك عليه.

# formManager.form_headline_general
source: General
ar: عام

# formManager.form_copied
source: Copied form
ar: النموذج المنسوخ

# formManager.cancel
source: Cancel
ar: إلغاء

# formManager.remove_form
source: Delete
ar: حذف

# formManager.remove_form_title
source: Confirm deletion
ar: تأكيد الحذف

# formManager.remove_form_message
source: Do you really want to delete the form "{0}" permanently? You cannot revert this action!
ar: هل تريد حقاً حذف النموذج "{0}" نهائيّاً؟ لا يمكنك التراجع عن هذا الإجراء!

# formManager.newFormWizard.step1.title
source: Create new form
ar: إنشاء نموذج جديد

# formManager.newFormWizard.step1.progressLabel
source: Choose
ar: -- اختر --

# formManager.newFormWizard.step1.noStorages
source: No accessible form storage folders
ar: لا يمكن الوصول إلى مجلدات تخزين النموذج

# formManager.newFormWizard.step2.title
source: Settings
ar: الإعدادات

# formManager.newFormWizard.step3.title
source: Ready?
ar: مُستعد؟

# formManager.newFormWizard.step3.progressLabel
source: Check
ar: تحقق

# formManager.newFormWizard.step3.message
source: Just check and confirm the settings you have entered. Done? Then you are ready to go.
ar: تحقق وتأكّد من الإعدادات التي أدخلتها. تم؟ إذاً أنت على استعداد للمضي قُدُماً.

# formManager.newFormWizard.step3.check
source: Check and confirm
ar: تحقق وتأكّد

# formManager.newFormWizard.step4.errorTitle
source: Create
ar: إنشاء

# formManager.newFormWizard.step4.errorMessage
source: The form could not be saved
ar: تَعذّر حفظ النموذج

# formManager.duplicateFormWizard.step1.title
source: Duplicate form "{0}"
ar: تكرار النموذج {0}

# formManager.duplicateFormWizard.step2.title
source: Ready?
ar: مُستعد؟

# formManager.duplicateFormWizard.step2.progressLabel
source: Check
ar: تحقق

# formManager.duplicateFormWizard.step2.check
source: Check and confirm
ar: تحقق وتأكّد

# formManager.duplicateFormWizard.step2.message
source: Just check and confirm the settings you have entered. Done? Then you are ready to go.
ar: تحقق وتأكّد من الإعدادات التي أدخلتها. تم؟ إذاً أنت على استعداد للمضي قُدُماً.

# formManager.duplicateFormWizard.step3.errorTitle
source: Duplicate
ar: إنشاء نسخة جديدة

# formManager.duplicateFormWizard.step3.errorMessage
source: The form could not be saved
ar: تَعذّر حفظ النموذج

# formManager.no_references
source: There are no references yet.
ar: لا توجد مَرَاجِع حتى الآن.

# formManager.table.field.control
source: Control
ar: التحكّم

# formManager.table.field.uid
source: Uid
ar: مُعرّف المُستخدم Uid

# formManager.table.field.title
source: Title
ar: العنوان

# formManager.btn.edit.title
source: Edit
ar: تعديل

# formManager.references.title
source: Form: {0}
ar: النموذج: {0}

# formManager.references.headline
source: References to this item
ar: المَرَاجع لهذا العنصر

# formManager.blankForm.label
source: Blank form
ar: نموذج فارغ

# formManager.blankForm.subtitle
source: Start fresh
ar: بداية جديدة

# formManager.blankForm.description
source: Create a new form from scratch.
ar: إنشاء نموذج جديد من الصفر.

# formManager.predefinedForm.label
source: Predefined form
ar: نموذج مُحدد مُسبقاً

# formManager.predefinedForm.subtitle
source: Use a form template
ar: استخدام قالب نموذج

# formManager.predefinedForm.description
source: Create a new form and use an existing form template for it.
ar: إنشاء نموذج جديد واستخدام قالب نموذج موجود له.
