Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/lowlevel/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# module.configuration.title
source: Configuration
ar: التكوين
it: Configurazione

# module.configuration.shortDescription
source: View configuration from localconf.php and tables.php
ar: عرض التكوين من localconf.php و tables.php
it: Visualizza la configurazione dai localconf.php e tables.php

# module.configuration.description
source: Allows you to browse the values of the $TCA array (table configuration) and $TYPO3_CONF_VARS. You cannot set any values, only browse them.
ar: يُتيح لك تصفّح قيم مصفوفة $TCA (تكوين الجدول) و$TYPO3_CONF_VARS. لا يمكنك تعيين أية قيم، فقط قم بتصفُحِها.
it: Consente di esplorare i valori dell'array $TCA (Array di configurazione tabelle) e $TYPO3_CONF_VARS (Configurazione globale). Non è possibile impostare alcun valore, solo sfogliarli.

# module.configuration.numberOfSearchMatches
source: %s search match(es)
ar: %s تطابق البحث(es)
it: %s di corrispondenze nella ricerca

# moduleMenu.dropdown.label
source: Configuration to show
ar: التكوين للعَرض
it: Configurazione da mostrare

# configuration.headline
source: Configuration of "%1s"
ar: التكوين الخاص بـ "%1s"
it: Configurazione di "%1s"

# typo3ConfVars
source: $GLOBALS['TYPO3_CONF_VARS'] (Global Configuration)
ar: $GLOBALS['TYPO3_CONF_VARS'] (التكوين العام)
it: $GLOBALS['TYPO3_CONF_VARS'] (Configurazione globale)

# tca
source: $GLOBALS['TCA'] (Table configuration array)
ar: $GLOBALS['TCA'] (مجموعة تكوين الجدول)
it: $GLOBALS['TCA'] (Array di configurazione tabelle)

# beUser
source: $GLOBALS['BE_USER']->uc (User Settings)
ar: $GLOBALS['BE_USER']->uc (إعدادات المُستخدم)
it: $GLOBALS['BE_USER']->uc (Impostazioni Utente)

# usersettings
source: $GLOBALS['TYPO3_USER_SETTINGS'] (User Settings Configuration)
ar: $GLOBALS['TYPO3_USER_SETTINGS'] (تكوين إعدادات المستخدم)
it: $GLOBALS['TYPO3_USER_SETTINGS'] (Configurazione Impostazioni Utente)

# routes
source: Backend Routes
ar: طُرق الواجهة الخلفية
it: Instradamenti di Backend

source: Content Security Policy Mutations
ar: تغييرات سياسة أمان المحتوى
it: Mutazioni nella Politica di Sicurezza Contenuti

source: Sites: TCA configuration
ar: الصفحات: تكوين TCA
it: Siti: configurazione TCA

source: Sites: YAML configuration
ar: الصفحات: تكوين YAML
it: Siti: configurazione YAML

source: MFA providers
ar: مُوَفِري MFA
it: Provider MFA

source: Soft Reference Parsers
ar: مُوزعِي المراجع المرنة
it: Parser Riferimento Blando

# toolbarItems
source: Backend Toolbar Items
ar: عناصر شريط أدوات الواجهة الخلفية
it: Elementi Barra del Backend

# symfonyExpressionLanguage
source: Symfony Expression Language Providers
ar: مُزودي لغة Symfony Expression

source: Doctrine DBAL Driver Middlewares
ar: المكونات الوَسِيطَة لمُحرّك تعاليم الـ DBAL
it: Software di Supporto per il Driver DBAL (Livello di Astrazione del Database) di Doctrine

source: Form: YAML Configuration
ar: نموذج: تكوين YAML
it: Form: Configurazione YAML

# t3services
source: $GLOBALS['T3_SERVICES'] (Registered Services)
ar: $GLOBALS['T3_SERVICES'] (الخِدْمَات المُسجلة)
it: $GLOBALS['T3_SERVICES'] (Servizi Registrati)

source: Backend Modules
ar: وحدات الواجهة الخلفية
it: Moduli Backend

# pagesTypes
source: Table permissions per page type
ar: جدول الأُذُونات لكل نوع صفحة
it: Permessi tabella per tipo pagina

# module.dbint.title
source: DB Check
ar: فحص DB
it: Verifica DB

# module.dbint.shortDescription
source: Database integrity check
ar: التحقق من سلامة قاعدة البيانات
it: Controllo integrità database

# module.dbint.description
source: Here you can check the integrity of the database tables configured by the $TCA. For instance all records must belong to a page record. You can also get a view of the total pagetree including deleted pages. Finally you've got access to a global database search facility.
ar: هنا يمكنك التحقق من سلامة جداول قاعدة البيانات التي تم تكوينها بواسطة $TCA. على سبيل المثال، يجب أن تنتمي جميع السجلات إلى سجل الصفحة. يمكنك أيضاً الحصول على عرض لشجرة الصفحات الإجمالية بما في ذلك الصفحات المحذوفة. وأخيراً، أصبح بإمكانك الوصول إلى أداة البحث في قاعدة البيانات العالمية.
it: Permette di controllare l'integrità delle tabelle del database configurate dal $TCA. Per esempio, tutti i record devono appartenere a un record di pagina. È anche possibile ottenere una visualizzazione completa dell'Albero delle Pagine, incluse le pagine cancellate. Infine, consente l'accesso ad una funzionalità di ricerca globale sul database.

# module.dbint.docheader.viewmode
source: Module action
ar: إجراء الوحدة
it: Azione modulo

# search.submit
source: Search All Records
ar: البحث في جميع السجلات
it: Cerca in Tutti i Record

source: Search
ar: البحث
it: Cerca

source: Record Statistics
ar: إحصائيات السجل
it: Statistiche dei Record

source: Total Page Tree
ar: إجمالي شجرة الصفحة
it: Albero delle Pagine Complessivo

source: Database Relations
ar: علاقات قواعد البيانات
it: Relazioni Database

source: Full search
ar: البحث الكامل
it: Ricerca nel Database

source: Find filename
ar: البحث عن اسم الملف
it: Trova nome file

# manageRefIndex
source: Manage Reference Index
ar: إدارة الفهرس المرجعي
it: Gestisci Indice dei Riferimenti

# rawSearch
source: Raw search in all fields
ar: بحث أَوَّلِيّ في جميع الحقول
it: Ricerca in tutti i campi

source: Advanced query
ar: استعلام مُتقدم
it: Ricerca avanzata

source: Select records
ar: تحديد السجلات
it: Seleziona record

source: Count results
ar: عد النتائج
it: Conteggio risultati

source: Explain query
ar: شرح الاستعلام
it: Illustra la ricerca

source: CSV Export
ar: تصدير CSV
it: Esporta CSV

source: XML Export
ar: تصدير XML
it: Esporta XML

# clickToUpdateRefIndex
source: Click here to update reference index
ar: انقر هنا لتحديث الفِهْرِس المَرجِعي
it: Clicca qui per aggiornare l'indice dei riferimenti

source: Update now!
ar: التحديث الآن!
it: Aggiorna ora!

# clickToTestRefIndex
source: Click here to test reference index
ar: انقر هنا لاختبار الفِهْرِس المَرجِعي
it: Clicca qui per verificare l'indice dei riferimenti

# referenceIndex_description
source: TYPO3's reference index keeps track of the relations between records. As it can happen that the reference index contains outdated values, you can check and update it here.
ar: يتتبع المُؤشر المَرجعي لـ TYPO3 العلاقات بين السجلات. نظراً لأنه من الممكن أن يحتوي الفِهْرِس المرجعي على قيم قديمة، يمكنك التحقق من ذلك وتحديثه هنا.
it: L'indice dei riferimenti di TYPO3 tiene traccia delle relazioni tra record e file. Poiché può accadere che l'indice di riferimento contenga valori obsoleti, è possibile controllarlo e aggiornarlo qui.

# referenceIndex_buttonUpdate
source: Update reference index
ar: تحديث فهرس المرجع
it: Aggiorna indice dei riferimenti

# referenceIndex_buttonCheck
source: Check reference index
ar: فحص الفِهْرِس المرجعي
it: Controlla indice dei riferimenti

source: Check now!
ar: التحقق الآن!
it: Controlla ora!

# checkScript_headline
source: Using the command line interface
ar: استخدام واجهة سطر الأوامر
it: Utilizzo della riga di comando

# checkScript
source: You can also run the check as a shell script using CLI if the processing takes longer than the PHP max_execution_time allows.
ar: يمكنك أيضاً تشغيل هذا الفحص shell script باستخدام CLI إذا كانت المعالجة تستغرق وقتاً أطول مما يسمح به PHP max_execution_times.
it: È inoltre possibile effettuare il controllo eseguendo lo script da shell, utilizzando PHP CLI, se l'elaborazione richiede più tempo di quanto la direttiva PHP, max_execution_time, consenta.

# checkScript_check_description
source: To check the reference index use:
ar: للتحقق من الفِهْرِس المرجِعي استخدم:
it: Per controllare l'indice dei riferimenti usa:

# checkScript_update_description
source: To update the reference index use:
ar: لتحديث الفِهْرِس المرجِعي استخدم:
it: Per aggiornare l'indice dei riferimenti usa:

# checkScript_moreDetails
source: For more details see:
ar: لمزيد من التفاصيل، انظر:
it: Per maggiori dettagli vedi:

# updateRefIndex
source: Update reference index
ar: تحديث فهرس المرجع
it: Aggiorna indice dei riferimenti

# fullSearch.flashMessage.noResultsFoundMessage
source: The query returned no results.
ar: لم يُسفر الاستعلام عن أي نتائج.
it: La ricerca non ha prodotto risultati.

# fullSearch.section.queryOptions
source: Query options
ar: خيارات الاستعلام
it: Opzioni di ricerca

# fullSearch.section.querySQL
source: Full SQL query
ar: استعلام SQL الكامل
it: Codice SQL completo

# fullSearch.section.querySQL.error
source: SQL error
ar: خطأ SQL
it: Errore SQL

# fullSearch.section.querySettings
source: Query compilation
ar: تجميع الاستعلام
it: Definizione della ricerca

# fullSearch.section.queryStorage
source: Load/save query
ar: تحميل/حفظ الاستعلام
it: Carica/Salva ricerca

# fullSearch.section.result
source: Result
ar: النتيجة
it: Risultato

# fullSearch.type.count.resultsFound
source: records found.
ar: تم العثور على سجلات.
it: record trovati.

# fullSearch.type.all.noResultsFound
source: No records found.
ar: لم يتم العثور على سجلات.
it: Nessun record trovato.

# fullSearch.form.btn.delete.label
source: Delete
ar: حذف
it: Elimina

# fullSearch.form.btn.load.label
source: Load
ar: تحميل
it: Carica

# fullSearch.form.btn.save.label
source: Save
ar: حفظ
it: Salva

# fullSearch.form.field.groupBy.label
source: Group by
ar: تجميع حسب
it: Raggruppa per

# fullSearch.form.field.limit.label
source: Limit
ar: محدود
it: Limite

# fullSearch.form.field.makeQuery.label
source: Result type
ar: نوع النتيجة
it: Tipo di risultato

# fullSearch.form.field.orderBy.label
source: Order by
ar: الترتيب حسب
it: Ordina per

# fullSearch.form.field.orderBy.descending
source: Descending
ar: تنازليً
it: Decrescente

# fullSearch.form.field.searchType.label
source: Search type
ar: نوع البحث
it: Tipo di ricerca

# fullSearch.form.field.query.label
source: Query
ar: الاستعلام
it: Condizioni

# fullSearch.form.field.queryFields.label
source: Fields
ar: الحقول
it: Campi

# fullSearch.form.field.queryTable.label
source: Table
ar: الجدول
it: Tabella

# fullSearch.form.field.queryStore.storage.label
source: Saved queries
ar: الاستعلامات المحفوظة
it: Ricerche salvate

# fullSearch.form.field.queryStore.storage.0
source: [New]
ar: [جديد]
it: [Nuovo]

# fullSearch.form.field.queryStore.title.label
source: Title
ar: العنوان
it: Titolo

# showSQL
source: Show SQL parts
ar: إظهار أجزاء SQL
it: Mostra SQL delle condizioni

# useFormattedStrings
source: Use formatted strings, labels and dates instead of original values for results
ar: استخدام المقاطع المُنسّقَة والمُسميات والتواريخ بدلاً من القيم الأصلية للنتائج
it: Formatta i risultati, anziché usare i valori grezzi nel database

# dontUseOrigValues
source: Don't use original values in brackets as prefix for labelled results
ar: لا تستخدم القيم الأصلية بين قوسين كبداية للنتائج المَوصُوفَة
it: Non usare i valori originali tra parentesi come prefisso per i risultati etichettati

# sortOptions
source: Sort selectbox-options for relations by label and not by value
ar: فرز خيارات مربع التحديد للعلاقات حسب التسمية وليس حسب القيمة
it: Ordina le opzioni di selezione per le relazioni per etichetta e non per valore

# showDeleted
source: Show even deleted entries (with undelete buttons)
ar: إظهار حتى المُدخلات المحذوفة (مع أزرار إلغاء الحذف)
it: Mostra anche le voci eliminate (con i bottoni di ripristino)

source: Result
ar: النتيجة
it: Risultato

# no_results
source: No results found for "%s".
ar: لم يتم العثور على نتائج لـ "%s".
it: Nessun risultato trovato per "%s".

# no_sword
source: Enter a search term to search for records
ar: أدخل مصطلح بحث للبحث عن السجلات
it: Inserisci un termine di ricerca per cercare i record

source: Tables
ar: الجداول
it: Tabelle

source: references
ar: المراجع
it: riferimenti

source: is missing!
ar: إنه مفقود!
it: manca!

source: Referenced from
ar: مُشار إليه من
it: Referenziato da

source: Enter regex pattern
ar: أدخل نمط التعبير العادي
it: Inserisci espressione regolare

# searchButton
source: Search
ar: البحث
it: Cerca

source: Pattern
ar: النمط

source: being checked...
ar: يتم التحقق...
it: in fase di controllo...

# directoriesTooDeep
source: ERROR: Directories deeper than the following number of levels
ar: خطأ: الدلائل أعمق من عدد المستويات التالية
it: ERRORE: cartelle più profonde del seguente numero di livelli

source: Files
ar: الملفات
it: File

source: Matching files
ar: الملفات المُطابقة
it: File corrispondenti

source: not checked.
ar: لم يتم التحقق.
it: non controllato.

source: Searching for filenames
ar: البحث عن أسماء الملفات
it: Cerca per nome file

# fixLostRecord
source: Click to move this lost record to rootlevel (pid=0)
ar: انقر لنقل هذا السجل المفقود إلى مستوى الجذر (pid=0)
it: Clicca per spostare questo record perso nel rootlevel (pid=0)

# doktype
source: Document types
ar: نوع المستند
it: Tipi di documento

# doktype_value
source: Document types (value)
ar: أنواع المستند (قيمة)
it: Tipi di documento (identificativo di sistema)

source: Pages
ar: الصفحات
it: Pagine

# total_pages
source: Total number of default language pages
ar: العدد الإجمالي لصفحات اللغة الافتراضية
it: Numero totale di pagine in lingua predefinita

# translated_pages
source: Total number of translated pages
ar: العدد الإجمالي للصفحات المُترجمة
it: Numero totale di pagine tradotte

# deleted_pages
source: Marked-deleted pages
ar: الصفحات المُحددة المَحذوفة
it: Pagine marcate com eliminate

source: Hidden pages
ar: الصفحات المَخفِية
it: Pagine nascoste

source: Count
ar: العدّ
it: Conteggio

source: Label
ar: التسمية
it: Etichetta

source: Table name
ar: اسم الجدول
it: Nome tabella

# total_lost
source: Records total / lost
ar: السجلات المجموع / المفقود
it: Record totali / persi

source: Relations
ar: العلاقات
it: Relazioni Database

# relations_description
source: The module gives some overview of missing relations in fields of the TCA types 'select' and 'group'.
ar: تقدم الوحدة نَظْرَة عامة على العلاقات المفقودة في حقول TCA من نوع "select" و "group".
it: Il modulo fornisce una panoramica delle relazioni mancanti, nei campi TCA, di tipo 'select' e 'group'.

# relations_noRecordsFound
source: No records found.
ar: لم يتم العثور على سجلات.
it: Nessun record trovato.

# select_db
source: Select fields
ar: تحديد الحقول
it: Campi 'select'

# group_db
source: Group fields
ar: حقول المجموعة
it: Campi 'group'

# tree
source: The Page Tree
ar: شجرة الصفحة
it: L'Albero della Pagine

# tree_description
source: This shows all pages in the system in one large tree. Beware that this will probably result in a very long document which will also take some time for the server to compute!
ar: هذا يعرض جميع الصفحات في النظام في شجرة واحدة كبيرة. احذر من أن هذا سيؤدي على الأرجح إلى إنشاء مستند طويل جداً، والذي سيستغرق أيضاً بعض الوقت حتى يقوم الخادم بحسابه!
it: Questo mostra tutte le pagine del sistema in un grande albero. Attenzione che questo probabilmente si tradurrà in un documento molto lungo che richiederà anche tempo computazionale per il server!

# records
source: Records Statistics
ar: إحصائيات السجلات
it: Statistiche dei Record

# records_description
source: This shows some statistics for the records in the database. This runs through the entire page-tree and therefore it will also load the server heavily!
ar: هذا يظهر بعض الإحصائيات للسجلات في قاعدة البيانات. يتم تشغيل هذا عبر شجرة الصفحة بأكملها، وبالتالي فإنه سيتم تحميل الخادم بثقل!
it: Questo mostra alcune statistiche per i record nel database. Naviga attraverso l'intero albero delle pagine e quindi caricherà pesantemente il server!

source: Search whole Database
ar: البحث في قاعدة البيانات بأكملها
it: Cerca nel database

# search_description
source: This searches through all database tables and records for a text string.
ar: يقوم هذا بالبحث في جميع جداول وسجلات قاعدة البيانات عن كلمة نَصيّة.
it: Ricerca in tutte le tabelle del database e record per una stringa di testo.

# refindex
source: Check and update global reference index
ar: فحص وتحديث الفِهْرِس المرجعي العام
it: Controlla e aggiorna globalmente l'indice dei riferimenti

# refindex_description
source: Allows you to maintain the reference index kept by TYPO3.
ar: يسمح لك بالحفاظ على الفِهْرِس المرجعي الذي يحتفظ به TYPO3.
it: Permette di mantenere l'indice dei riferimenti di TYPO3.

# refindex_ok
source: Index integrity was perfect!
ar: كانت سلامة الفِهْرِس مثالية!
it: L'integrità dell'indice è perfetta!

# beUserTsConfig
source: $GLOBALS['BE_USER']->getTSConfig() (User TSconfig)
it: $GLOBALS['BE_USER']->getTSConfig() (TSconfig Utente)

# directories
source: Dirs
it: Cartelle
