Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/tstemplate/Resources/Private/Language/*.locallang_info.xlf
Languages: ar, it

# submodule.title
source: Edit TypoScript record
ar: تعديل سجل TypoScript
it: Modifica record TypoScript

# submodule.titleWithRecord
source: Edit TypoScript record "%s"
ar: تعديل سجل TypoScript "%s"
it: Modifica il record TypoScript "%s"

# submodule.description
source: Modify the content of the selected TypoScript record of the current page. Modifications can be made either for configurations like TypoScript constants and setup or basics like the title and description of the TypoScript record itself.
ar: قم بتعديل محتوى سجل TypoScript المحدد للصفحة الحالية. يمكن إجراء التعديلات إما للتكوينات مثل ثوابت TypoScript والإعداد أو الأساسيات مثل عنوان ووصف سجل TypoScript نفسه.
it: Modifica il contenuto del record TypoScript selezionato della pagina corrente. Le modifiche possono essere apportate per costanti/configurazione o per cose semplici come il titolo e la descrizione del record TypoScript stesso.

# options.selectedRecord
source: Selected record
ar: السجل المُحدد
it: Record selezionato

# table.column.constants
source: Constants
ar: الثوابت
it: Costanti

# table.column.description
source: Description
ar: الوَصف
it: Descrizione

# table.column.lines
source: %s lines
ar: أسطر %s
it: %s righe

# table.column.setup
source: Setup
ar: الإعداد
it: Configurazione

# table.column.title
source: Title
ar: العنوان
it: Titolo

# btn.editTypoScriptRecord
source: Edit the whole TypoScript record
ar: قم بتعديل سجل TypoScript بالكامل
it: Modifica tutto il record TypoScript

# infoTypoScriptRecordFromSite.title
source: Includes via site sets
ar: يشمل عن طريق مجموعات الموقع
it: Include via Corredi del sito

# infoTypoScriptRecordFromSite.message
source: The site configuration '%s' has one or more dependencies on site sets. The TypoScript definitions can be edited on the file system.
ar: تكوين الموقع '%s' له تَبَعيّة واحدة أو أكثر على مجموعات الموقع. تعاريف TypoScript يمكن تعديلها على نظام الملفات.
it: La configurazione del sito '%s' ha una o pi√π dipendenze dai corredi dei siti. Le definizioni TypoScript possono essere modificate sul file system.
