Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/tstemplate/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# module.typoscript.shortDescription
source: TypoScript tools
ar: أدوات TypoScript
it: Strumenti TypoScript

# module.typoscript.description
source: Here you manage the TypoScript records which are in charge of the look of your website on the frontend. The module provides specialized features like a TypoScript tree, a constant editor and raw editing facilities.
ar: يمكنك هنا إدارة قوالب TypoScript المسؤولة عن مظهر موقع الويب الخاص بك في الواجهة الأمامية. توفر هذه الوُحدة ميزات متخصصة مثل شجرة TypoScript، ومحرر الثوابت، وإمكانية التحرير النصّي.
it: Gestione dei Template TypoScript che sono responsabili dell'aspetto del sito web nel frontend. Il modulo fornisce funzionalità specializzate come un navigatore per oggetti, un editor Costanti e la modifica a basso livello.

# submodules.option.constantEditor
source: Constant Editor
ar: مُحرّر الثوابت
it: Editor Costanti

# submodules.option.infoModify
source: Edit TypoScript Record
ar: تعديل سجل TypoScript
it: Modifica Record TypoScript

# submodules.option.active
source: Active TypoScript
ar: تفعيل TypoScript
it: TypoScript attivo

# submodules.option.templateAnalyzer
source: Included TypoScript
ar: الـ TypoScript المُضمّن
it: TypoScript incluso

# submodules.option.templateRecordsOverview
source: TypoScript Records Overview
ar: نظرة عامّة على سجلات TypoScript
it: Panoramica dei Record TypoScript

# noRecordFound.infobox.title
source: No TypoScript record on the current page
ar: لا يوجد سجل TypoScript في الصفحة الحالية
it: Nessun record TypoScript nella pagina corrente

# noRecordFound.infobox.message
source: You need to create a TypoScript record in order to edit your configuration.
ar: يجب عليك إنشاء سجل TypoScript من أجل تعديل الإعدادات الخاصة بك.
it: È necessario creare un record TypoScript per impostare la tua configurazione.

# noRecordFound.goToClosestRecord.description
source: The closest TypoScript record is located on page '%s' (uid %s).
ar: أقرب سجل TypoScript موجود في الصفحة '%s'(uid %s).
it: Il record TypoScript più vicino si trova alla pagina '%s' (uid %s).

# noRecordFound.goToClosestRecord.link.title
source: Select this TypoScript record
ar: اختر سجل TypoScript هذا
it: Seleziona questo record TypoScript

# noRecordFound.createRootTypoScriptRecord.headline
source: Root TypoScript record
ar: سجل TypoScript الجذر
it: Record TypoScript di Root

# noRecordFound.createRootTypoScriptRecord.description
source: Choose this option if you want this page to be the root of a new site.
ar: اختر هذا الخِيار إذا كنت ترغب في جعل هذه الصفحة جذراً لموقع جديد.
it: Scegli questa opzione se vuoi che questa pagina sia la radice di un nuovo sito.

# noRecordFound.createRootTypoScriptRecord.link.title
source: Create a root TypoScript record
ar: إنشاء سجل TypoScript للجَذر
it: Crea un record TypoScript di Root

# noRecordFound.createRootTypoScriptRecord.title.placeholder
source: NEW SITE
ar: صفحة جديدة
it: NUOVO SITO

# noRecordFound.createAdditionalTypoScriptRecord.headline
source: Additional TypoScript record
ar: سجل TypoScript إضافي
it: Record TypoScript aggiuntivo

# noRecordFound.createAdditionalTypoScriptRecord.description
source: An additional TypoScript record allows you to enter TypoScript values that will affect only this page and subpages.
ar: يتيح لك سجل TypoScript الإضافي إدخال قيم TypoScript التي ستؤثر فقط على هذه الصفحة والصفحات الفرعية.
it: Un record TypoScript aggiuntivo consente di inserire valori TypoScript che interesseranno solo questa pagina e sottopagine.

# noRecordFound.createAdditionalTypoScriptRecord.link.title
source: Create an additional TypoScript record
ar: إنشاء سجل TypoScript إضافي
it: Crea un record TypoScript aggiuntivo
