Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/tstemplate/Resources/Private/Language/*.locallang_analyzer.xlf
Languages: ar

# submodule.title
source: Included TypoScript
ar: الـ TypoScript المُضمّن

# submodule.titleWithRecord
source: Included TypoScript for record "%s"
ar: تضمين TypoScript للسجل "%s"

# submodule.description
source: Overview of the included TypoScript and include order for the current page.
ar: عرض عام لـ TypoScript المضمنة وإدراج ترتيب للصفحة الحالية.

# infobox.message.noTypoScriptFound
source: No TypoScript found.
ar: لم يتم العثور على TypoScript.

# options.selectedRecord
source: Selected record
ar: السجل المُحدد

# sectionHeadline.constants
source: Constants
ar: الثوابت

# sectionHeadline.setup
source: Setup
ar: الإعداد

# panel.header.syntaxErrors
source: Syntax scanner warnings
ar: تحذيرات ضابط الصيغة

# panel.header.conditions
source: Conditions
ar: الشروط

# panel.header.configuration
source: Configuration
ar: التكوين

# panel.info.syntaxErrorCount.single
source: %s syntax warning
ar: تحذير بناء الجملة %s

# panel.info.syntaxErrorCount.multiple
source: %s syntax warnings
ar: %s تحذيرات بناء الجملة

# panel.info.conditionActiveCount.multiple
source: %s active conditions
ar: %s من الشروط النَشِطَة

# panel.info.conditionActiveCount.single
source: %s active condition
ar: %s حالة نشطة

# panel.info.conditionWithConstant
source: Constant usage: [%s]
ar: الاستخدام الثابت: [%s]

# syntaxError.sourceCode
source: Show affected code snippet
ar: إظهار قُصاصات الكود البرمجي

# syntaxError.type.line.invalid
source: Invalid line in "%1$s", line number "%2$s"
ar: سطر غير صالح في "%1$s"، رقم السطر "%2$s"

# syntaxError.type.brace.excess
source: Brace in excess in "%1$s", line number "%2$s"
ar: الدعامة الزائدة في "%1$s"، سطر رقم "%2$s"

# syntaxError.type.brace.missing
source: Brace missing in "%1$s", line number "%2$s"
ar: الدعامة مفقودة في "%1$s"، سطر رَقَم "%2$s"

# syntaxError.type.import.empty
source: Import does not find a file in "%1$s", line number "%2$s"
ar: عملية الاستيراد لا تستطيع العثور على المِلَفّ في "%1$s"، رقم السطر "%2$s"

# tree.child.btn.sourceCode
source: Show code
ar: إظهار الكود

# tree.child.btn.sourceCodeWithResolvedIncludes
source: Show code including possible includes/imports
ar: إظهار الكود بما في ذلك includes/imports المحتملة

# tree.child.conditionVerdict.matched
source: Matched
ar: متطابق

# tree.child.conditionVerdict.notMatched
source: Not matched
ar: غير متطابق

# tree.child.setting.clear
source: Clear
ar: مسح

# tree.child.setting.root
source: Root
ar: الجذر

# tree.child.sysTemplateRecord
source: TypoScript record (page UID %s)
ar: سجل TypoScript (صفحة UID %s)

# tree.child.type.AtImport
source: Included via "@import"
ar: تم تضمينها عبر "@import"

# tree.child.type.Condition
source: Condition (then)
ar: الشرط (then)

# tree.child.type.ConditionElse
source: Condition (else)
ar: الشرط (else)

# tree.child.type.ConditionIncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT" (with condition)
ar: تم تضمينها عبر "INCLUDE_TYPOSCRIPT" (مع الشرط)

# tree.child.type.ConditionStop
source: Condition (end)
ar: الشرط (end)

# tree.child.type.DefaultTypoScript
source: Included via "$GLOBALS"
ar: تم تضمينها عبر "$GLOBALS"

# tree.child.type.DefaultTypoScriptMagicKey
source: Included via "$GLOBALS"
ar: تم تضمينها عبر "$GLOBALS"

# tree.child.type.DefaultTypoScriptMagicKey_formlabel
source: Default content rendering
ar: عرض المحتوى الافتراضي

# tree.child.type.ExtensionStatic
source: TypoScript set (loaded automatically)
ar: مجموعة TypoScript (يتم تحميلها تلقائياً)

# tree.child.type.File
source: Part of a TypoScript set
ar: جزء من مجموعة TypoScript

# tree.child.type.IncludeStaticFileDatabase
source: TypoScript set
ar: إعداد TypoScript

# tree.child.type.IncludeStaticFileFile
source: TypoScript set (included via file)
ar: مجموعة TypoScript (مضمنة عبر الملف)

# tree.child.type.IncludeTyposcript
source: Included via "INCLUDE_TYPOSCRIPT"
ar: تم تضمينها عبر "INCLUDE_TYPOSCRIPT"

# tree.child.type.Root
source: Root
ar: الجذر

# tree.child.type.Segment
source: Code segment
ar: جزء من الكود

# tree.child.type.Site
source: Site
ar: الموقع

# tree.child.type.SiteTemplate
source: Site configuration
ar: تكوين الموقع

# tree.child.type.SysTemplate
source: TypoScript record
ar: سجلات TypoScript
