Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/tstemplate/Resources/Private/Language/*.locallang_objbrowser.xlf
Languages: ar, it

# submodule.title
source: Active TypoScript
ar: تفعيل TypoScript
it: TypoScript attivo

# submodule.titleWithRecord
source: Active TypoScript for record "%s"
ar: تفعيل TypoScript للسجل "%s"
it: TypoScript attivo per il record "%s"

# submodule.description
source: Overview of the current TypoScript configuration of the system, divided into constants and setup parts. Optionally, the constant values can be displayed directly in the setup. A targeted search for values and TypoScript names is possible. The list of results can also be filtered according to TypoScript conditions.
ar: نَظْرَة عامة على تكوين TypoScript الحالي للنظام، مُقسمة إلى ثوابت وأجزاء إعداد. اختياريًا، يمكن عرض القيم الثابتة مباشرة في الإعداد. من الممكن إجراء بحث مستهدف عن القيم وأسماء TypoScript. يمكن أيضًا تصفية قائمة النتائج وفقًا لظروف TypoScript.
it: La panoramica dell'attuale configurazione TypoScript, divisa in costanti e configurazione. I valori delle costanti possono essere visualizzati direttamente nella configurazione. È possibile una ricerca mirata di valori e nomi TypoScript. L'elenco dei risultati può essere filtrato anche in base alle condizioni TypoScript.

# infobox.message.noTypoScriptFound
source: No TypoScript found.
ar: لم يتم العثور على TypoScript.
it: Nessun TypoScript trovato.

# options.displayComments
source: Display comments
ar: عرض التعليقات
it: Mostra i commenti

# options.displayConstantSubstitutions
source: Substitute constants in setup
ar: الثوابت البديلة في الإعدادات
it: Sostituire i valori delle costanti nella configurazione

# options.selectedRecord
source: Selected record
ar: السجل المُحدد
it: Record selezionato

# options.sortAlphabetically
source: Sort keys alphabetically
ar: فرز المفاتيح أبجديّاً
it: Ordina alfabeticamente

# sectionHeadline.constants
source: Constants
ar: الثوابت
it: Costanti

# sectionHeadline.setup
source: Setup
ar: الإعداد
it: Configurazione

# panel.header.conditions
source: Conditions
ar: الشروط
it: Condizioni

# panel.header.configuration
source: Configuration
ar: التكوين
it: Configurazione

# panel.info.conditionActiveCount
source: %s active condition(s)
ar: %s من الشروط النشيطة
it: %s condizioni attive

# panel.info.conditionWithConstant
source: Constant usage: [%s]
ar: الاستخدام الثابت: [%s]
it: Utilizzo costanti: [%s]

# tree.valueWithConstant
source: Constant usage: %s
ar: الاستخدام الثابت: %s
it: Utilizzo costanti: %s

# tree.comment
source: Comment:
ar: التعليق:
it: Commento:

# editAction.submodule.title
source: Edit single property
ar: تعديل خاصية واحدة
it: Modifica proprietà singola

# editAction.submodule.titleWithTemplate
source: Edit single property in TypoScript record "%s"
ar: تعديل خاصيّة واحدة في سجل TypoScript "%s"
it: Modifica singola proprietà nel record TypoScript "%s"

# editAction.infobox.title.noTypoScriptTemplateOnCurrentPage
source: No TypoScript record on the current page
ar: لا يوجد سجل TypoScript في الصفحة الحالية
it: Nessun record TypoScript nella pagina corrente

# editAction.infobox.message.noTypoScriptTemplateOnCurrentPage
source: You cannot edit properties and values if there is no current TypoScript record in which the configuration can be stored. Please create an extension TypoScript record in "Edit TypoScript Record" first.
ar: لا يمكنك تعديل الخصائص والقيم إذا لم يكن هناك سجل TypoScript الحالي حيث يمكن تخزين الإعدادات. الرجاء إنشاء إضافة سجل TypoScript في "تعديل سجل TypoScript" أولاً.
it: Non è possibile modificare proprietà e valori se non c'è alcun record TypoScript, in cui la configurazione può essere memorizzata. Si deve prima creare un record TypoScript in "Modifica Record TypoScript".

# editAction.addProperty.headline
source: Add or override child property
ar: إضافة أو تجاوز خاصية الفرع
it: Aggiungi o sovrascrivi la proprietà

# editAction.addProperty.btn
source: Add
ar: إضافة
it: Aggiungi

# editAction.editProperty.headline
source: Edit current value
ar: تعديل القيمة الحالية
it: Modifica il valore corrente

# editAction.editProperty.btn
source: Update
ar: تحديث
it: Aggiorna

# editAction.clearObject.headline
source: Clear the object
ar: مسح الكائن
it: Svuota l'oggetto

# editAction.clearObject.infotextWithProperty
source: Info: The object is cleared via the statement "%s >".
ar: معلومة: تم مسح الكائن من خلال البيان "%s >".
it: Info: l'oggetto viene cancellato tramite la statement "%s >".

# editAction.clearObject.btn
source: Clear now
ar: مسح الآن
it: Svuota ora

# updateAction.lineAdded
source: Line added to current TypoScript record
ar: تم إضافة السطر إلى سجل TypoScript الحالي
it: Riga aggiunta al record TypoScript corrente

# updateAction.lineNotAdded
source: No line added to current TypoScript record
ar: لم يتم إضافة السطر إلى سجل TypoScript الحالي
it: Nessuna riga aggiunta al record TypoScript corrente

# updateAction.noSpaces
source: You must enter a property with characters "a-z", "A-Z", "0-9", or ".". Dots will be quoted. No spaces or special chars.
ar: يجب إدخال خاصية تحتوي على الأحرف "a-z" أو "A-Z" أو "0-9" أو ".". سيتم اقتباس النُّقَط. لا مسافات أو أحرف خاصة.
it: Devi inserire una proprietà con caratteri "a-z", "A-Z", "0-9" o ".". I punti saranno racchiusi tra virgolette. Nessuno spazio o carattere speciale.
