Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/Wizards/*.move_page.xlf
Languages: ar, fr, it

# headline
source: Move page "%1$s" [%2$d]
ar: نقل الصفحة "%1$s" [%2$d]
fr: Déplacer la page « %1$s » [%2$d]
it: Sposta pagina "%1$s" [%2$d]

source: Current path
ar: المَسار الحالي
fr: Chemin actuel
it: Percorso corrente

# makeCopy
source: Copy page instead of moving page
ar: نسخ الصفحة بَدلاً من نقلها
fr: Copier la page au lieu de la déplacer
it: Copia la pagina invece di spostare la pagina

# samePageConflict
source: The page "%1$s" [%2$d] cannot get moved into itself.
ar: لا يُمكن نقل الصفحة "%1$s" [%2$d] إلى نفسها.
fr: La page « %1$s » [%2$d] ne peut être déplacée sur elle-même.
it: La pagina "%1$s" [%2$d] non può essere spostata in se stessa.

# action.pasteAbove
source: Paste above
ar: اللصق أعلاه
fr: Coller avant
it: Incolla sopra

# action.pasteBelow
source: Paste below
ar: اللصق أدناه
fr: Coller après
it: Incolla sotto

# action.pasteInto
source: Paste into
ar: لصق في داخل
fr: Coller dans
it: Incolla dentro

# movePage.notification.pageMoved.title
source: Page successfully moved
ar: تم نقل الصفحة بنجاح
fr: Page déplacée avec succès
it: Pagina spostata correttamente

# movePage.notification.pageMoved.message
source: The page "%s" has been successfully moved.
ar: تم نقل الصفحة "%s" بنجاح.
fr: La page « %s » a été déplacée avec succès.
it: La pagina "%s" è stata spostata correttamente.

# movePage.notification.pageCopied.title
source: Page successfully copied
ar: تم نسخ الصفحة بنجاح
fr: Page copiée avec succès
it: Pagina copiata correttamente

# movePage.notification.pageCopied.message
source: The page "%s" has been successfully copied.
ar: تم نسخ الصفحة "%s" بنجاح.
fr: La page « %s » a été copiée avec succès.
it: La pagina "%s" è stata copiata correttamente.

# movePage.notification.pagePasted.action.dismiss
source: Dismiss
ar: تجاهل
fr: Fermer
it: Ignora

# movePage.notification.pagePasted.action.open
source: Open "%s"
ar: فتح "%s"
fr: Ouvrir « %s »
it: Apri "%s"
