Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/seo/Resources/Private/Language/*.locallang_tca.xlf
Languages: ar

# pages.palettes.seo
source: General SEO settings
ar: إعدادات SEO العامَّة

# pages.seo_title
source: Title for search engines
ar: العنوان من اجل محركات البحث

# pages.palettes.robots
source: Robot instructions
ar: تعليمات Robot

# pages.no_index
source: No index
ar: لا يوجد فِهْرِس

# pages.no_index_formlabel
source: Index this page
ar: فَهْرَِسة هذه الصفحة

# pages.no_follow
source: No follow
ar: لا يوجد متابعة

# pages.no_follow_formlabel
source: Follow this page
ar: مُتابعة هذه الصفحة

# pages.palettes.opengraph
source: Open Graph (Facebook)
ar: الصورة المُصغرة التي ستظهر في (Facebook)

# pages.og_title
source: Open Graph Title
ar: فتح عنوان الرسم البياني

# pages.og_description
source: Open Graph Description
ar: فتح وصف الرسم البياني

# pages.og_image
source: Open Graph Image
ar: فتح صورة الرسم البياني

# pages.palettes.twittercards
source: X / Twitter Cards
ar: بطاقات X / تويتر

# pages.twitter_title
source: X / Twitter Title
ar: عنوان X / تويتر

# pages.twitter_description
source: X / Twitter Description
ar: وَصف X / تويتر

# pages.twitter_image
source: X / Twitter Image
ar: صورة X / تويتر

# pages.twitter_card
source: Type of card to show
ar: نوع البطاقة المُراد عرضها

# pages.twitter_card.summary
source: Summary Card
ar: بطاقة الموجز

# pages.twitter_card.summary_large_image
source: Summary Card with a large image
ar: بطاقة الموجز مع صورة كبيرة

# pages.palettes.canonical
source: Canonical
ar: مُتَعارَف

# pages.canonical_link
source: Canonical link
ar: رابط النسخة الأصليَّة (Canonical)

# pages.canonical_link.description
source: A canonical URL is the URL of a page that search engines are advised to choose as the most representative from a set of duplicate pages. Often called deduplication, this process helps search engines show only one version of the otherwise duplicate content in its search results. TYPO3 automatically sets this to the most likely URL of the page if not set explicitly - which is most likely the URL of the page itself. If set here, the page will be removed from the XML sitemap.
ar: الرابط الأساسي (canonical URL) هو عنوان الصفحة، الذي يُفضّل اختياره لمحركات البحث كالأكثر تمثيلاً من بين مجموعة من الصفحات المُكررة. يُطلق على هذه العملية في كثير من الأحيان اسم التخلص من تكرار المحتوى، وتساعد هذه العملية محركات البحث في عرض إصدار واحد فقط من المحتوى المُكرر والآخر في نتائج البحث. يُعين TYPO3 هذا تلقائياً إلى العنوان الذي يُعتبر الأكثر احتمالًا للصفحة إذا لم يُعين بشكل صريح - والذي هو على الأرجح عنوان الصفحة نفسه. إذا تم تحديده هنا، سيتم إزالة الصفحة من خريطة الموقع الخاصة بملف XML.

# pages.tabs.socialmedia
source: Social media
ar: وسائل التواصل الاجتماعي

# pages.palettes.sitemap
source: Sitemap
ar: فِهْرِس الصفحة "Sitemap"

# pages.sitemap_changefreq
source: Change frequency
ar: تغيير التردد

# pages.sitemap_changefreq.none
source: None
ar: لا شَيْء

# pages.sitemap_changefreq.always
source: Always
ar: دائماً

# pages.sitemap_changefreq.hourly
source: Hourly
ar: كل ساعة

# pages.sitemap_changefreq.daily
source: Daily
ar: يومياً

# pages.sitemap_changefreq.weekly
source: Weekly
ar: إسبوعياً

# pages.sitemap_changefreq.monthly
source: Monthly
ar: شهرياً

# pages.sitemap_changefreq.yearly
source: Yearly
ar: سنويّاً

# pages.sitemap_changefreq.never
source: Never
ar: مُطْلقاً

# pages.sitemap_priority
source: Priority
ar: الأولوية
