Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/indexed_search/Resources/Private/Language/*.locallang_pi.xlf
Languages: ar

# default_search_word_entry
source: Search for
ar: البحث عن

# submit_button_label
source: Search
ar: بحث

# opt_type_0
source: Distinct word
ar: كلمة محددة

# opt_type_1
source: Part of word
ar: جزء من الكلمة

# opt_type_2
source: First part of word
ar: المقطع الأول للكلمة

# opt_type_3
source: Last part of word
ar: المقطع الثاني للكلمة

# opt_type_10
source: Sounds like
ar: يبدو كما لو كان

# opt_type_20
source: Sentence
ar: جملة

# opt_defOp_0
source: All words (AND)
ar: جميع الكلمات(AND)

# opt_defOp_1
source: Any words (OR)
ar: أي كلمة(OR)

# opt_sections_0
source: Whole site
ar: الموقع بأكلمه

# opt_sections_-1
source: Only this page
ar: هذه الصفحة فقط

# opt_sections_-2
source: Top + level 1
ar: أعلى+مستوى1

# opt_sections_-3
source: Level 2 and out
ar: مستوى 2 و خروج

# opt_freeIndexUid_-1
source: All, mixed
ar: ممتزجة شكل تام

# opt_freeIndexUid_-2
source: All, categorized
ar: مصنفة بشكل كامل

# opt_freeIndexUid_0
source: Pages
ar: الصفحات

# opt_freeIndexUid_header_-1
source: Mixed categories
ar: الفئات الممتزجة

# opt_freeIndexUid_header_0
source: Website Pages
ar: صفحات موقع الوب

# opt_media_-1
source: All media
ar: كل الوسائط

# opt_media_0
source: Internal pages
ar: صفحات الإنترنت

# opt_media_-2
source: All External
ar: جميع الأجزاء الخارجية

# opt_order_rank_flag
source: Weight/Frequency
ar: الوزن/التردد

# opt_order_rank_freq
source: Frequency
ar: التردد

# opt_order_rank_first
source: Close to top
ar: إغلق لأعلى

# opt_order_rank_count
source: Number of words
ar: عدد الكلمات

# opt_order_mtime
source: Date Modified
ar: تاريخ أخر تعديل

# opt_order_title
source: Document title
ar: عنوان الوثيقة

# opt_order_crdate
source: Creation date
ar: إنشاء التاريخ

# opt_group_sections
source: Section hierarchy
ar: قطاع هرمي

# opt_group_flat
source: Flat list
ar: اللآئحة الثابتة

# opt_lang_-1
source: All languages
ar: كل اللغات

# opt_lang_0
source: Default
ar: إفتراضي

# opt_desc_0
source: Highest first
ar: الأعلى أولا

# opt_desc_1
source: Lowest first
ar: الأقل أولا

# opt_RL1
source: Level 1
ar: المستوى 1

# opt_RL1ALL
source: All pages on level 1
ar: جميع الصفحات المدرجة في المستوى1

# opt_RL2
source: - Level 2
ar: - المستوى 2

# opt_RL2ALL
source: - All pages on level 2
ar: -جميع الصفحات المدرجة في المستوى2

# form_legend
source: Search form
ar: نموذج البحث

# form_searchFor
source: Search for
ar: البحث عن

# form_extResume
source: Extended resume
ar: تكملة ممتدة

# form_atATime
source: at a time
ar: في الوقت

# form_orderBy
source: Order by
ar: الترتيب حسب

# form_fromSection
source: From section
ar: من القسم

# form_freeIndexUid
source: Category
ar: الفئة

# form_searchIn
source: Search in
ar: البحث في

# form_match
source: Match
ar: تطابق

# form_style
source: Style
ar: المظهر

# rules_header
source: Rules
ar: القواعد

# rules_text
source: Only words with 2 or more characters are accepted Max 200 chars total Space is used to split words, "" can be used to search for a whole string (not indexed search then) AND, OR and NOT are prefix words, overruling the default operator +/|/- equals AND, OR and NOT as operators. All search words are converted to lowercase.
ar: يتم قبول الكلمات فقط الكلمات المكونة من حرفين او أكثر الحد الأقصي لعدد الحروف 200 تستخدم المسافة للفصل بين الكلمات، ويمكن أن تستخدم "" للبحث عن السلسلة كاملة (والبحث عندئذن يكون غير مفهرس) وتعد ANDو OR وNOT بادئات للكلمات، التي تتحكم في المشغل الإفتراضي +/|/- و المساوي AND, OR and NOT إذا ما كانت تعمل كمشغلات. يمكن تغير جميع كلمات البحث إلى أحرف صغيرة.

source: Search for
ar: البحث عن

# searchFor_butNot
source: but not
ar: ولكن not

# noResults
source: NO results found.
ar: لم يتم العثور على أي نتائج

# inSection
source: in the section
ar: داخل المقطع

# inNsection
source: in %s section
ar: في قسم %s

# inNsections
source: in %s sections
ar: في %s أقسام

# word_page
source: page
ar: صفحة

# word_pages
source: pages
ar: صفحات

# unnamedSection
source: Other
ar: أخر

# link_regularSearch
source: Regular search
ar: البحث المعتاد

# link_advancedSearch
source: Advanced search
ar: البحث المتقدم

# res_path
source: Path
ar: مسار

# res_modified
source: Modified
ar: تم تعديله

# res_created
source: Created
ar: تم الإنشاء

# res_size
source: Size
ar: الحجم

# res_noResume
source: Note: This search hit may not accurately match the content on this page. The page resume cannot be shown.
ar: ملاحظة: لا تتوافق نتائج البحث هذه بدقة مع محتوى هذه الصفحة. لا تزال الصفحة لا يمكن عرضها.

# res_otherMatching
source: Other matching pages in the same document
ar: صفحات مطابقة أخرى في نفس المستند

# res_otherPageAsWell
source: INFO: There was another page indexed as well... Probably indexed with another or no usergroup.
ar: معلومة: وقد كان هناك أيضا صفحة أخرى مفهرسة ...ومن الجائز أنها كانت مفهرسة داخل مجموعة مستخدم أخرى أو كانت مفردة دون أن تدرج داخل أي مجموعة مستخدم.

# res_memberGroups
source: Require membership of group numbers %s
ar: يتطلب عضوية ارقام المجموعة%s

# pi_list_browseresults_prev
source: < Previous
ar: >السابق

# pi_list_browseresults_page
source: Page
ar: الصفحة

# pi_list_browseresults_next
source: Next >
ar: <التالي

# pi_list_browseresults_display
source: Displaying results ###TAG_BEGIN###%1$s to %2$s###TAG_END### out of ###TAG_BEGIN###%3$s###TAG_END###
ar: عرض النتائج ##TAG_BEGIN###%1$s إلى %2$s##TAG_END## من ##TAG_BEGIN###%3$s##TAG_END### # TAG_END##

# makerating_addToCurrentSearch
source: Add to current search words
ar: أضف لكلمات البحث الحالية

# maketitle_matches
source: matches
ar: المتطابقات

# pi_wizard_title
source: Indexed Search
ar: البحث المُفهرس

# pi_wizard_description
source: Search based on a database stored index.
ar: البحث على أساس فهرس قاعدة البيانات المخزنة.
