Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/indexed_search/Resources/Private/Language/*.locallang_csh_indexcfg.xlf
Languages: ar, fr, it

# .description
source: The Indexed Search configuration allows you to set up indexing of resources which are external to the TYPO3 page tree. This could be a library of records (like news), a directory structure of files (like PDFs) or an external URL to be crawled to some depth - or third-party content provided from other extensions via hooks.
ar: يتيح لك تكوين البحث المُفهرس إعداد فهرسة الموارد الخارجية لشجرة صفحات TYPO3. قد تكون هذه مكتبة من السجلات (مثل الأخبار)، أو بنية دليل للملفات (مثل ملفات PDF) أو عنوان URL خارجي ليتم الوصول إليه إلى حد ما - أو محتوى تابع لجهة خارجية يتم توفيره من امتدادات أخرى عبر الوصلات.
fr: La configuration de la recherche indexée permet de paramétrer les sources d'indexation extérieures à l'arborescence de TYPO3. Cela peut être une librairie de contenu (comme des actualités), une structure de répertoire avec des fichiers (comme des PDFs) ou une URL externe à indexer à plusieurs niveaux de profondeurs - ou le contenu d'une application tierce provenant d'autres extensions via des hooks.
it: La configurazione di Ricerca Indicizzata consente di impostare l'indicizzazione delle risorse che sono esterne all'Albero delle Pagine di TYPO3. Questa potrebbe essere una libreria di record (come le news), una struttura di cartelle di file (come PDF), un URL esterno da analizzare ad una certa profondità o contenuti di terze parti forniti da altre estensioni, via hook.

# .details
source: The Indexing Configuration records are used to set up how the indexing occurs, at which time and related to which part of the page tree. An important requirement to keep in mind is that the "crawler" extension must be installed since the indexing engine uses the "crawler" extensions queue as a timing device - and using the "crawler" extension means using a cron-job to activate it from the shell.
ar: تستخدم سجلات تكوين الفهرسة لإعداد كيفية حدوث الفهرسة، وفي ذلك الوقت تتصل بأي جزء من شجرة الصفحة. ومن الشروط الهامّة التي ينبغي مراعاتها أن تكون هناك حاجة إلى تثبيت إضافة "crawler" لأن محرك الفهرسة يستخدم إضافات قائمة الانتظار "crawler" كجهاز توقيت - واستخدام إضافة "crawler" يعني استخدام cron-job لتفعيلها من shell.
fr: Les enregistrements de configuration d'indexation sont utilisés pour définir comment l'indexation se produit, à quel moment et en relation avec quelle partie de l'arborescence de page. Une condition importante à garder à l'esprit est que l'extension "crawler" doit être installée car le moteur d'indexation utilise la file d'attente des extensions "crawler" comme périphérique de synchronisation - et utiliser l'extension "crawler" signifie utiliser une tâche cron pour l'activer depuis le shell.
it: I record di Configurazione dell'Indicizzazione vengono utilizzati per impostare come avviene l'indicizzazione, in quale momento e in quale parte dell'Albero delle Pagine. Un requisito importante, da tenere a mente, è che l'estensione "crawler" deve essere installata, poiché il motore di indicizzazione utilizza la coda dell'estensione "crawler" come dispositivo di temporizzazione, e utilizzare l'estensione "crawler" significa utilizzare un cron-job per attivarlo.

# title.description
source: Provide a title for the configuration.
ar: توفير عنوان للتكوين.
fr: Donner un titre à la configuration.
it: Inserisci un titolo per la configurazione.

# description.description
source: If needed, give it a description or put other important notes in this field.
ar: إذا لزم الأمر، ضع وَصفاً أو ضع ملاحظات هامة أخرى في هذا الحقل.
fr: Si nécessaire, indiquer une description ou d'autres notes importantes dans ce champ.
it: Se necessario, fornisci una descrizione o metti altre note importanti in questo campo.

# hidden.description
source: Disable the configuration by unchecking this option. If disabled, the configuration will be bypassed by the crawlers cron job.
ar: قم بتعطيل التكوين عن طريق عدم تحديد مربع الاختيار هذا. إذا تم تعطيله، سيتم تجاوز التكوين عن طريق crawlers cron job.
fr: Désactivez la configuration en décochant cette option. Si elle est désactivée, la configuration sera contournée par la tâche cron des crawlers.
it: Disabilita la configurazione deselezionando quest'opzione. Se disabilitata, la configurazione sarà bypassata dal cron job del crawler.

# hidden.details
source: Notice; Disabling the indexing process will not hide already indexed content in search results!
ar: إشعار: إن تعطيل عملية الفَهرسة لن يخفي المحتوى المُفهرس مُسبقاً في نتائج البحث!
fr: Remarque : Désactiver le processus d'indexation ne permettra pas de faire disparaitre immédiatement votre contenu indexé dans les pages de résultat !
it: Nota: disabilitando il processo di indicizzazione non nasconderà il contenuto già indicizzato nei risultati di ricerca!

# starttime.description
source: Set a start time for the configuration. If set, the configuration will be bypassed by the crawlers cron job until this time is reached.
ar: تعيين وقت لبَدْء التكوين. إذا تم ضبط ذلك، سيتم تجاوز التكوين بواسطة وظيفة crawlers cron حتى يتم الوصول إلى هذا الوقت.
fr: Définissez une heure de début pour la configuration. Si défini, la configuration sera contournée par la tâche cron des crawlers jusqu'à ce que cette heure soit atteinte.
it: Imposta un orario di inizio per la configurazione. Se impostato, la configurazione sarà bypassata dal job-cron del crawler fino a quel momento.

# timer_frequency.description
source: Use this setting to adjust how often you would like a re-indexing process to run for the configuration.
ar: استخدم هذا الإعداد لضبط عدد المرات التي ترغب في إعادة الفَهرسة فيها لتشغيل الإعدادات.
fr: utiliser ces paramètres pour ajuster la fréquence d’exécution de votre processus de ré-indexation
it: Utilizza questa impostazione per determinare la frequenza del processo di reindicizzazione per la configurazione.

# timer_offset.description
source: The offset adjusts at what time of day you want the indexing process to run.
ar: يتم تعديل الإزاحة في أي وقت من اليوم تريد فيه تشغيل عملية الفَهرسة.
fr: Ce paramètre ajuste à quelle heure de la journée vous souhaitez lancer le processus d'indexation
it: L'offset corregge l'orario in cui si vuole che il processo di indicizzazione venga eseguito.

# timer_next_indexing.description
source: This field contains the date and time of the next occurring indexing session. If left blank the next indexing will occur as soon as the cron-script is run again (typically within the next minute) and afterwards set to the next time according to frequency and offset.
ar: يحتوي هذا الحقل على تاريخ ووقت دورة الفَهرسة التالية التي ستحدث. إذا تُركَ هذا الحقل فارغاً، فإن الفهرسة التالية ستحدث حالما يتم تشغيل cron-script مرة أخرى (عادة في غضون الدقيقة التالية) ثم يتم تعيينه بعد ذلك إلى المرة التالية وفقاً للفرق والإزاحة.
fr: Ce champ contient la date et l'heure de la prochaine session d'indexation. Si laissé vide, la prochaine indexation se produira dès que le script cron-script sera exécuté à nouveau (généralement dans la minute suivante) et ensuite à la prochaine fois en fonction de la fréquence et du décalage.
it: Questo campo contiene la data e l'ora della prossima sessione di indicizzazione. Se lasciato vuoto, l'indicizzazione successiva si verificherà non appena lo script-cron viene eseguito di nuovo (tipicamente entro il minuto successivo) e successivamente impostato alla prossima volta in base alla frequenza e all'offset.

# type.description
source: Select the type of Indexing Configuration here.
ar: حدد نوع تكوين الفهرسة هنا.
fr: Sélectionner le type de configuration d'indexation ici
it: Seleziona il tipo di Configurazione di Indicizzazione.

# type.details
source: <b>Records</b> - You will be able to index records on a specified page from a specified database table. You can determine which fields from that record you want to index and how additional GET parameters should look like when linking to the search result. <b>Files</b> - Allows you to index a whole directory of files from the fileadmin/ folder. You can optionally specify how many levels of recursion you want. <b>External URL</b> - Allows you to index an external site and search it from your TYPO3 installation! You can specify how deep the crawler should go on that external URL. <b>Page tree</b> - Allows you to index the page tree using the cron script. This type will not be useful as a category for searching like the other types. <b>Meta configuration</b> - Points to a collection of other indexing configurations in which the search will be done. Cannot be used for cron-job based indexing. <b>Custom</b> - Other extensions might register custom types of configurations.
ar: <b>السجلات</b> - ستتمكن من فهرسة السِجلات في صفحة مُحددة من جدول قاعدة بيانات مُحدد. يمكنك تحديد أيّة حقول من هذا السجل التي تريد فهرستها وكيف يجب أن تبدو معلمات GET الإضافية عند الربط مع نتيجة البحث. <b>الملفات</b> - يسمح لك بفهرسة دليل كامل للملفات من fileadmin/ المجلد. يمكنك اختيارياً تحديد عدد مستويات التكرار التي تريدها. <b>الرابط الخارجي</b> - يسمح لك بفهرسة موقع خارجي والبحث عنه من تثبيت TYPO3 الخاص بك! يمكنك تحديد مدى عمق الزحف على هذا الرابط الخارجي. <b>شجرة الصفحة</b> - يسمح لك بفهرسة شجرة الصفحة باستخدام البرنامَج النصي cron. هذا النوع لن يكون مفيداً كفئة للبحث مثل الأنواع الأخرى. <b>تكوين Meta</b> - نِقَاط لمجموعة من تكوينات الفهرسة الأخرى التي سيتم البحث فيها. لا يمكن استخدامها للفهرسة المُستندة إلى وظيفة cron-job. <b>مخصص</b> - الإضافات الأخرى قد تسجل أنواع مخصصة من الإعدادات.
fr: <b>Enregistrements</b> - Vous serez en mesure d'indexer des enregistrements sur une page spécifiée à partir d'une table de base de données spécifiée. Vous pouvez déterminer quels champs de cet enregistrement vous voulez indexer et à quoi devraient ressembler les paramètres GET supplémentaires lors de la connexion au résultat de la recherche. <b>Fichiers</b> - Vous permet d'indexer un répertoire entier de fichiers du dossier fileadmin/ . Vous pouvez éventuellement spécifier combien de niveaux de récursion vous voulez. <b>URL externe</b> - Vous permet d'indexer un site externe et de le rechercher depuis votre installation de TYPO3 ! Vous pouvez spécifier à quel point le crawler doit aller sur cette URL externe. <b>Arborescence de pages</b> - Vous permet d'indexer l'arborescence des pages en utilisant le script cron. Ce type ne sera pas utile en tant que catégorie pour la recherche comme les autres types. <b>Meta configuration</b> - Points vers une collection d'autres configurations d'indexation dans lesquelles la recherche sera effectuée. Ne peut pas être utilisé pour l'indexation des tâches cron. <b>Personnalisé</b> - D'autres extensions peuvent enregistrer des types personnalisés de configurations.
it: <b>Record</b> - Sarai in grado di indicizzare i record su una pagina specificata da una particolare tabella del database. È possibile determinare quali campi, da quel record, si desidera indicizzare e come dovrebbero essere i parametri GET aggiuntivi quando si associa al risultato di ricerca. <b>File</b> - Consente di indicizzare un'intera cartella di file dalla cartella fileadmin/. È possibile specificare facoltativamente quanti livelli di ricorsione si desidera. <b>URL esterno</b> - Permette di indicizzare un sito esterno e cercarlo dalla tua installazione TYPO3! È possibile specificare quanto in profondità il crawler dovrebbe andare su quell'URL esterno. <b>Albero delle Pagine</b> - Permette di indicizzare l'Albero delle Pagine usando lo script-cron. Questo tipo non sarà utile come categoria per la ricerca, come gli altri tipi. <b>Configurazione Meta</b> - Riferimenti a una raccolta di altre configurazioni di indicizzazione in cui la ricerca sarà effettuata. Impossibile usare per l'indicizzazione basata su job-cron <b>Personalizzato</b> - Altre estensioni potrebbero registrare tipi personalizzati di configurazioni.

# table2index.description
source: Specify the database table to index records from.
ar: حدد جدول قاعدة البيانات لفهرسة السجلات منه.
fr: Spécifier les tables de la base de données à indexer
it: Specifica la tabella del database di cui indicizzare i contenuti.

# alternative_source_pid.description
source: By default the indexer will select records from the page id where the Indexing Configuration is stored. If you want an alternative page as the source of your records you can enter it here.
ar: سيقوم المُفهرِس بشكل افتراضي بتحديد السجلات من مُعرّف الصفحة حيث يتم تخزين تكوين الفهرسة. إذا كنت تريد صفحة بديلة كمصدر للسجلات الخاصة بك يمكنك إدخالها هنا.
fr: Par défaut, l'indexeur sélectionnera les enregistrements à partir de l'identifiant de la page où la configuration d'indexation est stockée. Si vous voulez une autre page comme source de vos enregistrements, vous pouvez la saisir ici.
it: Per default, l'indicizzatore selezionerà i record dall'ID di Pagina in cui viene memorizzata la Configurazione di Indicizzazione. Se vuoi una pagina alternativa, come fonte dei tuoi record, puoi inserirla qui.

# get_params.description
source: Enter the GET parameters necessary to display the search results. You can use ###UID### as a marker in the parameter template.
ar: أدخل مُعلمات GET اللازمة لعرض نتائج البحث. يمكنك استخدام ###UID### كعلامة في قالب المعلمات.
fr: Entrer les paramètres GET nécessaires à l'affichage des résultats de recherche. Vous pouvez utiliser ###UID### comme un marqueur dans le modèle de paramètre
it: Inserisci i parametri GET necessari per visualizzare i risultati della ricerca. È possibile utilizzare ###UID### come marcatore nella stringa dei parametri.

# get_params.details
source: Notice: The GET parameters are appended to the URL of the page where the Indexing Configuration is stored (which must be the page where a plugin exists that can display the records with the given parameters!). Example value: "&showUid=###UID###"
ar: ملاحظة: يتم إرفاق معلمات GET إلى عنوان URL للصفحة حيث يتم تخزين تكوين الفهرسة (والذي يجب أن يكون الصفحة التي توجد فيها إضافة يمكن أن تعرض السجلات مع المعلمات المحددة!). قيمة مثالية: "&showUid=###UID###"
fr: Remarque: Les paramètres GET sont ajoutés à l'URL de la page où la configuration d'indexation est stockée (qui doit être la page où existe un plugin qui peut afficher les enregistrements avec les paramètres donnés!). Exemple: "&showUid=###UID###"
it: Nota: i parametri GET sono aggiunti all'URL della pagina in cui è memorizzata la configurazione di indicizzazione (che deve essere la pagina in cui esiste un plugin in grado di visualizzare i record con i parametri specificati!). Ad esempio: "&showUid=###UID###"

# fieldlist.description
source: Enter a comma-list of fields to be indexed. The first field name will be used for the search result title.
ar: أدخل قائمة فاصلة بالحقول التي سيتم فهرستها. سيتم استخدام اسم الحقل الأول لعنوان نتيجة البحث.
fr: Entrer une liste des champs à indexer, séparés par des virgules. Le nom du premier champ sera utilisé pour le titre du résultat de la recherche.
it: Inserisci una lista, separata da virgola, di campi da indicizzare. Il nome del primo campo sarà usato per il titolo del risultato di ricerca.

# fieldlist.details
source: <b>Example:</b> "header,bodytext,image_caption" would index the Header, Bodytext and Image Caption fields from "tt_content". Notice that you must use the real database field names, don't spell them wrong!
ar: <b>على سبيل المثال:</b> "header,bodytext,image_caption" سوف تفهرس حقول (الوصف، الترويسة، المتن، الصور) من "tt_content". لاحظ أنه يجب عليك استخدام أسماء حقول قاعدة البيانات الحقيقية، لا تهجئها بشكل خاطئ!
fr: <B> Exemple: </ b> "header,bodytext,image_caption" indexerait les champs Header, Bodytext et Image Caption de "tt_content". Notez que vous devez utiliser les noms de champs de la base de données réelle, ne vous trompez pas dans leur écriture!
it: <b>Esempio:</b> "header,bodytext,image_caption" indicizzeranno i campi Header, Bodytext e Image Caption, provenienti dalla tabella "tt_content". Attenzione ad usare i nomi dei campi del database correttamente!

# recordsbatch.description
source: Enter how many records to index for each instance of the indexing process (how many per minute). Default is 100 records.
ar: أدخل عدد السجلات المُراد فهرستها لكل حالة من حالات عملية الفهرسة (ما عدد السجلات في الدقيقة). الافتراضي هو 100 سجل.
fr: Entrer le nombre d'enregistrement à indexer à chaque instance d'indexation (nombre par minute). Par défaut, le nombre est de 100 enregistrements.
it: Inserisci quanti record indicizzare per ogni istanza del processo di indicizzazione (quanti al minuto). Predefinito è 100 record.

# records_indexonchange.description
source: If set, new and changed records from this table will be indexed through a hook in the core (Datahandler) meaning that they will be searchable immediately after addition to the system.
ar: إذا تم تعيينه، السجلات الجديدة والمُتغيرة من هذا الجدول سيتم فهرستها من خلال رابط في نواة (Datahandler) بمعنى أنه سيتم البحث فيها مباشرةً بعد الإضافة إلى النظام.
fr: Si défini, les enregistrements nouveaux et modifiés de cette table seront indexés par un hook dans le core (Datahandler), ce qui signifie qu'ils seront interrogeables immédiatement après l'ajout au système.
it: Se impostato, i record da questa tabella, nuovi e modificati, saranno indicizzati attraverso un hook nel codice core (Datahandler), il che significa che saranno ricercabili immediatamente dopo l'aggiunta al sistema.

# externalUrl.description
source: Enter the URL of the external website you want to index.
ar: أدخل عنوان URL للموقع الإلكتروني الخارجي الذي تريد فهرسته.
fr: Entrer l'URL du site internet externe que vous souhaitez indexer
it: Inserisci l'URL del sito web esterno che vuoi indicizzare.

# url_deny.description
source: Enter a URL on each line inside of which the crawler should not decend.
ar: أدخل عنوان URL في كل سطر يجب ألا ينخفض فيه crawler.
fr: Entrez une URL sur chaque ligne à l'intérieur de laquelle le crawler ne doit pas descendre.
it: Inserisci un URL su ciascuna riga all'interno del quale il crawler non dovrebbe entrare.

# url_deny.details
source: Example: If you wish to index "https://typo3.org/" but not "https://typo3.org/extensions/" and "https://typo3.org/downloads/" then you simply enter those two URLs into the box like this: https://typo3.org/downloads/ https://typo3.org/extensions/
ar: مثال: إذا كنت ترغب في فهرسة "https://typo3.org/" ولكن ليس "https://typo3.org/extensions/" و "https://typo3. rg/downloads/" ثم تقوم ببساطة بإدخال هذين الرابطين في صندوق مثل هذا: https://typo3.org/downloads/ https://typo3.org/extensions/
fr: Exemple: Si vous souhaitez indexer "https://typo3.org/" mais pas "https://typo3.org/extensions/" et "https://typo3.org/downloads/" alors vous entrez simplement ces deux URL dans le champ comme ceci : https://typo3.org/downloads/ https://typo3.org/extensions/
it: Esempio. Se desideri indicizzare "https://typo3.org/", ma non "https://typo3.org/extensions/" e "https://typo3.org/downloads/" poi inserire queste due URL: https://typo3.org/downloads/ https://typo3.org/extensions/

# filepath.description
source: Enter a filepath inside fileadmin/ where you want the files to be indexed.
ar: أدخل ملف داخل fileadmin/ حيث تريد فهرسة الملفات.
fr: Entrez un chemin de fichier dans fileadmin/ où vous voulez que les fichiers soient indexés.
it: Inserisci un percorso dentro fileadmin/ dove vuoi che i file siano indicizzati.

# filepath.details
source: Example: "fileadmin/newsletters/"
ar: مثال: "fileadmin/newsletters/"
fr: Exemple: "fileadmin/newsletters/"
it: Esempio: "fileadmin/newsletters/"

# extensions.description
source: If you want to index only specific files in the directory, enter a list of file extensions here. For example: "html,pdf,doc"
ar: إذا كنت ترغب في فهرسة ملفات مُحددة فقط في الدليل، أدخل قائمة إضافات الملفات هنا. على سبيل المثال: "html,pdf,doc"
fr: SI vous souhaitez indexer seulement certains types de fichiers présent dans un dossier, entrer une liste d'extensions ici. Par exemple : "html, pdf, doc"
it: Se desideri indicizzare solo alcuni tipi di file nella cartella, inserisci un elenco di estensioni di file qui. Per esempio: "html,pdf,doc"

# depth.description
source: Levels of recursion.
ar: مستويات التكرار.
fr: Niveau de récursivité
it: Livelli di ricorsione.

# depth.details
source: For file indexing it is the level of directories to decend. For External URLs it's the depth to which the crawler will go with links.
ar: بالنسبة لفهرسة الملفات، يكون مستوى الدلائل يتناقص. بالنسبة لعناوين URL الخارجية،يكون العمق الذي سيذهب إليه crawler مع الروابط.
fr: Pour l'indexation des fichiers, c'est la profondeur de répertoire à indexer. Pour les URLs externes, c'est la profondeur à laquelle l'explorateur ira avec des liens.
it: Per l'indicizzazione dei file è il livello di cartelle a cui scendere. Per gli URL esterni è il numero massimo dei segmenti dei collegamenti in cui il crawler eseguirà l'analisi.

# indexcfgs.description
source: When a search is conducted in this indexing configuration the actual search will take place in the indexed content from the configurations listed here. You can also enter pages and if you do so the search will take place in indexing configurations found on those pages.
ar: عند إجراء بحث في تكوين الفهرسة هذه، سيتم البحث الفعلي في المحتوى المُفهرس من الإعدادات المُدرجة هنا. يمكنك أيضاً إدخال الصفحات، وإذا فعلت ذلك سيتم البحث في الفهرسة التكوينات الموجودة في تلك الصفحات.
fr: Lorsqu'une recherche est effectuée dans cette configuration d'indexation, la recherche a lieu dans le contenu indexé des configurations listées ici. Vous pouvez également entrer des pages et, si vous le faites, la recherche aura lieu dans les configurations d'indexation trouvées sur ces pages.
it: Quando viene eseguita, in questa configurazione di indicizzazione, la ricerca effettiva avrà luogo nel contenuto indicizzato dalle configurazioni qui elencate. Puoi anche inserire le pagine e, se lo fai, la ricerca avrà luogo nelle configurazioni di indicizzazione che si trovano su quelle pagine.
