Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/indexed_search/Resources/Private/Language/*.locallang_db.xlf
Languages: ar, it

# index_config
source: Indexing Configuration
ar: توصيف عملية الفهرسة
it: Configurazione Indicizzazione

# index_config.title
source: Title
ar: العنوان
it: Titolo

# index_config.description
source: Description
ar: الوَصف
it: Descrizione

# index_config.type.I.1
source: Database Records
ar: سجلات قاعدة البيانات
it: Record del Database

# index_config.type.I.2
source: Filepath on server
ar: مسار المِلَفّ على الخادم
it: Percorso file sul server

# index_config.type.I.3
source: External URL
ar: الرابط الخارجى
it: URL esterna

# index_config.type.I.4
source: Page tree
ar: شجرة الصفحة
it: Albero delle Pagine

# index_config.type.I.5
source: Meta configuration
ar: تكوين Meta
it: Configurazione Meta

# index_config.type
source: Type
ar: النوع
it: Tipo

# index_config.depth
source: Depth
ar: العمق
it: Profondità

# index_config.table2index
source: Table to index
ar: جدول للفهرس
it: Tabella da indicizzare

# index_config.alternative_source_pid
source: Alternative Source Page
ar: صفحة المصدر البديلة
it: Pagina Sorgente Alternativa

# index_config.get_params
source: GET parameter string (with ###UID### substitution)
ar: سلسلة مُعلّمة GET (مع الاستبدال ###UID######)
it: Stringa parametri GET (con sostituzione ###UID###)

# index_config.fields
source: Fields (first is title)
ar: الحقول (الأول هو العنوان)
it: Campi (il primo è il titolo)

# index_config.externalUrl
source: External URL (eg. "http://www.domain.org/")
ar: الخارجي URL (eg. "http://www.domain.org/")
it: URL esterna (es. "http://www.domain.org/")

# index_config.filepath
source: Filepath
ar: مسار الملف
it: Percorso file

# index_config.extensions
source: Limit to extensions (commalist)
ar: الحد من الإضافات (commalist)
it: Limita alle estensioni (lista separata da virgola)

# index_config.url_deny
source: Enter sub-URLs in which not to decend
ar: لا تتعمق أكثر في عناوين URL الفرعية هذه
it: Inserisci segmenti URL in cui non eseguire l'analisi

# index_config.records_indexonchange
source: Index Records immediately when saved?
ar: فهرسة السجلات فوراً عند حفظها؟
it: Indicizzare i record appena dopo il salvataggio?

# index_config.timer_next_indexing
source: Next indexing is scheduled (if empty, then immediately)
ar: الفهرسة التالية مُجدوَلة (إذا كانت فارغة، ثم على الفور)
it: La prossima indicizzazione è pianificata (se vuota, immediatamente)

# index_config.timer_offset
source: Timing offset from midnight
ar: موازنة التوقيت من منتصف الليل
it: Offset dalla mezzanotte

# index_config.timer_frequency
source: How often would you like a re-index?
ar: كم مرة تريد إعادة الفهرسة؟
it: Quanto spesso vorresti reindicizzare?

# index_config.timer_frequency.I.0
source: Every hour
ar: كل ساعة
it: Ogni ora

# index_config.timer_frequency.I.1
source: Every day (24 hours)
ar: كل يوم (كل 24 ساعة)
it: Ogni giorno (24 ore)

# index_config.timer_frequency.I.2
source: Every week
ar: كل أسبوع
it: Ogni settimana

# index_config.recordsbatch
source: How many records to index a minute (default is 100)
ar: ما عدد السجلات المُراد فهرستها خلال دقيقة (الافتراضي هو 100)
it: Quanti record indicizzare alla volta (predefinito è 100)

# index_config.set_id
source: Session ID (if > zero, then indexing job is running)
ar: ID الجِلسة (إذا > صفر، ثم الفهرسة يتم تشغيلها)
it: ID sessione (se maggiore di zero il processo di indicizzazione è in esecuzione)

# index_config.indexcfgs
source: Indexing configurations
ar: إعدادات الفهرسة
it: Configurazioni di indicizzazione

# index_config.parameterCfgs
source: Parameter combination configuration ([tablename]:&[param]=###UID###)
ar: تكوين تركيب المُعلّمة ([tablename]:&[param]=###UID###)
it: Configurazione della combinazione dei parametri ([tablename]:&[param]=###UID###)

# index_config.rootpage
source: Root page
ar: الصفحة الجذر
it: Pagina root

# plugin_title
source: Indexed Search
ar: البحث المُفهرس
it: Ricerca Indicizzata

# plugin_description
source: Search based on a database stored index.
ar: البحث على أساس فهرس قاعدة البيانات المخزنة.
it: Ricerca basata su un indice memorizzato nel database.
