Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/indexed_search/Resources/Private/Language/*.locallang_em.xlf
Languages: it

# indexedsearch.config.pdftools
source: Path to PDF parsers: The indexer uses the applications 'pdftotext' and 'pdfinfo' for extracting content from PDF files. These applications must be installed in this path. Otherwise leave the field empty.
it: Percorso ai parser PDF: l'indicizzatore utilizza le applicazioni 'pdftotext' e 'pdfinfo' per estrarre il contenuto dai file PDF. Queste applicazioni devono essere installate in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.pdf_mode
source: PDF parsing mode: Zero=whole file is indexed in one. Positive value indicates number of pages at a time, eg. "5" would mean 1-5,6-10,.... Negative integer would indicate (abs value) number of groups. Eg "3" groups of 10 pages would be 1-4,5-8,9-10. Range is -100 to 100.
it: Modalità di analisi PDF: 0 => l'intero file è indicizzato in una sola volta. Un valore intero positivo indica il numero di pagine analizzate per volta. Ad esempio "5" significa 1-5, 6-10, ... Un numero intero negativo indica il numero di gruppi in cui raggruppare tutte le pagine da analizzare. Ad esempio, "-3" di 10 pagine sarebbe 1-4, 5-8, 9-10. L'intervallo valido è da -100 a 100.

# indexedsearch.config.unzip
source: Path to unzip: The indexer uses "unzip" to extract the contents from OpenOffice.org/Oasis OpenDocument files. The application must be installed in this path. Otherwise leave the field empty.
it: Percorso di unzip: l'indicizzatore utilizza "unzip" per estrarre il contenuto dai file OpenOffice.org/Oasis OpenDocument. L'applicazione deve essere installata in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.catdoc
source: Path to WORD parser: The indexer uses the application 'catdoc' for extracting content from WORD files. The application must be installed in this path. Otherwise leave the field empty.
it: Percorso del parser WORD: l'indicizzatore utilizza l'applicazione 'catdoc' per estrarre il contenuto dai file WORD. L'applicazione deve essere installata in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.xlhtml
source: Path to EXCEL parser: The indexer uses the application 'xlhtml' for extracting content from EXCEL files. The application must be installed in this path. Otherwise leave the field empty.
it: Percorso del parser EXCEL: l'indicizzatore utilizza l'applicazione 'xlhtml' per estrarre il contenuto dai file EXCEL. L'applicazione deve essere installata in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.ppthtml
source: Path to POWERPOINT parser: The indexer uses the application 'ppthtml' for extracting content from POWERPOINT files. The application must be installed in this path. Otherwise leave the field empty.
it: Percorso del parser POWERPOINT: l'indicizzatore utilizza l'applicazione 'ppthtml' per estrarre il contenuto dai file POWERPOINT. L'applicazione deve essere installata in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.unrtf
source: Path to RTF parser: The indexer uses the application 'unrtf' for extracting content from RTF files. The application must be installed in this path. Otherwise leave the field empty.
it: Percorso del parser RTF: l'indicizzatore utilizza l'applicazione 'unrtf' per estrarre il contenuto dai file RTF. L'applicazione deve essere installata in questo percorso. Altrimenti lascia il campo vuoto.

# indexedsearch.config.fullTextDataLength
source: Full Text Data Length: If set, the full text data stored will be limited to this byte length. It means you can save some database space but to the degree you cut the length down you also limit possibilities to search for sentences and the search result resume will be limited.
it: Lunghezza dei Dati del Testo completo: se impostata, i dati del testo completo memorizzati saranno limitati a questa lunghezza in byte. Ciò significa che è possibile salvare spazio nel database, ma, seconda di quanto si taglia in lunghezza, si limitano anche le possibilità di ricerca di frasi e il ripristino del risultato di ricerca sarà limitato.

# indexedsearch.config.disableFrontendIndexing
source: Disable Indexing in Frontend: By default pages are indexed during viewing of pages in the frontend. You can disable this features so indexing of pages is only initiated through the backend page crawler.
it: Disabilita l'Indicizzazione del Frontend: per default le pagine sono indicizzate durante la visualizzazione delle pagine nel frontend. È possibile disabilitare questa funzionalità in modo che l'indicizzazione delle pagine sia avviata solo attraverso il crawler nel backend.

# indexedsearch.config.minAge
source: Min TTL (hours) for indexed page: The time in hours that must pass before an indexed page can be indexed again regardless of changes on the page.
it: Minimo TTL (ore) per la pagina indicizzata: il tempo in ore che deve passare prima che una pagina indicizzata possa essere reindicizzata, indipendentemente dalle modifiche apportate alla pagina.

# indexedsearch.config.maxExternalFiles
source: Max external files to index: When external files are found on a page this number indicates how many may be indexed at that point. This prevents pages with links to many external documents to take the server down - but it may also prevent documents from being indexed.
it: Numero massimo di file esterni da indicizzare: quando i file esterni sono trovati in una pagina, questo numero indica quanti possono essere, al massimo, indicizzati. Questo impedisce alle pagine, con collegamenti a molti documenti esterni, di caricare troppo il server, ma potrebbe anche impedire che i documenti siano indicizzati.

# indexedsearch.config.flagBitMask
source: Bitmask for Flags (Advanced): By this value (0-255) you can filter the importance of <title> (128), <keywords> (64) and <description> (32) content from HTML documents. By setting this to 0, none of these fields will have any importance over the other. The default value 192 means that title-tag content and meta-keywords will be flagged (and rated higher in search results)
it: Bitmask per le Opzioni (Avanzato): con questo valore (0-255) puoi assegnare un peso (di importanza) a <title> (128), <keywords> (64) e <description> (32), meta tag nell'HTML. Ad esempio, impostando questo valore a 0, nessuno di questi tag avrà alcuna importanza rispetto agli altri. Il valore predefinito, 192 (128 + 64), significa che il contenuto del meta tag "title" e "keywords", hanno un peso maggiore.

# indexedsearch.config.ignoreExtensions
source: Ignore Extensions: List of file extensions that the external parser will ignore (despite having support for them). Comma list.
it: Ignora estensioni: elenco di estensioni di file che l'analizzatore esterno ignorerà (nonostante il supporto per loro). Lista separata da virgole.

# indexedsearch.config.indexExternalURLs
source: Index External HTML URLs: If set, links to external URLs will be indexed if they are of type "text/html".
it: Indicizza URL di HTML Esterni: se impostato, i collegamenti agli URL esterni vengono indicizzati se sono del tipo "text/html".

# indexedsearch.config.useMysqlFulltext
source: Use MySQL specific fulltext search - Update database schema in install tool after toggling this flag
it: Usa la ricerca full-text di MySQL: devi aggiornare lo schema del database in Install Tool, dopo aver modificato questa opzione

# indexedsearch.config.deleteFromIndexAfterEditing
source: Remove content from index if page or its content is edited
it: Rimuovi il contenuto dall'indice se la pagina o il suo contenuto è modificato
