Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/workspaces/Resources/Private/Language/*.locallang_db.xlf
Languages: ar, fr, it

# sys_workspace
source: Workspace
ar: مساحة العمل
fr: Espace de travail

# sys_workspace.custom_stages
source: Custom stages
ar: مراحل مُخصصة
fr: Étapes personnalisées
it: Fasi Post-Modifica

# sys_workspace_stage.responsible_persons
source: Responsible persons
ar: الأشخاص المسؤولين
fr: Personnes responsables
it: Responsabili

# sys_workspace_stage.default_mailcomment
source: Default mail comment
ar: تعليق البريد الافتراضي
fr: Commentaire par défaut de l'e-mail
it: Commento Predefinito

# sys_workspace_stage.parentid
source: UID of parent record
ar: UID للسجل الأصلي
fr: UID de l'enregistrement parent
it: UID del record padre

# sys_workspace_stage
source: Workspace Stage
ar: مرحلة مساحة العمل
fr: État de l'espace de travail
it: Fase di Workspace

# tabs.notification_settings
source: Notification settings
ar: إعدادات الإشعارات
fr: Paramètres de notification
it: Notifiche

# tabs.general
source: General
ar: عامّ
fr: Généralités
it: Generale

# tabs.internal_stages
source: Internal Stages
ar: الصفحات الداخلية
fr: Étapes internes
it: Fasi Interne

# tabs.custom_stages
source: Custom Stages
ar: المراحل المُخصصة
fr: Étapes personnalisées
it: Fasi Personalizzate

# tabs.publish_access
source: Publishing / Access
ar: النشر / الوصول
fr: Édition / Accès
it: Pubblicazione / Accesso

# sys_workspace_stage.notification_defaults
source: Default notification recipients
ar: المستلمون الافتراضيّون للإشعارات
fr: Destinataire par défaut des notifications
it: Destinatari Notifica Predefiniti

# sys_workspace_stage.allow_notificaton_settings
source: Allow notification settings during stage change
ar: السماح بإعدادات الإشعار أثناء تغيير المرحلة
fr: Permettre les notifications durant les changements d'état
it: Consente impostazioni di notifica durante il cambiamento di fase

# sys_workspace.palette.stage.edit
source: Stage "editing"
ar: المرحلة "التعديل"
fr: Étape "En cours de rédaction"
it: Fase "Modifica"

# sys_workspace.palette.stage.publish
source: Stage "ready to publish"
ar: المرحلة "جاهز للنشر"
fr: Étape "Prêt à publier"
it: Fase "Pronto per la pubblicazione"

# sys_workspace.palette.stage.execute
source: Stage "publishing execute"
ar: المرحلة "تنفيذ النشر"
fr: Étape "En cours de publication"
it: Fase "Pubblicato - Live"

# sys_workspace.settingsDialog
source: Notification dialog settings
ar: مُربع حوار إعدادات الإشعار
fr: Paramètres de notification
it: Impostazioni Notifiche

# sys_workspace.settingsDialog.showDialog
source: Show Dialog
ar: إظهار مربع الحوار
fr: Afficher la fenêtre
it: Consenti gestione destinatari

# sys_workspace.settingsDialog.changeablePreselection
source: Allow to change pre-selection of recipients
ar: السماح بتغيير الاختيار المُسبق للمستلمين
fr: Autoriser le changement des destinataires pré-sélectionnés
it: Permetti modifica destinatari preselezionati / predefiniti

# sys_workspace.preselection
source: Pre-select recipients
ar: تحديد المستلمين مُسبقاً
fr: Pré-sélectionnez les destinataires
it: Destinatari Notifica Preselezionati

# sys_workspace.preselection.owners
source: Owners
ar: المالكون
fr: Propriétaires
it: Proprietari

# sys_workspace.preselection.members
source: Members
ar: الأعضاء
fr: Membres
it: Membri

# sys_workspace.preselection.editors
source: Editors
ar: المُحرّرون
fr: Éditeurs
it: Creatori

# sys_workspace.preselection.responsiblePersons
source: Responsible Persons
ar: الأشخاص المسؤولين
fr: Personnes responsables
it: Responsabili

# sys_workspace.adminusers
source: Owners
ar: المالكون
fr: Propriétaires
it: Proprietari

# sys_workspace.members
source: Members
ar: الأعضاء
fr: Membres
it: Membri

# sys_workspace.publish_time
source: Auto-publish changes on (requires scheduler task)
ar: نشر التغييرات تلقائيًا على (يحتاج إلى مهمة جدولة)
fr: Publier automatiquement les changements le (nécessite une tâche de planification)
it: Auto-Pubblica le Modifiche il (richiede una attività dello Scheduler)

# sys_workspace.unpublish_time
source: Un-Publish changes on (requires scheduler task)
ar: إلغاء نشر التغييرات تلقائيًا على (يحتاج إلى مهمة جدولة)
fr: Dépublier automatiquement les changements le (nécessite une tâche de planification)
it: Depubblicazione delle modifiche il (richiede attività dello Scheduler)

# sys_workspace.freeze
source: Freeze Editing
ar: تجميد التعديل
fr: Bloquer l'édition
it: Sospendi Modifica

# sys_workspace.live_edit
source: Allow "live" editing of records from tables without versioning
ar: السماح بالتعديل "المباشر" للسجلات من الجداول دون تعيين النسخة
fr: Autoriser l'édition en "live" pour les enregistrements des tables sans suivi de version
it: Consenti la modifica "live" dei record da tabelle senza gestione versione

# sys_workspace.publish_access
source: Publish access
ar: نشر صَلاحِيَة الدخول
fr: Permissions de publication
it: Accesso alla Pubblicazione

# sys_workspace.publish_access.1
source: Publish only content in publish stage
ar: نشر المحتوى فقط في مرحلة النشر
fr: Publier uniquement le contenu prêt à publier
it: Pubblica solo contenuti nella fase "Pronto per la pubblicazione"

# sys_workspace.publish_access.2
source: Restrict publishing to workspace owners
ar: تقييد النشر لمالكي مساحة العمل
fr: Restreindre la publication aux propriétaires de l'espace de travail
it: Limita la pubblicazione ai proprietari del workspace

# sys_workspace.publish_access.3
source: Hide "Entire workspace" action drop down
ar: إخفاء القائمة المُنسدلة لإجراء "مساحة العمل بأكملها"
fr: Masquer le menu déroulant "Tout l'espace de travail"
it: Nascondi l'azione "Tutto il workspace"

# sys_workspace.stagechg_notification
source: Notification settings during state change
ar: إعدادات الإشعارات أثناء تغيير الحالة
fr: Paramètres de notification lors du changement d'étape
it: Notifiche Cambio Fase

# sys_workspace.previewlink_lifetime
source: Lifetime in hours on how long a preview link will be valid
ar: مدة البقاء بالساعات على طول المدة التي سيكون فيها رابط المُعاينة صالحًا
fr: Durée de vie en heures du lien de prévisualisation
it: Durata, in ore, della validità di un collegamento di anteprima

# sys_workspace.stagechg_notification.0
source: Disable notifications
ar: تعطيل الإشعارات
fr: Désactiver les notifications
it: nessuna notifica

# sys_workspace.stagechg_notification.1
source: Notify users of next stage only
ar: إعلام المُستخدمين بالمرحلة التالية فقط
fr: Notifier uniquement les utilisateurs l'étape suivante
it: notifica utenti fase successiva

# sys_workspace.stagechg_notification.10
source: Notify all users on any change
ar: إعلام جميع المُستخدمين بأي تغيير
fr: Notifier tous les utilisateurs de tout changement
it: notifica utenti workspace

# tabs.users
source: Users
ar: المُستخدمون
fr: Utilisateurs
it: Utenti

# tabs.mountpoints
source: Mountpoints
ar: نقطة البناء
fr: Points de montage
it: Montaggi
