Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/workspaces/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

# title
source: Workspaces
ar: مساحاتُ العمل
fr: Espaces de travail
it: Workspace

# noResults
source: No records found.
ar: لم يتم العثور على سجلات.
fr: Aucun enregistrement trouvé.
it: Nessun record trovato.

source: Cancel
ar: إلغاء
fr: Annuler
it: Annulla

source: Entire workspace:
ar: مساحة العمل بأكملها:
fr: Tout l'espace de travail :
it: Tutto il workspace:

source: Choose mass action
ar: اختر إجراء شامل
fr: Choisir un traitement par lot
it: Pubblica / Scarta

source: Choose selection action
ar: اختر إجراء التحديد
fr: Choisissez une action de sélection
it: Pubblica / Scarta

# chooseAction
source: Choose staging action
ar: اختر إجراء مَرحَلي
fr: Choisir une action
it: Cambia fase

source: item
ar: عنصر
fr: élément
it: elemento

source: items
ar: عناصر
fr: éléments
it: elementi

source: Records to display
ar: السجلات المُراد عرضها
fr: Enregistrements à afficher
it: Record da visualizzare

source: review and publish
ar: مُراجعة ونشر
fr: relecture et publication
it: revisiona e pubblica

source: Workspace List
ar: قائمة مساحات العمل
fr: Liste des espaces de travail
it: Elenco Workspace

# editorInLive
source: You are in LIVE workspace. Please select a draft workspace from the top bar menu before you can review and publish changes.
ar: أنت في مساحة عمل LIVE. الرجاء تحديد مُسودة مساحة عمل من الشريط العلوي <unk> <unk> <unk> <unk> <unk> <unk> <unk> حتى تتمكن من مراجعة ونشر التغييرات. <unk> <unk> <unk>.
fr: Vous êtes dans l'espace de travail LIVE. Veuillez sélectionner un espace de travail brouillon à partir de la barre de menu supérieure afin de pouvoir réviser et publier les modifications.
it: Sei nel workspace Live. Seleziona un workspace bozza dalla barra superiore prima di poter revisionare e pubblicare le modifiche.

# moduleOnPageIdZero
source: Please select a page in the page tree to review and publish changes.
ar: الرجاء تحديد صفحة في شجرة الصفحة لمراجعة ونشر التغييرات.
fr: Veuillez sélectionner une page de l'arborescence pour laquelle revoir et publier les modifications.
it: Seleziona una pagina nell'albero delle pagine per rivedere e pubblicare le modifiche.

# admin.noWorkspaceSetup.title
source: No workspace set up!
ar: لم يتم إعداد مساحة العمل!
fr: Aucun espace de travail configuré !
it: Nessun workspace configurato!

# admin.noWorkspaceSetup.message
source: There are currently no workspace records configured in the database. To use the workspace functionality, at least one workspace must be set up on the root page.
ar: حالياً، لا توجد سجلات مساحة العمل تم تكوينها في قاعدة البيانات. لاستخدام وظائف مساحة العمل <unk> <unk> <unk> <unk> <unk>، يجب إعداد مساحة عمل واحدة على الأقل على صفحة الجذر. <unk> <unk> <unk>.
fr: Il n'y a actuellement aucun enregistrement d'espace de travail configuré dans la base de données. Pour utiliser la fonctionnalité d'espace de travail, il faut au minimum qu'un espace de travail soit configuré sur la page racine.
it: Al momento non ci sono workspace configurati. Per usufruire delle funzionalità del workspace, almeno un workspace deve essere configurato sulla root TYPO3.

# admin.noWorkspaceSetup.buttonCreate
source: Create a workspace
ar: إنشاء مساحة عمل
fr: Créer un espace de travail
it: Crea un workspace

# button.editWorkspaceSettings
source: Edit workspace settings
ar: تعديل إعدادات مساحة العمل
fr: Modifier les paramètres de l'espace de travail
it: Modifica le impostazioni del workspace

# actionSendToStage
source: Send to stage
ar: إرسال إلى المرحلة التجريبية
fr: Passer à l'étape
it: Cambio fase

# publish_execute_action_option
source: Publish to LIVE
ar: نشر إلى LIVE
fr: Publier en LIVE
it: Pubblica in Live

source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# runMassAction.done
source: Done processing %d elements
ar: تم معالجة %d عناصر
fr: Traitement de %d éléments effectué
it: Elaborazione di %d elementi terminata

# runMassAction.init
source: init
fr: initialisation
it: inizializzazione

# tooltip.publish
source: Publish version of record
ar: نشر نسخة من السجل
fr: Publier la version de l'enregistrement
it: Pubblica la versione del record

# tooltip.publishAll
source: Really publish entire workspace?
ar: هل تريد حقاً نشر مساحة عمل بأكملها؟
fr: Publication intégrale de l'espace de travail ?
it: Realmente pubblicare tutto il workspace?

# tooltip.discardAll
source: Do you really want to discard changes from the whole workspace?
ar: هل تريد حقاً تجاهل التغييرات من كامل مساحة العمل؟
fr: Voulez-vous vraiment annuler toutes les modifications de l'espace de travail ?
it: Vuoi davvero scartare le modifiche dall'intero workspace?

# window.publish.title
source: Publish version
ar: نشر الإصدار
fr: Publier cette version
it: Pubblica la versione

# window.publish.message
source: Do you really want to publish this version?
ar: هل تريد حقاً نشر هذا الإصدار؟
fr: Voulez-vous vraiment publier cette version ?
it: Vuoi davvero pubblicare questa versione?

# tooltip.publishSelected
source: Really publish selected elements?
ar: هل تريد حقاً نشر العناصر المُحددة؟
fr: Souhaitez-vous publier les éléments sélectionnés ?
it: Sei sicuro di voler pubblicare gli elementi selezionati?

# tooltip.discardSelected
source: Really discard changes of the selected elements?
ar: هل تريد حقاً تجاهل التغييرات في العناصر المُحددة؟
fr: Souhaitez-vous ignorer les modifications des éléments sélectionnés ?
it: Sei sicuro di voler ignorare le modifiche degli elementi selezionati?

# tooltip.affectWholeWorkspace
source: Please note that this will affect all changes in the current workspace, which may be more than you are currently seeing on your screen.
ar: يرجى ملاحظة أن هذا سيؤثر على جميع التغييرات في مساحة العمل الحالية، والتي قد تكون أكثر مما تراه حاليًا على شاشتك.
fr: Notez que ceci affectera tous les changements de l'espace de travail courant, ce qui peut concerner plus d'éléments que ceux que vous voyez actuellement à l'écran.
it: Nota che questo influenzerà tutte le modifiche nel workspace corrente, che può essere più di ciò che stai attualmente vedendo sullo schermo.

# tooltip.generatePagePreview
source: Generate page preview links
ar: إنشاء روابط معاينة الصفحة
fr: Générer un lien de prévisualisation
it: Genera collegamento di anteprima

# tooltip.showChanges
source: Show changes
ar: عرض التغييرات
fr: Afficher les modifications
it: Mostra modifiche

source: Preview Link
ar: رابط المُعاينة
fr: Lien de prévisualisation
it: Collegamento di Anteprima

# error.noResponse
source: The server did not send any response whether the action was successful.
ar: لم يرسل الخادم أي رد ما إذا كان الإجراء ناجحًا أم لا.
fr: Le serveur n'a pas envoyé de réponse même si l'action a été couronnée de succès.
it: Il server non ha inviato alcuna risposta se l'azione ha avuto successo.

source: Row details...
ar: تفاصيل الصف...
fr: Détails...
it: Dettagli riga...

# column.difference
source: Difference
ar: الاختلاف
fr: Différence
it: Differenza

# column.changeDate
source: Modification
ar: التغيير
it: Modifica

# column.stage
source: Current Stage
ar: المرحلة التجريبية الحالية
fr: État actuel
it: Fase corrente

# column.lastChangeOn
source: Last changed on
ar: آخر تغيير في
fr: Dernière modification le
it: Ultima modifica fatta il

# column.actions
source: Actions
ar: الإجراءات
it: Azioni

# column.wsPath
source: Path
ar: المسار
fr: Chemin
it: Percorso

# column.wsTitle
source: Title
ar: العنوان
fr: Titre
it: Titolo

# column.wsStateAction
source: Action
ar: الإجراء
it: Azione

# column.wsStateAction.deleted
source: deleted
ar: مَحذُوف
fr: supprimé
it: eliminato

# column.wsStateAction.hidden
source: hidden
ar: مخفيّ
fr: caché
it: nascosto

# column.wsStateAction.modified
source: modified
ar: مُصَحَّح
fr: modifié
it: modificato

# column.wsStateAction.moved
source: moved
ar: مَنقُول
fr: déplacé
it: spostato

# column.wsStateAction.new
source: created
ar: تم الإنشاء
fr: créé
it: creato

# column.wsStateAction.unchanged
source: unchanged
ar: ‮لم يتغيّر
fr: inchangé
it: invariato

# column.uid
source: WS ID
it: ID WorkSpace

# column.oid
source: Live ID
fr: ID Live
it: ID Live

# column.livePath
source: Live path
ar: المسار المباشر
fr: Chemin Live
it: Percorso Live

# column.integrity
source: Integrity
ar: التكامل
fr: Intégrité
it: Integrità

# tooltip.viewElementAction
source: Preview element
ar: معاينة العنصر
fr: Prévisualisation de l'élément
it: Anteprima elemento

# tooltip.editElementAction
source: Edit element
ar: تعديل العنصر
fr: Modifier l'élément
it: Modifica elemento

# tooltip.openPage
source: Open version of page
ar: افتح نسخة من الصفحة
fr: Ouvrir cette version de la page
it: Apri in 'Pagina'

# tooltip.sendToPrevStage
source: Send record to previous Stage
ar: إرسال سجل إلى المرحلة السابقة
fr: Ramener l'enregistrement à l'état précédent
it: Manda il record alla fase precedente

# tooltip.sendToNextStage
source: Send record to next Stage
ar: إرسال سجل إلى المرحلة التالية
fr: Envoyer l'enregistrement à l'état suivant
it: Manda il record alla fase successiva

# tooltip.discardVersion
source: Discard version of record
ar: تجاهل نسخة من السجل
fr: Abandonner cette version de l'enregistrement
it: Scarta la versione del record

# tooltip.expand
source: Expand element and show relations
ar: توسيع العنصر و إظهار العلاقات
fr: Développer l'élément et afficher les relations
it: Espandi l'elemento e mostra le relazioni

# tooltip.showHistory
source: Show history of workspace version
ar: عرض محفوظات نسخة مساحة العمل
fr: Montrer l'historique de la version du workspace
it: Mostra cronologia delle versioni del workspace

# window.discard.title
source: Discard version of record
ar: تجاهل نسخة من السجل
fr: Abandonner cette version de l'enregistrement
it: Scarta la versione del record

# window.discardAll.title
source: Discard all workspace version of current page.
ar: تجاهل كل نُسَخ مساحة العمل للصفحة الحالية.
fr: Abandonner toutes les versions de la page actuelle dans l'espace de travail.
it: Scarta tutte le versioni bozza della pagina corrente.

# window.discard.message
source: Do you really want to discard this version from workspace?
ar: هل تريد حقاً تجاهل هذه النسخة من مساحة العمل؟
fr: Souhaitez vous vraiment abandonner cette version de l'espace de travail ?
it: Vuoi davvero scartare questa versione dal workspace?

# window.discardAll.message
source: Do you really want to discard all versions from page?
ar: هل تريد حقاً تجاهل جميع النُسَخ من الصفحة؟
fr: Souhaitez vous vraiment abandonner toutes les versions de cette page ?
it: Vuoi davvero scartare tutte le versioni dalla pagina?

# window.massAction.title
source: Prepare to start mass action
ar: الاستعداد لبدء إجراء شامل
fr: Traitement par lots en cours de préparation
it: Preparati ad avviare l'azione massiva

# window.version.published
source: Published version
ar: الإصدار المَنشُور
fr: Version publiée
it: Versione pubblicata

# window.version.staged
source: Staged version
ar: إصدار مَرحَلي
fr: Version à l'étape
it: Versione di fase

# window.selectionAction.title
source: Prepare to execute actions on selection
ar: الاستعداد لتنفيذ الإجراءات عند الاختيار
fr: Exécuter le traitement par lots pour la sélection
it: Preparati ad eseguire azioni sulla selezione

# error.stageId.integer
source: StageId is supposed to be an integer
ar: يجب أن يكون مُعرّف مساحة العمل عددًا صحيحًا
fr: Le StageId est supposé être un entier
it: StageId deve essere un numero intero

# error.stageId.invalid
source: The stage to be used seems to be invalid and cannot be used. Please consider to use the update wizard in the install tool to fix this.
ar: يبدو أن المرحلة التي سيتم استخدامها غير صالحة ولا يمكن استخدامها. يرجى التفكير في استخدام معالج التحديث <unk> <unk> <unk> <unk> <unk> <unk> <unk> wizard في أداة التثبيت لإصلاح ذلك.
fr: L'étape à utiliser semble invalide et ne peut être utilisée. Essayez d'employer l'assistant de mise à jour dans l'outil d'installation Typo3 pour résoudre le problème.
it: La fase che si desidera utilizzare sembrerebbe non valida. Prova a utilizzare l'"Upgrade Wizard" nell'Install Tool per correggere.

# error.sendToNextStage.noRecordFound
source: The record element could not be found.
ar: تعذر العثور على عنصر السجل.
fr: Cet élément ne peut pas être trouvé.
it: Il record non è stato trovato.

# error.sendToPrevStage.noPreviousStage
source: The record element is already in editing stage, there is no previous stage.
ar: عنصر التسجيل في مرحلة التعديل فعلًا، ولا توجد مرحلة سابقة.
fr: L'enregistrement est déjà à l'état en cours de rédaction, il n'y a pas d'état précédent.
it: L'elemento è già nella fase modifica. Non esiste una fase precedente.

# window.sendToNextStageWindow.itemsWillBeSentTo
source: The selected element(s) will be sent to
ar: سيتم إرسال العنصر (العناصر) المحددة إلى
fr: Les éléments sélectionnés seront envoyés
it: La notifica di cambio fase sarà inviata a:

# window.sendToNextStageWindow.selectAll
source: Select all
ar: تحديد الكل
fr: Tout sélectionner
it: Seleziona tutto

# window.sendToNextStageWindow.deselectAll
source: Uncheck all
ar: إلغاء اختيار الكل
fr: Tout désélectionner
it: Deseleziona tutto

# window.sendToNextStageWindow.sendMailTo
source: Send mail to
ar: إرسال البريد إلى
fr: Envoyer le mail à
it: Invia email a

# window.sendToNextStageWindow.additionalRecipients
source: Additional recipients
ar: مستلمين إضافيين
fr: Envoyer une copie à
it: Destinatari aggiuntivi

# window.sendToNextStageWindow.additionalRecipients.hint
source: One recipient per line
ar: مستلم واحد لكل سطر
fr: Un destinataire par ligne
it: Un destinatario per riga

# window.sendToNextStageWindow.comments
source: Comments
ar: التعليقات
fr: Commentaires
it: Commenti

# window.recordChanges
source: Record changes
ar: تغييرات السجل
fr: Enregistrer les modifications
it: Modifiche al record

# window.recordInformation
source: Information for "{0}"
ar: معلومات عن "{0}"
fr: Informations pour "{0}"
it: Informazioni per "{0}"

# window.recordChanges.tabs.changeSummary
source: Summary of changes
ar: مُلخّص التغييرات
fr: Sommaire des changements
it: Ultime modifiche

# window.recordChanges.tabs.comments
source: Comments
ar: التعليقات
fr: Commentaires
it: Commenti

# window.recordChanges.tabs.history
source: History
ar: المحفوظات
fr: Historique
it: Cronologia modifiche

# window.recordHistory
source: History of record "{0}"
ar: محفوظات السجل"{0}"
fr: Historique d'enregistrement "{0}"
it: Cronologia del record "{0}"

# error.getStageTitle.stageNotFound
source: Stage not found
ar: المرحلة غير موجودة
fr: Etape non trouvée
it: Fase non trovata

# info.newpage
source: New Page!
ar: صفحة جديدة!
fr: Nouvelle page !
it: Nuova Pagina!

# info.newpage.detail
source: The previewed page has been created in a workspace and has no live counterpart.
ar: تم إنشاء الصفحة التي تمت معاينتها في مساحة عمل وليس لها نظير مُباشر.
fr: La page prévisualisée a été créée dans un espace de travail et n'a pas de page Live correspondante.
it: La pagina in anteprima è stata creata in un workspace e non ha una controparte "live".

# preview.livePreviewDetail
source: Click this element to hide the workspace version and see the live version of the page.
ar: انقر فوق هذا العنصر لإخفاء نسخة مساحة العمل ومشاهدة النسخة المباشر للصفحة.
fr: Cliquer sur cet élément pour masquer la version de l'espace de travail, et voir la version En ligne de la page.
it: Fai clic su questo elemento per nascondere la versione bozza e vedere la versione live della pagina.

# preview.workspacePreviewDetail
source: Click this element to hide the live version and see the workspace version of the page.
ar: انقر فوق هذا العنصر لإخفاء النسخة المباشرة ومشاهدة نسخة مساحة العمل للصفحة.
fr: Cliquez sur cet élément pour masquer la version live de la page et en voir la version de l'espace de travail.
it: Fai clic su questo elemento per nascondere la versione live e vedere la versione bozza della pagina.

# preview.modeVbox
source: Vertical
ar: عمودي
it: Verticale

# preview.modeHbox
source: Horizontal
ar: أُفُقي
it: Orizzontale

# label_doaction_publish
source: Publish
ar: نشر
fr: Publier
it: Pubblica

# label_doaction_discard
source: Discard
ar: تجاهل
fr: Abandonner
it: Scarta

# label_doaction_generatePreviewLinks
source: Generate Workspace Preview Links
ar: إنشاء روابط معاينة مساحة العمل
fr: Générer des liens de prévisualisation
it: Genera Collegamenti di Anteprima del Workspace

# info.elementAlreadyModified
source: Element is in workspace stage "%s", modifications will send it back to "%s".
ar: العنصر في مرحلة مساحة العمل"%s", التغييرات سوف ترسله مرة أخرى إلى "%s".
fr: L'élément est dans l'état "%s", les modifications vont le renvoyer dans l'état "%s".
it: L'elemento si trova nello fase del Workspace "%s"; le modifiche lo manderanno indietro in "%s".

source: Live Workspace
ar: مساحة العمل الحَيّة Live
fr: Espace de travail Live
it: Workspace Live

source: Workspace version
ar: إصدار مساحة العمل
fr: Version de l'espace de travail
it: Versione workspace

# current_step
source: <b>Current stage step</b>: {0} (<b>{1}</b>/{2})
ar: <b>إعداد المرحلة التجريبية الحالي</b>: {0} (<b>{1}</b>/{2})
fr: <b>État courant</b>: {0} (<b>{1}</b>/{2})
it: <b>Fase</b>: {0} (<b>{1}</b>/{2})

# path
source: <b>Path</b>: {0}
ar: <b>المسار</b>: {0}
fr: <b>Chemin</b> : {0}
it: <b>Percorso</b>: {0}

# stage
source: Stage {0}
ar: المرحلة {0}
fr: État {0}
it: Fase {0}

# comments
source: User comments for <b>step {0} of stage</b> "{1}"
ar: تعليقات المُستخدم على <b>الخطوة {0} من المرحلة</b> "{1}"
fr: Commentaires utilisateur pour l'<b>étape {0} de l'état</b> "{1}"
it: Commenti utente per <b>lo step {0} della fase</b> "{1}"

# language.allLanguages
source: all languages
ar: كل اللغات
fr: Toutes les langues
it: tutte le lingue

# language.selectLanguage
source: all languages
ar: كل اللغات
fr: Toutes les langues
it: tutte le lingue

# integrity.dependsOnDefaultLanguageRecord
source: Record "%s" depends on default language record
ar: سجل "%s" يعتمد على سجل اللغة الافتراضي
fr: L'enregistrement "%s" dépend de la langue de l'enregistrement
it: Il record "%s" dipende dal record con lingua di default

# integrity.isDefaultLanguageRecord
source: Default language record for record "%s"
ar: سجل اللغة الافتراضي للسجل"%s"
fr: Enregistrer dans la langue par défaut pour l'enregistrement "%s"
it: Record con lingua di default per il record "%s"

# window.integrity_warning.title
source: Integrity Warning
ar: تحذير السلامة
fr: Alerte relative à l'intégrité
it: Avviso Integrità

# integrity.hasIssuesDescription
source: The integrity check discovered several issues, see status icons in front of each record for further details.
ar: اكتشف فحص السلامة العديد من المشكلات، راجع أيقونات الحالة أمام كل سجل للحصول على مزيد من التفاصيل.
fr: Plusieurs problèmes ont été détectés dans la vérification de l'intégrité. Pour plus de détails, voir les icônes de statut en face de chaque enregistrement.
it: Il controllo di integrità ha scoperto diversi problemi, vedi le icone di stato di fronte a ogni record per ulteriori dettagli.

# integrity.hasIssuesQuestion
source: Do you want to continue?
ar: هل تريد المُتابعة؟
fr: Voulez-vous continuer ?
it: Vuoi continuare?

# status.info
source: Information
ar: المعلومات
it: Informazioni

# status.warning
source: Warning
ar: تحذير
fr: Attention
it: Attenzione

# status.error
source: Error
ar: خطأ
fr: Erreur
it: Errore

# iframe.livePreview
source: Preview of the live record
ar: معاينة السجل المُباشر
fr: Aperçu de l'enregistrement en "live"
it: Anteprima del record live

# iframe.workspacePreview
source: Preview of the record in workspace %s
ar: معاينة السجل في مساحة العمل %s
fr: Aperçu de l'enregistrement dans l'espace de travail %s
it: Anteprima del record bozza %s

# workingTable.depth
source: Depth
ar: العمق
fr: Profondeur
it: Profondità

# workingTable.languages
source: Languages
ar: اللغات
fr: Langues
it: Lingue

# workingTable.stages
source: Stages
ar: المراحل
fr: Étapes
it: Fasi

# status.has_changes
source: Record was changed in this workspace
ar: تم تغيير السجل في مساحة العمل هذه
fr: L'enregistrement a été modifié dans cet espace de travail
it: Il record è stato cambiato in questo workspace

# status.contains_changes
source: Record contains version records
ar: يحتوي السجل على سِجلات الإصدار
fr: L'enregistrement contient des modifications
it: Il record contiene informazioni di versione

# status.is_new
source: Record was created in this workspace
ar: تم إنشاء السجل في مساحة العمل هذه
fr: L'enregistrement a été créé dans cet espace de travail
it: Il record è stato creato in questo workspace

# moduleMenu.dropdown.label
source: Selected workspace
ar: مساحة عمل المُحدّدة
fr: Espace de travail sélectionné
it: Workspace selezionato

# action.switchToWorkspace
source: Switch to workspace
ar: التبديل إلى مساحة العمل
fr: Basculer vers l'espace de travail
it: Cambia workspace

# toolbarItems.workspace.intro.text
source: The following workspaces are available to you.
fr: Ces espaces de travail vous sont accessibles.
it: I seguenti workspace sono a tua disposizione.

# toolbarItems.workspace.intro.link
source: Workspaces Module
fr: Module Espaces de travail
it: Modulo Workspace

# toolbarItems.workspace.intro.link.description
source: To view changes made in a workspace, please go to:
fr: Pour afficher les modifications effectuées dans un espace de travail, veuillez aller à :
it: Per visualizzare le modifiche apportate in un workspace, vai a:

# toolbarItems.workspace.noWorkspaceFound
source: No workspaces found.
fr: Aucun espace de travail trouvé.
it: Non è stato trovato alcun workspace.

source: Ok
ar: حسناً

# column.workspaceName
source: Workspace
ar: مساحة العمل
fr: Espace de travail

# preview.livePreview
source: Live
ar: مباشر

# preview.workspacePreview
source: Workspace
ar: مساحة العمل
fr: Espace de travail

# preview.modeSlider
source: Slider
ar: شريط التمرير
fr: Curseur

# toolbarItems.workspace
source: Workspace
fr: Espace de travail
