Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/linkvalidator/Resources/Private/Language/Module/*.locallang.xlf
Languages: ar, it

source: LinkValidator
ar: مُدقق الروابط
it: Validatore Collegamenti

# overview.headline
source: Link check
it: Verifica link

# overview.headlineWithPageTitle
source: Link check of page "%s"
it: Verifica link della pagina "%s"

# hooks.db
source: Internal Links
ar: الروابط الداخلية
it: Collegamenti interni

# hooks.file
source: File Links
ar: ملفات للتحميل "File Links"
it: Collegamenti a File

# hooks.external
source: External Links
ar: الروابط الخارجية
it: Collegamenti esterni

# filter.depth
source: Depth
it: Profondità

# label_refresh
source: Refresh display
ar: تحديث العرض
it: Aggiorna il rapporto

# label_update
source: Check links
ar: التحقق من الروابط
it: Verifica i collegamenti

# list.check.headline
source: Configuration
it: Configurazione

# list.header
source: Listing of broken links
ar: قائمة بالروابط الناقصة
it: Elenco collegamenti interrotti

# list.tableHead.errorMessage
source: Error message
it: Messaggio di errore

# list.tableHead.field
source: Field
it: Campo

# list.tableHead.lastCheck
source: Last check
ar: آخر تحقق
it: Ultima verifica

# list.tableHead.linkTarget
source: Link target
it: Target del collegamento

# list.tableHead.linkText
source: Link text
it: Testo del collegamento

# list.tableHead.linkType
source: Link type
it: Tipo di collegamento

# list.tableHead.page
source: Located on page / folder
it: Posizionato sulla pagina / cartella

# list.tableHead.parentPage
source: Parent page / folder
it: Pagina / cartella padre

# list.tableHead.table
source: Table
it: Tabella

# list.tableHead.title
source: Title
it: Titolo

# list.tableFoot.record
source: Records
it: Record

# list.tableFoot.records
source: Records
it: Record

# list.edit
source: Edit record containing this broken link
it: Modifica il record contenente questo collegamento interrotto

# list.editField
source: Edit only the field containing this broken link
it: Modifica solo il campo contenente questo collegamento interrotto

# list.report.btn.info.title
source: Display information
it: Mostra informazioni

# list.report.linkText.noValue
source: [No value]
it: [Nessun valore]

# list.report.pagedeleted
source: Page '###title###' (id=###uid###) is deleted.
it: La pagina '###title###' (id=###uid###) è eliminata.

# list.report.pagenotvisible
source: Page '###title###' (id=###uid###) is not visible.
it: La pagina '###title###' (id=###uid###) non è visibile.

# list.report.pagenotexisting
source: Page (id=###uid###) does not exist.
it: La pagina (id=###uid###) non esiste.

# list.report.contentmoved
source: Record '###title###' (id=###uid###) is not located on page ###wrongpage###, but on page ###rightpage###.
it: Il record '###title###' (id=###uid###) non si trova nella pagina ###wrongpage###, ma nella pagina ###rightpage###.

# list.report.contentdeleted
source: Record '###title###' (id=###uid###) is deleted.
it: Il record '###title###' (id=###uid###) è eliminato.

# list.report.contentnotvisible
source: Record '###title###' (id=###uid###) is not visible.
it: Il record '###title###' (id=###uid###) non è visibile.

# list.report.contentnotexisting
source: Record (id=###uid###) does not exist.
it: Il record (id=###uid###) non esiste.

# list.report.noinformation
source: No information about the error is available.
ar: لا توجد معلومات مُتاحة حول الخطأ.
it: Non esistono informazioni più precise su questo errore.

# list.report.redirectloop
source: A redirect loop occurred. (%s: %s)
ar: تم إعادة توجيه الحلقة (%s: %s)
it: Si è verificato un reindirizzamento ciclico. (%s: %s)

# list.report.tooManyRedirects
source: Too many redirects.
ar: هناك عمليات إعادة توجيه كثيرة جداً.
it: Troppi reindirizzamenti.

# list.report.filenotexisting
source: File doesn't exist.
ar: الملف غير موجود.
it: Il file non esiste.

# linkcheck.error.external.generic
source: External link is broken.
ar: الرابط الخارجي ناقص.
it: Il collegamento esterno non funziona.

# list.report.couldnotresolvehost
source: Could not resolve host. The given remote host was not resolved.
ar: تعذّر حل المضيف. المضيف البعيد المعطى لم يتم حله.
it: L'host non può essere risolto. L'host remoto inserito non è stato risolto.

# list.report.errornetworkdata
source: Failure with receiving network data.
ar: فشل في تلقي بيانات الشبكة.
it: Errore nel ricevere dati via rete.

# list.report.otherhttpcode
source: An error occurred (%s): "%s".
ar: حدث خطأ ما (%s): "%s".
it: Si è verificato un errore (%s): "%s".

# list.report.httpexception
source: Exception: %s
ar: استثناء: %s
it: Eccezione: %s

# list.report.networkexception
source: Network error / invalid domain
ar: خطأ في الشبكة / نطاق غير صالح
it: Errore di rete / dominio non valido

# list.report.error.httpstatuscode.300
source: Multiple Choices (300).
ar: خيارات مُتعددة (300).
it: Scelte Multiple (300).

# list.report.error.httpstatuscode.305
source: Use proxy (305).
ar: (305) استخدام الوَكيل "proxy".
it: Usa proxy (305).

# list.report.pageforbidden403
source: Accessing this address is not allowed (403).
ar: غير مسموح بالوصول إلى هذا العنوان (403).
it: L'accesso a questo indirizzo non è consentito (403).

# list.report.pagenotfound404
source: The requested URL was not found (404).
it: L'URL richiesto non è stato trovato (404).

# list.report.internalerror500
source: Internal Server Error (500)
ar: خطأ داخلي في الخادم (500)
it: Errore interno al Server (500)

# list.report.externalerror
source: External Link returned HTTP error code (%s).
ar: الرابط الخارجي أعاد رمز HTTP خاطئ (%s).
it: Il collegamento esterno ha restituito un codice di errore HTTP (%s).

# list.report.networkexception
source: Unsupported protocol.
ar: بروتوكول غير مدعوم.
it: Protocollo non supportato.

# list.report.networkexception
source: Initialization failed.
ar: فشلت التهيئة.
it: Inizializzazione non riuscita.

# list.report.networkexception
source: The URL was not properly formatted.
ar: لم يتم تنسيق عنوان URL بشكل صحيح.
it: L'URL non è stato formattato correttamente.

# list.report.networkexception
source: Feature not supported.
ar: المِيزة غير مدعومة.
it: Funzionalità non supportata.

# list.report.networkexception
source: Couldn't resolve proxy.
ar: تعذر حل الوَكيل "proxy".
it: Impossibile risolvere il proxy.

# list.report.networkexception
source: Couldn't resolve host.
ar: تعذر حل المُضيف.
it: Impossibile risolvere l'host.

# list.report.networkexception
source: Failed to connect to host or proxy.
ar: فشل الاتصال بالمضيف أو الوَكيل "proxy".
it: Connessione all'host o al proxy non riuscita.

# list.report.networkexception
source: The remote server sent data that could not be parsed.
ar: أرسل الخادم البعيد بيانات لا يمكن تحليلها.
it: Il server remoto ha inviato dati che non possono essere analizzati.

# list.report.networkexception
source: Access denied.
ar: غير مسموح لك بالوُصول.
it: Accesso negato.

# list.report.networkexception
source: Generic HTTP/2 error.
ar: خطأ عام في HTTP/2.
it: Errore generico HTTP/2.

# list.report.networkexception
source: A file transfer was shorter or larger than expected.
ar: كان نقل المِلَفّ أقصر أو أطول مما كان متوقّعاً.
it: Un trasferimento di file è stato più breve o più grande del previsto.

# list.report.networkexception
source: Timeout: The remote server possibly took too long to answer.
ar: نفِذ الوقت: ربما استغرق الخادم البعيد وقتاً طويلاً للاستجابة.
it: Timeout: il server remoto, probabilmente, ha un tempo di risposta troppo lungo.

# list.report.networkexception
source: Problem with SSl / TLS handshake.
ar: يوجد مشكلة في إنشاء الاتصال SSl / TLS.
it: Problema con l'handshake SSl / TLS.

# list.report.networkexception
source: Too many redirects.
ar: هناك عمليات إعادة توجيه كثيرة جداً.
it: Troppi reindirizzamenti.

# list.report.networkexception
source: General network error. Send failed.
ar: خطأ عام في الشبكة. فشل الإرسال.
it: Errore generale di rete. Invio non riuscito.

# list.report.networkexception
source: General network error. Receive failed.
ar: خطأ عام في الشبكة. فشل الاستلام.
it: Errore generale di rete. Ricezione fallita.

# list.report.networkexception
source: The remote server's SSL certificate was deemed not OK.
ar: تم اعتبار شهادة الخادم البعيد SSL غير صالحة.
it: Il certificato SSL del server remoto è stato ritenuto non OK.

# list.report.networkexception
source: Maximum file size exceeded.
ar: تم تجاوز الحجم الأقصى للملف.
it: Dimensione massima del file superata.

# list.no.broken.links.title
source: No broken links found
it: Non sono stati trovati link interrotti

# list.no.broken.links
source: There are no broken links for the selected link type restriction.
it: Non ci sono link interrotti per il tipo di link selezionato.

# no.access.title
source: No access!
ar: لا يمكن الوصول!
it: Nessun accesso!

# no.access
source: You do not have access to these listings.
ar: ليس لديك حق الدخول إلى هذه القوائم.
it: Non hai accesso a questi elenchi.

# label_update-link-list
source: Checking links, please stand by.
ar: جاري فحص الروابط، يرجى الانتظار.
it: Sto verificando. Attendi per favore.

# label_refresh-link-list
source: Refreshing link list, please stand by.
ar: جاري تحديث قائمة الروابط، يرجى الانتظار.
it: Sto aggiornando. Attendi per favore.

source: Needs recheck
ar: يحتاج إلى إعادة فحص
it: Richiede ricontrollo

# info.noPageSelected.message
source: Please select a page in the page tree.
it: Per favore seleziona una pagina nell'Albero delle Pagine.

# report.modal.info.title
source: Broken link
it: Collegamento interrotto

# report.modal.info.title.withLinkText
source: Broken link: "%s"
it: Collegamento interrotto: "%s"

# report.modal.info.headline.link
source: Link properties
it: Proprietà del collegamento

# report.modal.info.headline.record
source: Record information
it: Informazioni record

# list.msg.ok
source: Ok
ar: حسناً
