Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/linkvalidator/Resources/Private/Language/Module/*.locallang_csh.xlf
Languages: ar, de, fr

# checkboxes.description
source: Click the following checkboxes to consider or to ignore the corresponding broken links.
ar: انقر على مربعات الاختيار التالية للنظر أو لتجاهل الروابط الناقصة المتطابقة.
de: Wählen Sie aus den folgenden Optionen, um die entsprechenden defekten Links zu berücksichtigen oder zu ignorieren.
fr: Cliquez sur les cases à cocher suivantes pour prendre en considération ou pour ignorer les liens cassés correspondants.

# tablehead_path.description
source: Path to the content element, which contains the broken link.
ar: المسار إلى عنصر المحتوى، الذي يحتوي على الرابط الناقص.
de: Pfad zum Inhaltselement mit dem defekten Link.
fr: Chemin vers l'élément de contenu, qui contient le lien cassé.

# tablehead_element.description
source: Type of the element containing the broken link, its headline and the field in which the broken link is located.
ar: نوع العنصر الذي يحتوي على الرابط الناقص وعنوانه والحقل الذي يوجد فيه الرابط الناقص.
de: Typ des Elements, das den defekten Link enthält, seine Überschrift und das Feld, in dem sich der defekte Link befindet.
fr: Type de l'élément contenant le lien cassé, son titre et le champ dans lequel le lien cassé est situé.

# tablehead_headlink.description
source: The linking text.
ar: نَصْ الرابط.
de: Der verlinkende Text.
fr: Le texte du lien.

# tablehead_linktarget.description
source: URL to which the broken link is pointing.
ar: عنوان URL الذي يشير إليه الرابط الناقص.
de: URL, auf die der defekte Link zeigt.
fr: URL vers laquelle pointe le lien cassé.

# tablehead_linkmessage.description
source: Status of that link.
ar: حالة ذلك الرابط.
de: Status des Links.
fr: Statut de ce lien.

# tablehead_lastcheck.description
source: Date and time of the last update of the information in each table row.
ar: تاريخ ووقت آخر تحديث للمعلومات في كل صف من صفوف الجدول.
de: Datum und Uhrzeit der letzten Aktualisierung der Informationen in jeder Tabellenzeile.
fr: Date et heure de la dernière mise à jour des informations dans chaque ligne du tableau.

# task_page.alttitle
source: Start page of the task
ar: صفحة البداية للمَهمّة
de: Startseite des Tasks
fr: Page racine de la tâche

# task_page.description
source: UID of the start page for this task.
ar: UID لصفحة البداية لهذه المهمة.
de: UID der Startseite für diesen Task.
fr: UID de la page racine pour cette tâche.

# task_depth.alttitle
source: Depth of the task
ar: عمق المهمة
de: Tiefe des Tasks
fr: Profondeur de la tâche

# task_depth.description
source: Level of pages the task should check.
ar: مستوى الصفحات التي يجب أن تتحقق منها المهمة.
de: Anzahl der Seitenebenen, die dieser Task überprüfen soll.
fr: Niveau des pages que la tâche doit vérifier.

# task_configuration.alttitle
source: Special TSconfig code
ar: رمز TSconfig مخصص
de: Besondere TSconfig-Werte
fr: Code TSconfig spécial

# task_configuration.description
source: TSconfig code, which defines settings for the LinkValidator to be used for this task.
ar: كود TSconfig، الذي يُحدد الإعدادات لاستخدام LinkValidator لهذه المهمة.
de: TSconfig-Code, der Einstellungen definiert, die der LinkValidator für diesen Task nutzen soll.
fr: Code TSconfig définissant les paramètres du validateur de lien (LinkValidator) à utiliser pour cette tâche.

# task_email.alttitle
source: Email address
ar: عنوان البريد الإلكتروني
de: E-Mail-Adresse
fr: Adresse mail

# task_email.description
source: Email address to which an email report is sent.
ar: عنوان البريد الإلكتروني الذي تم إرسال تقرير البريد الإلكتروني إليه.
de: E-Mail-Adresse, zu der der E-Mail-Bericht geschickt wird.
fr: Adresse e-mail à laquelle un mail de rapport est envoyé.

# task_emailonbrokenlinkonly.alttitle
source: Mailing option
ar: خيار البريد
de: Mail-Optionen
fr: Options d'envoi

# task_emailonbrokenlinkonly.description
source: Only send an email, if new broken links were found.
ar: إرسال بريد إلكتروني فقط، إذا تم العثور على روابط معطلة جديدة.
de: Nur eine Mail versenden, wenn neue defekte Links gefunden wurden.
fr: N'envoyez un courriel que si de nouveaux liens cassés ont été trouvés.

# task_emailfile.alttitle
source: Email template file
ar: ملف قالب البريد الإلكتروني
de: Datei für E-Mail-Vorlage
fr: Fichier gabarit du courriel

# task_emailfile.description
source: Define a template to be used for the email.
ar: حدد قالب لاستخدامه في البريد الإلكتروني.
de: Legt eine Vorlagendatei fest, die zum Versenden der E-Mail benutzt wird.
fr: Définir un modèle à utiliser pour le courriel.
