Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/extensionmanager/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

source: Extension Manager
ar: مدير الإضافات
it: Gestore Estensioni

source: Manage Extensions
ar: إدارة الإضافات
it: Gestisci Estensioni

source: Install Extension
ar: تثبيت الإضافة
it: Installa Estensione

# composerMode.title
source: Composer mode
ar: وضع الـ Composer
it: Modalità Composer

# composerMode.message
source: The system is set to composer mode. Please notice that it is this list is for informational purpose only. To modify which extensions are part of the system, use Composer. To set extensions up, use the TYPO3 cli (extension:setup)
ar: تم ضبط النظام إلى وضع composer. يرجى ملاحظة أنها هذه القائمة لغرض المعلومات فقط. لتعديل أي إضافات من النظام، استخدم composer. لضبط الإضافات، استخدم TYPO3 cli (إضافة :setup)
it: Il sistema è impostato in modalità Composer. Questo elenco è solo informativo. Per modificare le estensioni, che fanno parte del sistema, usa Composer. Per impostare le estensioni usa il cli di TYPO3 (extension:setup)

source: Installed Extensions
ar: الإضافات المُثبّتة
it: Estensioni Installate

# extensionComposerStatus
source: Composer Support of Extensions
ar: دعم composer للإضافات
it: Supporto Composer delle Estensioni

source: Get Extensions
ar: احصل على الإضافات
it: Installa Nuove Estensioni

# showAllVersions
source: Show all versions of
ar: إظهار جميع الإصدارات لـ
it: Mostra tutte le versioni di

# extConfTemplate.backToList
source: Back to list
ar: العودة إلى القائمة
it: Torna all'elenco

# button.cancel
source: Cancel
ar: إلغاء
it: Annulla

# button.details
source: Show Details
ar: عرض التفاصيل
it: Mostra Dettagli

# button.remove
source: Remove extension
ar: إزالة إضافة
it: Rimuovi estensione

# button.reimport
source: Re-import data
ar: إعادة استيراد البيانات
it: Reimporta i dati

# button.updateExtension
source: Update extension
ar: تحديث الإضافة
it: Aggiorna estensione

# button.resolveDependencies
source: Resolve dependencies
ar: حل التبعيات
it: Risolvi le dipendenze

# label.resolveDependenciesEnableButton
source: I understand what this means and I'm able to investigate on possibly occurring issues by myself.
ar: أنا أفهم ما يعنيه هذا، وقادر بنفسي على التحقق في القضايا التي قد تنتج.
it: Comprendo cosa ciò significa e sono in grado di investigare da solo sui problemi che potrebbero eventualmente accadere.

# button.resolveDependenciesIgnore
source: I know what I'm doing, continue anyway
ar: أنا أعرف ما أفعله، أستمر على أي حال
it: So quello che faccio, continuo comunque

# extensionList.downloadsql
source: Download SQL Dump
ar: تحميل SQL Dump
it: Scarica SQL Dump

# extensionList.remove
source: Remove
ar: إزالة
it: Rimuovi

# extensionList.update
source: Update
ar: تحديث
it: Aggiorna

# extensionList.updateToVersion
source: Update to version %s
ar: التحديث إلى الإصدار %s
it: Aggiorna alla versione %s

# extensionList.updateDisabled
source: An update is available but this operation is currently disabled
ar: يتوفر تحديث ولكن هذه العملية مُعطّلة حالياً
it: Un aggiornamento è disponibile, ma questa operazione è attualmente disabilitata

# extensionList.deactivate
source: Deactivate
ar: تعطيل
it: Disattiva

# extensionList.activate
source: Activate
ar: تفعيل
it: Attiva

# extensionList.downloadzip
source: Download as zip
ar: تحميل كملف مضغوط
it: Scarica come zip

# extensionList.uploadExtension
source: Upload Extension
ar: تحميل إضافة
it: Carica Estensione

# extensionList.overwriteExtension
source: Overwrite
ar: الكتابة فوق
it: Sovrascrivi

# extensionList.composerStatus.information
source: Future TYPO3 versions will require all extensions in your TYPO3 installation to contain a composer.json file in their extension directory. This is needed to properly detect the composer-based package name, the relevant extension key and the dependencies to other packages / extensions. Below is a list of extensions in your TYPO3 installation, which currently do not meet those requirements and therefore need adaptations to their composer.json file.
ar: سوف تتطلب إصدارات TYPO3 في المستقبل جميع الإضافات في تثبيت TYPO3 الخاص بك لكي تحتوي على ملف <unk> <unk> <unk> <unk> <unk> composer.json في دليل الإضافات الخاص بها. هذا مطلوب للكشف بشكل صحيح عن <unk> <unk> <unk> <unk> <unk> composer، اسم الحزمة القائمة على composer، مفتاح الإضافة ذي الصلة والتبعيات إلى الحزم الأخرى / <unk> <unk> <unk> <unk> <unk> . فيما يلي قائمة بالإضافات في تثبيت TYPO3 الخاص بك، التي لا تستوفي حاليا <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> تلك المتطلبات، ومن ثم تحتاج إلى تعديلات مِلَفّ composer.json.
it: Le future versioni di TYPO3 richiederanno che tutte le estensioni, nell'installazione di TYPO3, debbano contenere un file composer.json nella loro cartella. Questo è necessario per rilevare correttamente il nome del pacchetto basato sul Composer, la relativa chiave-estensione e le dipendenze da altri pacchetti / estensioni. Di seguito è riportato un elenco di estensioni nella tua installazione TYPO3, che attualmente non soddisfano quei requisiti e quindi hanno bisogno di adattamenti al loro file composer.json.

# extensionList.composerStatus.thirdParty
source: For third-party extensions that were fetched from TER, it is helpful to update to their latest version from TER which probably already contains a valid composer.json file.
ar: بالنسبة للإضافة من طرف ثالث الذي تم إحضاره من TER، من المفيد التحديث إلى أحدث نسخة <unk> <unk> <unk> <unk> <unk> من TER التي ربما تحتوي فعلًا على ملف composer.json صالح.
it: Per le estensioni di terze parti, che sono state installate da TER, è utile aggiornare alla loro ultima versione che probabilmente contengono già un file composer.json valido.

# extensionList.composerStatus.missingManifest
source: Missing composer.json file
ar: ملف composer.json مفقود
it: File composer.json mancante

# extensionList.composerStatus.terRequest
source: To support you creating a valid composer.json file for your extensions, TYPO3 will send your ext_emconf.php contents to TYPO3.org (TER). TYPO3.org will then resolve your dependencies and return a valid composer.json proposal which can be copied to the corresponding extension directory. This is especially helpful in case your TYPO3 installation contains custom extensions.
ar: لدعمك في إنشاء ملف صالح لـ composer.json للإضافات الخاصة بك، سيقوم TYPO3 بإرسال <unk> <unk> <unk> <unk> <unk> <unk> ext_emconf. محتويات Hp إلى TYPO3.org (TER). سوف يحل TYPO3.org التبعيات الخاصة بك و <unk> <unk> <unk> <unk> <unk> عائد ملف composer.json صالح. اقتراح الذي يمكن نسخه إلى دليل الإضافة المقابل. <unk> <unk> <unk> <unk> <unk> هذا مفيد بشكل خاص في حالة أن يكون تثبيت TYPO3 يحتوي على إضافات مخصصة.
it: Per supportarti nella creazione di un file composer.json valido per le estensioni, TYPO3 invierà il contenuto del tuo file ext_emconf.php a TYPO3.org (TER). TYPO3.org risolverà le tue dipendenze e ti restituirà un file composer.json valido, come proposta, che può essere copiato nella corrispondente cartella dell'estensione. Questo è particolarmente utile nel caso in cui la tua installazione di TYPO3 contenga estensioni personalizzate.

# extensionList.composerStatus.additionalInformation
source: For more information regarding the migration and the upcoming changes, please have a look at
ar: للحصول على مزيد من المعلومات حول الترحيل والتغييرات القادمة، يرجى إلقاء نظرة على
it: Per ulteriori informazioni sulla migrazione e le prossime modifiche, si prega di dare un'occhiata a

# extensionList.showComposerProposal
source: Show composer.json proposal
ar: إظهار مقترح composer.json
it: Mostra il file composer.json proposto

# extensionList.fetchComposerProposal
source: Check TYPO3.org for composer.json proposal
ar: تحقق من TYPO3.org للحصول على اقتراح composer.json
it: Controlla TYPO3.org per la proposta del file composer.json

# extensionList.fetchComposerProposal.details
source: Send this extensions' ext_emconf.php contents to TYPO3.org for a valid and resolved composer.json proposal
ar: إرسال محتويات هذه الإضافات ext_emconf.php إلى TYPO3.org للحصول على اقتراح صالح ومحل composer.json
it: Invia il contenuto del file ext_emconf.php, di queste estensioni, a TYPO3.org, per ottenere una proposta di un file composer.json valido

# extensionList.overwritingDisabled
source: Extension is already available and overwriting was not enabled
ar: الإضافة مُتاحة بالفعل ولم يتم تفعيل الكتابة فوقها
it: L'estensione è già presente e la sovrascrittura non è abilitata

# extensionList.loading
source: Loading form...
ar: تحميل النموذج...
it: Caricamento...

# extensionList.header.title.update
source: Update
ar: تحديث
it: Aggiorna

# extensionList.header.title.activate
source: Activate / Deactivate
ar: تفعيل / تعطيل
it: Attiva / Disattiva

# extensionList.header.extensionName
source: Extension
ar: الإضافة
it: Estensione

# extensionList.header.version
source: Version
ar: الإصدار
it: Versione

# extensionList.header.extensionKey
source: Key
ar: المفتاح
it: Chiave

# extensionList.header.extensionVersion
source: Version
ar: الإصدار
it: Versione

# extensionList.header.extensionActions
source: Actions
ar: الإجراءات
it: Azioni

# extensionList.header.extensionState
source: State
ar: الحالة
it: Stato

# extensionList.header.extensionDeficit
source: Deficit
ar: عجز

# extensionList.header.extensionType
source: Type
ar: النوع
it: Tipo

# extensionList.header.uploadComment
source: Upload Comment
ar: تحميل التعليق
it: Carica Commento

# extensionList.header.lastUpdate
source: Last Updated
ar: آخر تحديث
it: Aggiornato il

# extensionList.header.description
source: Description
ar: الوَصف
it: Descrizione

# extensionList.header.author
source: Author
ar: المُؤلّف
it: Autore

# extensionList.header.manual
source: Manual
ar: الدليل
it: Manuale

# searchTemplate.searchExtensions
source: Search extensions
ar: إضافات البحث
it: Cerca estensioni

# extensionList.search
source: Search term
ar: مصطلح البحث
it: Cerca termine

# extensionList.filter.showAll
source: All
ar: الكل
it: Tutti

# extensionList.filter.showSystemExtensions
source: System
ar: النظام
it: Sistema

# extensionList.filter.showLocalExtensions
source: Local
ar: مَحلّي
it: Locale

# searchTemplate.submitButton
source: Go
ar: إبدأ
it: Vai

# searchTemplate.resetSearchButton
source: Reset Search
ar: إعادة ضبط البحث
it: Reimposta Ricerca

# searchTemplate.yourSearch
source: Your search
ar: البحث الخاص بك
it: La tua ricerca

# searchTemplate.searchAgain
source: Search again
ar: البحث مجدداً
it: Cerca di nuovo

# uploadTemplate.uploadButton
source: Upload!
ar: تحميل!
it: Carica!

# uploadTemplate.extensionLabel
source: Extension
ar: الإضافة
it: Estensione

# extensionList.removalConfirmation.title
source: Extension Removal
ar: إزالة الإضافة
it: Rimozione Estensione

# extensionList.removalConfirmation.message
source: The extension is currently installed. Uninstall extension?
ar: الإضافة مُثبتة حالياً. إلغاء تثبيت الإضافة؟
it: L'estensione è attualmente installata. Disinstallare l'estensione?

# extensionList.updateConfirmation.title
source: Update?
ar: تحديث؟
it: Aggiornare?

# extensionList.updateConfirmation.message
source: Update Comments
ar: تحديث التعليقات
it: Commenti Aggiornamento

# extensionList.databaseImport
source: The static database data has changed. You should re-import the data.
ar: لقد تغيرت بيانات قاعدة البيانات الثابتة. يجب عليك إعادة استيراد البيانات.
it: I dati statici del database sono cambiati. E' necessario reimportare i dati.

# extensionList.databaseReload
source: Nothing has changed since last import. You might want to reload static database data.
ar: لم يتغير أي شيء منذ الاستيراد الأخير. قد ترغب في إعادة تحميل بيانات قاعدة البيانات الثابتة.
it: Nulla è cambiato dall'ultima importazione. Potresti voler ricaricare i dati statici del database.

# extensionList.databaseReload.title
source: Re-import of static database data
ar: إعادة استيراد بيانات قاعدة البيانات الثابتة
it: Reimportazione dei dati statici del database

# extensionList.databaseReload.message
source: This re-import will overwrite any existing static data in the database.
ar: ستؤدي إعادة الاستيراد هذه إلى الكتابة فوق أي بيانات ثابتة موجودة في قاعدة البيانات.
it: Questa reimportazione sovrascriverà tutti i dati statici esistenti nel database.

# extensionList.updateConfirmation.questionVersionComments
source: Version Comments
ar: تعليقات الإصدار
it: Commenti Versione

# extensionList.updateFlashMessage.title
source: Extension Update
ar: تحديث الإضافة
it: Aggiornamento Estensione

# extensionList.updateFlashMessage.body
source: %s was updated!
ar: تم تحديث %s!
it: %s caricata!

# extensionList.removalConfirmation.question
source: Are you sure you want to remove the extension?
ar: هل أنت متأكد أنك تريد إزالة هذه الإضافة؟
it: Sei sicuro di voler rimuovere l'estensione?

# dependencyCheck.unresolvedDependencies.title
source: Please read this carefully
ar: يُرجى القراءة بعناية
it: Si prega di leggere attentamente

# dependencyCheck.unresolvedDependencies.message
source: If you continue installing the extension, all dependency checks will be turned off. <ul> <li>Required extensions are tried to be fetched from TER (if they do not yet exist in the system)</li> <li>Version dependency checks are skipped</li> </ul> <strong> Be aware that an installation without dependency checks may turn your installation unusable.<br /> In such a case manual intervention is required. </strong>
ar: إذا استمريت في تثبيت الإضافة، سيتم إيقاف جميع عمليات التحقق من الاعتمادية. <unk> <unk> <unk> <ul> <unk> <unk> <unk> <unk> <li>يتم محاولة جلب الإضافات المطلوبة من TER (إذا لم تكن موجودة بعد في النظام)</li> <unk> <unk> <unk> <unk> <unk> <unk> <li>تم تخطي عمليات التحقق من اعتماد الإصدار</li> <unk> <unk> <unk> <unk> <unk> <unk> </ul> <unk> <unk> <unk> <unk> <unk> <strong> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> كن على علم بأن التثبيت بدون التحقق من الاعتمادية قد يجعل التثبيت الخاص بك غير قابل للاستعمال.<br /> <unk> <unk> <unk> <unk> <unk> <unk> <unk> في مثل هذه الحالة من المطلوب التدخل اليدوي <unk> <unk> <unk> </strong>
it: Se continui a installare l'estensione, tutti i controlli di dipendenza saranno disattivati. <ul> <li>Le estensioni richieste saranno scaricate dal TER (se ancora non presenti nel sistema)</li> <li>I controlli di dipendenza della versione saranno omessi</li> </ul> <strong> Sii consapevole che un'installazione senza controlli di dipendenza può rendere la tua installazione inutilizzabile.<br /> In tal caso sarà richiesto un intervento manuale. </strong>

# dependencyCheck.unresolvedDependencies.question
source: Are you sure you want to proceed?
ar: هل أنت متأكد من أنك تريد المتابعة؟
it: Sei sicuro di voler continuare?

# dependencyCheck.unresolvedDependencies.proceed
source: I know what I'm doing, install the extension!
ar: أنا أعرف ماذا أفعل، قم بتثبيت الإضافة!
it: So quello che sto facendo, installa l'estensione!

# dependencyCheck.headline
source: The following errors were found while trying to install "%s"
ar: تم العثور على الأخطاء التالية أثناء محاولة تثبيت "%s"
it: I seguenti errori sono stati rilevati durante l'installazione di "%s"

# dependencyCheck.requiredExtension
source: Required extension "%s"
ar: الإضافة المطلوبة "%s"
it: Richiede estensione "%s"

# downloadExtension.dependencies.headline
source: The following dependencies have to be resolved before installation:
ar: يجب حل التبعيات التالية قبل التثبيت:
it: Le seguenti dipendenze devono essere risolte prima dell'installazione:

# downloadExtension.dependencies.extensionWithVersion
source: %1$s (new version %2$s)
ar: %1$s (إصدار جديد %2$s)
it: %1$s (nuova versione %2$s)

# downloadExtension.dependencies.typeHeadline
source: <h3>Extensions marked for %s:</h3> %s
ar: <h3>الإضافات المُشار عليها لـ %s:</h3> %s
it: <h3>Estensioni contrassegnate per %s:</h3> %s

# downloadExtension.dependencies.resolveAutomatically
source: Shall these dependencies be resolved automatically?
ar: هل يمكن حل هذه التبعيات تلقائياً؟
it: Risolvere le dipendenze in modo automatico?

# downloadExtension.dependencies.errorTitle
source: Dependencies could not be resolved
ar: لا يمكن حل التبعيات
it: Le dipendenze non possono essere risolte

# downloadExtension.dependencies.errorMessage
source: The dependencies of the following Extensions could not be resolved
ar: لم يتسن حل التبعيات التالية
it: Le dipendenze delle seguenti Estensioni non possono essere risolte

# downloadExtension.dependencyType.download
source: download
ar: تحميل
it: scarica

# downloadExtension.dependencyType.install
source: install
ar: تثبيت
it: installa

# downloadExtension.dependencyType.update
source: update
ar: تحديث
it: aggiorna

# downloadExtension.updateExtension.error
source: Error while updating extension
ar: حدث خطأ خلال تحديث الإضافة
it: Errore durante l'aggiornamento dell'estensione

# extensionList.dependenciesResolveDownloadError.title
source: Download Error
ar: خطأ في التحميل
it: Errore di Scaricamento

# extensionList.dependenciesResolveInstallError.title
source: Install Error
ar: خطأ في التثبيت
it: Errori di Installazione

# extensionList.dependenciesResolveInstallError.message
source: Your installation failed while resolving dependencies.
ar: فشلت عملية التثبيت الخاصة بك خلال حل التَبعِيات.
it: Installazione fallita durante la risoluzione delle dipendenze.

# extensionList.dependenciesResolveDownloadSuccess.message
source: Your installation of {0} was successful.
ar: تم تثبيت {0} بنجاح.
it: L'installazione di {0} è avvenuta con successo.

# extensionList.dependenciesResolveDownloadSuccess.message.downloadOnly
source: Your download of {0} was successful.
ar: تم تنزيل {0} بنجاح.
it: Lo scaricamento di {0} è avvenuto con successo.

# extensionList.dependenciesResolveDownloadSuccess.header
source: Log
ar: السجل

# extensionList.dependenciesResolveDownloadSuccess.item
source: Extensions
ar: الإضافات
it: Estensioni

# extensionList.dependenciesResolveFlashMessage.title
source: {0} installed.
ar: {0} مُثبّت.
it: {0} installate.

# extensionList.dependenciesResolveFlashMessage.title.downloadOnly
source: {0} downloaded.
ar: {0} تم تنزيله.
it: {0} scaricate.

# extensionList.uploadFlashMessage.title
source: Extension Upload
ar: تحميل الإضافة
it: Carica Estensione

# extensionList.uploadFlashMessage.message
source: %s was uploaded!
ar: تم رفع %s!
it: %s è stato caricato!

# extensionList.installedFlashMessage.message
source: %s was installed!
ar: تم تثبيت %s!
it: %s è stata installata!

# extensionList.updateFromTerFlashMessage.title
source: Update Extension List
ar: تحديث قائمة الإضافات
it: Aggiorna Elenco Estensioni

# extensionList.downloadViewHelper.submit
source: Import and Install
ar: استيراد وتثبيت
it: Importa e Installa

# extensionList.downloadViewHelper.submit.downloadOnly
source: Import
ar: استيراد
it: Importa

# extensionList.showAllVersions.label
source: Show all versions
ar: عرض جميع الإصدارات
it: Mostra tutte le versioni

# extensionList.showAllVersions.extensionKey
source: Extension key
ar: مفتاح الإضافة
it: Chiave estensione

# extensionList.showAllVersions.version
source: Version
ar: الإصدار
it: Versione

# extensionList.showAllVersions.lastUploaded
source: Last uploaded
ar: آخر تحميل
it: Aggiornato il

# extensionList.showAllVersions.downloads
source: Downloads
ar: التحميلات
it: Scaricati

# extensionList.showAllVersions.category
source: Category
ar: الفئة
it: Categoria

# extensionList.showAllVersions.manual
source: Manual
ar: الدليل
it: Manuale

# extensionList.showAllVersions.author
source: Author
ar: المُؤلّف
it: Autore

# extensionList.showAllVersions.readOnline
source: Read online
ar: القراءة عبر الإنترنت
it: Leggi online

# extensionList.showAllVersions.depends
source: Depends
ar: يعتمد على
it: Dipendenze

# extensionList.showAllVersions.conflicts
source: Conflicts
ar: التناقضات
it: Conflitti

# extensionList.showAllVersions.suggests
source: Suggests
ar: اقتراحات
it: Suggerimenti

# extensionList.showAllVersions.notCompatibleVersion
source: Not compatible with your version
ar: غير متوافق مع النسخة الخاصة بك
it: Non compatibile con la tua versione

# extensionList.remove.message
source: Extension "%s" was removed successfully!
ar: تم إزالة الإضافة "%s" بنجاح!
it: L'estensione "%s" è stata rimossa con successo!

# extensionList.distribution.key
source: Key
ar: المفتاح
it: Chiave

# extensionList.distribution.author
source: Author
ar: المُؤلّف
it: Autore

# extensionList.distribution.title
source: Title
ar: العنوان
it: Titolo

# extensionList.distribution.version
source: Version
ar: الإصدار
it: Versione

# extensionList.distribution.downloads
source: Downloads
ar: التحميلات
it: Scaricati

# extensionList.distribution.lastUpdated
source: Last Update
ar: آخر تحديث
it: Ultimo Aggiornamento

# extensionList.showUnsuitableDistributions
source: Show also distributions that are not suitable for this TYPO3 version
ar: عرض أيضاً التوزيعات غير المناسبة لهذا الإصدار TYPO3
it: Mostra anche le distribuzioni che non sono compatibili con questa versione di TYPO3

# extensionList.officialDistribution
source: Official distribution
ar: التوزيع الرسمي
it: Distribuzione ufficiale

# distributions
source: Get preconfigured distribution
ar: الحصول على التوزيع المعدّل مسبقاً
it: Installa una Distribuzione Preconfigurata

# extensionList.installDistribution
source: Install
ar: تثبيت
it: Installa distribuzione

# extensionList.installImpexp
source: Please install the Import/Export (impexp) extension to enable distribution support.
ar: الرجاء تثبيت إضافة الاستيراد/التصدير (impexp) لتفعيل دعم التوزيع.
it: Si prega di installare l'estensione Import/Export (impexp) per abilitare il supporto di distribuzione

# distribution.installImpexp
source: Install impexp
ar: تثبيت impexp
it: Installa impexp

# extensionList.updateFromTer.label
source: Retrieving extension list from TYPO3 Extension Repository (TER)...
ar: استرداد قائمة الإضافة من مستودع إضافة TYPO3 (TER)...
it: Sto recuperando l'elenco delle estensioni da TYPO3 Extension Repository (TER)...

# extensionList.updateFromTer.buttonLabel
source: Update now
ar: التحديث الآن
it: Aggiorna ora

# extensionList.updateFromTer.lastUpdate.label
source: Last update
ar: آخر تحديث
it: Ultimo aggiornamento

# extensionList.updateFromTer.lastUpdate.timeSinceLastUpdateLabel
source: Time since last update
ar: الوقت منذ آخر تحديث
it: Tempo trascorso dall'ultimo aggiornamento

# extensionList.updateFromTer.lastUpdate.noInfo
source: unknown
ar: غير معروف
it: sconosciuto

# extensionList.updateFromTer.lastUpdate.timeOfLastUpdate
source: Time of last update:
ar: وقت آخر تحديث:
it: Tempo trascorso dall'ultimo aggiornamento:

# extensionList.updateFromTer.lastUpdate.noTimeOfLastUpdate
source: No last update time known.
ar: لم يُعرف آخر وقت للتحديث.
it: Ultimo aggiornamento sconosciuto.

# extensionList.updateFromTer.never
source: Never
ar: أبداً
it: Mai

# extensionList.uninstall.dependencyError
source: Cannot deactivate extension '%s' - The extension(s) '%s' depend on it.
ar: لا يمكن إلغاء تفعيل الإضافة ''%s' - الإضافات ''%s' يعتمد عليها.
it: Non è possibile disattivare l'estensione '%s' - L'estensione(i) '%s' dipende da essa.

# distribution.error.headline
source: Could not install distribution '%s'
ar: تعذر تثبيت التوزيع '%s'
it: Non è possibile installare la distribuzione '%s'

# distribution.welcome.headline
source: Congratulations...
ar: تهانينا...
it: Congratulazioni...

# distribution.welcome.message
source: You successfully installed the distribution '%s'
ar: تم بنجاح تثبيت التوزيع '%s'
it: Hai installato con successo la distribuzione '%s'

# distribution.welcome.nextSteps
source: Now you can
ar: يُمكِنُكَ الآن
it: Ora puoi

# distribution.welcome.openViewModule
source: View your website
ar: عرض موقعك الإلكتروني
it: Visualizza il tuo sito web

# distribution.welcome.openPageModule
source: Start editing your website
ar: ابدأ في تعديل موقعك الإلكتروني
it: Inizia a modificare il tuo sito
