Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/extensionmanager/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# distribution.dependency.headline
source: Dependencies, conflicts and suggestions
ar: التَبِعَات والمنازعات والاقتراحات
it: Dipendenze, conflitti e suggerimenti

# distribution.dependency.identifier
source: Identifier
ar: المُعَرِّف
it: Identificativo

# distribution.dependency.type
source: Type
ar: النوع
it: Tipo

# distribution.dependency.version
source: Version
ar: الإصدار
it: Versione

# task.updateExtensionListTask.name
source: Update extension list
ar: تحديث قائمة الإضافات
it: Aggiorna elenco estensioni

# task.updateExtensionListTask.description
source: Update TER extension list on a regular basis. Once a day is a good interval.
ar: تحديث قائمة إضافة TER على أساس منتظم. مرة واحدة في اليوم ستكون مدة جيدة.
it: Aggiorna elenco estensioni da TER regolarmente. Una volta al giorno è un buon intervallo.

# report.status.mainRepository.title
source: Update status of typo3.org main repository extension list
ar: تحديث حالة typo3.org قائمة إضافات المستودع الرئيس
it: Aggiorna lo stato della lista delle estensioni del repository principale da typo3.org

# report.status.mainRepository.notFound.value
source: Error
ar: خطأ
it: Errore

# report.status.mainRepository.notFound.message
source: The typo3.org extension repository was not found. Please import the main typo3.org extension repository in the install tool wizard.
ar: لم يتم العثور على مستودع إضافة typo3.org. الرجاء استيراد إضافة typo3.org الرئيسية في معالج أداة التثبيت.
it: Il repository delle estensioni typo3.org non è stato trovato. Per favore importa il repository delle estensioni typo3.org nella procedura guidata dell'Install Tool.

# report.status.mainRepository.notUpToDate.value
source: Extension list is not up to date!
ar: قائمة الإضافات ليست مُحدّثة!
it: La lista delle estensioni non è aggiornata!

# report.status.mainRepository.notUpToDate.message
source: The Main Repository extension list is older than 7 days. Please update it in the Extension manager or Scheduler.
ar: قائمة إضافة المستودع الرئيسة أقدم من 7 أيام. الرجاء تحديثها في مدير الإضافات أو من المُجدْوُل.
it: La lista delle estensioni del repository principale è più vecchia di 7 giorni. Aggiornala dal Gestore Estensioni oppure con lo Scheduler.

# report.status.mainRepository.upToDate.value
source: OK
ar: موافق

# report.status.loadedExtensions.title
source: Security status of loaded extensions
ar: الحالة الأمنية للإضافات المُحمّلة
it: Stato di sicurezza delle estensioni caricate

# report.status.loadedExtensions.noInsecureExtensionLoaded.value
source: OK
ar: موافق

# report.status.loadedExtensions.insecureExtensionLoaded.value
source: %s insecure extension(s) found
ar: تم العثور على %s إضافة غير آمنة
it: %s estensioni insicure trovate

# report.status.loadedExtensions.insecureExtensionLoaded.message
source: The following extensions are insecure and usage might damage your system. Please update these extensions as soon as possible or remove them from your system:<br><br>%s
ar: الإضافات التالية غير آمنة واستخدام قد يضرُ بنظامك. الرجاء تحديث هذه الإضافات في أقرب وقت ممكن أو إزالتها من النظام الخاص بك: <br><br>%s
it: Le seguenti estensioni non sono sicure e il loro uso potrebbe danneggiare il sistema. Aggiorna le estensioni il prima possibile oppure rimuovile dal tuo sistema:<br><br>%s

# report.status.loadedExtensions.insecureExtensionLoaded.message.extension
source: <strong>%1$s</strong> (version %2$s)<br>
ar: <strong>%1$s</strong> (الإصدار %2$s)<br>
it: <strong>%1$s</strong> (versione %2$s)<br>

# report.status.existingExtensions.title
source: Security status of existing, but not loaded extensions
ar: الحالة الأمنية للإضافات الموجودة ولكن غير المُحمّلة
it: Stato di sicurezza delle estensioni esistenti, ma non caricate

# report.status.existingExtensions.noInsecureExtensionExists.value
source: OK
ar: موافق

# report.status.existingExtensions.insecureExtensionExists.value
source: %s insecure extension(s) found
ar: تم العثور على %s إضافة غير آمنة
it: %s estensioni insicure trovate

# report.status.existingExtensions.insecureExtensionExists.message
source: The following extensions were found on your system, but are currently not installed. Please delete the extensions using the extension manager:<br><br>%s
ar: تم العثور على الإضافات التالية على النظام الخاص بك، ولكن لم يتم تثبيتها حالياً. الرجاء حذف هذه الإضافات باستخدام مدير الإضافات: <br><br>%s
it: Le seguenti estensioni sono state trovate nel sistema, ma non sono attualmente installate. Rimuovi le estensioni usando il Gestore Estensioni:<br><br>%s

# report.status.existingExtensions.insecureExtensionExists.message.extension
source: <strong>%1$s</strong> (version %2$s)<br>
ar: <strong>%1$s</strong> (الإصدار %2$s)<br>
it: <strong>%1$s</strong> (versione %2$s)<br>

# report.status.loadedOutdatedExtensions.title
source: Outdated status of loaded extensions
ar: حالة الإضافات المُحمّلة القديمة جداً
it: Stato obsoleto delle estensioni caricate

# report.status.loadedOutdatedExtensions.noOutdatedExtensionLoaded.value
source: OK
ar: موافق

# report.status.loadedOutdatedExtensions.outdatedExtensionLoaded.value
source: %s outdated extension(s) found
ar: تم العثور على %s إضافة قديمة
it: %s estensioni obsolete trovate

# report.status.loadedOutdatedExtensions.outdatedExtensionLoaded.message
source: The following extensions are outdated and may not be compatible with your installation. Please make sure these extensions are compatible and ask the extension author to publish updates:<br><br>%s
ar: الإضافات التالية قديمة وقد لا تكون متوافقة مع التثبيت الخاص بك. الرجاء التأكد من أن هذه الإضافات مُتَوَافقة واطلب من مُبرمج الإضافة نشر التحديثات: <br><br>%s
it: Le seguenti estensioni sono obsolete e potrebbero non essere compatibili con l'installazione. Assicurati che queste estensioni siano compatibili e chiedi all'autore dell'estensione di pubblicare aggiornamenti:<br><br>%s

# report.status.loadedOutdatedExtensions.outdatedExtensionLoaded.message.extension
source: <strong>%1$s</strong> (version %2$s)<br>
ar: <strong>%1$s</strong> (الإصدار %2$s)<br>
it: <strong>%1$s</strong> (versione %2$s)<br>

# report.status.existingOutdatedExtensions.title
source: Outdated status of existing, but not loaded extensions
ar: الحالة القديمة للإضافات القائمة التي لم يتم تحميلها
it: Stato obsoleto delle estensioni esistenti, ma non caricate

# report.status.existingOutdatedExtensions.noOutdatedExtensionExists.value
source: OK
ar: موافق

# report.status.existingOutdatedExtensions.outdatedExtensionExists.value
source: %s outdated extension(s) found
ar: تم العثور على %s إضافة قديمة
it: %s estensioni obsolete trovate

# report.status.existingOutdatedExtensions.outdatedExtensionExists.message
source: The following extensions were found on your system, but are currently not installed. Please make sure they are compatible with your system before installing them:<br><br>%s
ar: تم العثور على الإضافات التالية على النظام الخاص بك، ولكن لم يتم تثبيتها حالياً. الرجاء التأكد من أنها متوافقة مع النظام الخاص بك قبل تثبيتها:<br><br>%s
it: Le seguenti estensioni sono state trovate nel sistema, ma non sono attualmente installate. Assicurati che queste estensioni siano compatibili col tuo sistema prima di installarle:<br><br>%s

source: <strong>%1$s</strong> (version %2$s)<br>
ar: <strong>%1$s</strong> (الإصدار %2$s)<br>
it: <strong>%1$s</strong> (versione %2$s)<br>

# report.status.composerManifest.extensionKeyMissing
source: Extensions missing extension-key in composer.json
ar: الإضافات تفتقر إلى extension-key في composer.json
it: Estensioni prive di chiave-estensione in composer.json

# report.status.composerManifest.composerJsonMissing
source: Extensions missing composer.json
ar: إضافات مفقودة composer.json
it: Estensioni prive di file composer.json

# report.status.composerManifest.extensionKeyMissing.message
source: %d extension(s) do not have an extension-key set in their composer.json file.
ar: %d إضافة ليس لديها extension-key تم ضبطها في مِلَفّ composer.json الخاص بها.
it: %d estensioni non hanno una chiave-estensione impostata nel loro file composer.json.

# report.status.composerManifest.composerJsonMissing.message
source: %d extension(s) do not provide a composer.json file.
ar: %d إضافات لا توفر مِلَفّ composer.json.
it: %d estensioni non hanno un file composer.json.

# report.status.composerManifest.update
source: Update extensions
ar: تحديث الإضافات
it: Aggiorna estensioni

# fileHandling.couldNotRemoveDirectory
source: ERROR: Could not remove extension directory "%s". Reasons
ar: خطأ: لا يمكن إزالة دليل الإضافة"%s". الأسباب
it: ERRORE: impossibile rimuovere la cartella dell'estensione "%s". Cause:

# fileHandling.couldNotCreateDirectory
source: ERROR: Could not create extension directory "%s"!
ar: خطأ: لا يمكن إنشاء دليل الإضافة"%s"!
it: ERRORE: impossibile creare la cartella dell'estensione "%s"!

# fileHandling.installPathWasNoDirectory
source: ERROR: The extension install path "%s" was no directory!
ar: خطأ: مسار تثبيت الإضافة "%s" لم يكن دليلاً!
it: ERRORE: il percorso di installazione dell'estensione "%s" non è una cartella!

# config.automaticInstallation
source: Install extensions automatically after download from TER or file upload
ar: تثبيت الإضافات تلقائياً بعد التحميل من TER أو تحميل الملفات
it: Installa le estensioni automaticamente dopo lo scaricamento dal TER o il caricamento del file

# config.offlineMode
source: Disable TER connection and hide menu items
ar: تعطيل اتصال TER وإخفاء عناصر القائمة
it: Disabilita la connessione al TER e nascondi le voci del menù

# pagination.previous
source: previous
ar: السّابق
it: precedente

# pagination.next
source: next
ar: التّالي
it: successivo

# pagination.first
source: first
ar: الأول
it: primo

# pagination.last
source: last
ar: الأخير
it: ultimo

# pagination.records
source: Extensions
ar: الإضافات
it: Estensioni

# pagination.page
source: Page
ar: الصفحة
it: Pagina

# pagination.refresh
source: Refresh
ar: تحديث
it: Aggiorna

# extensionComposerStatus.nothingToUpdate.title
source: Good job!
ar: أحسنت صُنعاً!
it: Ottimo lavoro!

# extensionComposerStatus.nothingToUpdate.message.single
source: Extension %s does not need to be updated.
ar: الإضافة %s لا تحتاج إلى تحديث.
it: L'estensione %s non ha bisogno di essere aggiornata.

# extensionComposerStatus.nothingToUpdate.message.multiple
source: There are no extensions which need to be updated.
ar: لا توجد إضافات تحتاج إلى تحديث.
it: Non ci sono estensioni che devono essere aggiornate.

# extensionComposerStatus.title
source: Update composer.json of %s
ar: تحديث composer.json من %s
it: Aggiorna il file composer.json di %s

# extensionComposerStatus.deficit.1
source: %s does not contain a composer.json
ar: %s لا تحتوي على composer.json
it: %s non contiene un file composer.json

# extensionComposerStatus.deficit.1.short
source: composer.json missing
ar: composer.json مفقود
it: file composer.json mancante

# extensionComposerStatus.deficit.2
source: %s is missing the extension-key property in the composer.json
ar: %s يفتقد خاصية extension-key في composer.json
it: %s manca la proprietà "extension-key" (chiave-estensione) nel file composer.json

# extensionComposerStatus.deficit.2.short
source: Extension Key missing
ar: مفتاح الإضافة مفقود
it: Chiave-estensione mancante

# extensionComposerStatus.deficit.information.single
source: In future versions of TYPO3, it will be mandatory for extensions to provide a composer.json file. This will be needed to identify an extension and works as a replacement for the ext_emconf.php. Therefore, the composer.json file must also include the extension key under "extra > typo3/cms > extension-key". Please add a composer.json, including the extension-key property, in the corresponding extension folder. You can use the auto-generated proposal below and update the composer.json file extension.
ar: في الإصدارات المقبلة من TYPO3، سيكون من الإجباري للإضافات توفير مِلَفّ composer.json. هذا سيكون <unk> <unk> <unk> <unk> <unk> مطلوباً لتحديد إضافة ويعمل كبديل لـ ext_emconf.php. لهذا، <unk> <unk> <unk> <unk> <unk> <unk> a the composer. يجب أن يتضمن مِلَفّ سون أيضاً مفتاح الإضافة تحت " > typo3/cms > extension-key". <unk> <unk> <unk> <unk> <unk> <unk> ، الرجاء إضافة composer. ابن، بما في تلك خاصية المفتاح الإضافي، في الإضافة المقابلة <unk> <unk> <unk> <unk> <unk> <unk> مجلد. يمكنك استخدام المقترح الذي تم إنشاؤه تِلْقائيًا أدناه وتحديث امتداد مِلَفّ composer.json.
it: Nelle future versioni di TYPO3, sarà obbligatorio, per le estensioni, fornire un file composer.json. Questo è necessario per identificare un'estensione e funziona come sostituto del file ext_emconf.php. Pertanto, il file composer.json deve includere la chiave-estensione anche in "extra > typo3/cms > extension-key". Si prega di aggiungere un file composer.json che includa la proprietà "extension-key" (chiave-estensione), nella relativa cartella estensione. Puoi utilizzare la proposta generata automaticamente qui sotto e aggiornare il file file composer.json dell'estensione.

# extensionComposerStatus.manifest.title
source: Auto-generated composer.json
ar: إنشاء تلقائي لـ composer.json
it: composer.json generato automaticamente

# extensionComposerStatus.manifest.description
source: Please verify its contents, adjust it to your needs and and put it into typo3conf/ext/%s/composer.json.
ar: الرجاء التحقق من محتوياته، اضبطه حسب احتياجاتك ووضعه في typo3conf/ext/%s/composer.json.
it: Si prega di verificare il contenuto, adattarlo alle tue esigenze e metterlo in typo3conf/ext/%s/composer.json.

# extensionComposerStatus.manifest.error
source: Auto-generation of a composer.json proposal failed
ar: فشل الإنشاء التلقائي لاقتراح composer.json
it: Auto-generazione di una proposta composer.json fallita

# extensionComposerStatus.manifest.error.message
source: TYPO3 could not create a composer.json proposal. This could be due to an invalid composer.json or network problems while requesting the TER API. Please check for an already existing invalid composer.json or try again later.
ar: لم يتمكن TYPO3 من إنشاء اقتراح composer.json . قد يكون ذلك بسبب composer.json غير صالح <unk> <unk> <unk> <unk> <unk> أو مشاكل في الشبكة أثناء طلب API TER. الرجاء التحقق من وجود غير صالح <unk> <unk> <unk> <unk> <unk> composer.json أو حاول مرة أخرى لاحقاً.
it: TYPO3 non può creare una proposta per il file composer.json. Questo potrebbe essere dovuto alla presenza di un composer.json non valido oppure a problemi di rete, durante la richiesta dell'API TER. Verifica se è già presente un file composer.json non valido o riprova più tardi.

# extensionList.header.update
source: Upd.
it: Agg.
