Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/extbase/Resources/Private/Language/*.locallang.xlf
Languages: it

# converter.datetime.notrecognized
source: The date "%s" was not recognized (for format "%s").
it: La data "%s" non è stata riconosciuta (per il formato "%s").

# property.error
source: Validation errors for property "%s"
it: Errori di validazione per la proprietà "%s"

# validator.emailaddress.notvalid
source: The given subject was not a valid email address.
it: Il valore inserito non è un indirizzo email valido.

# validator.stringlength.between
source: The length of the given string was not between %s and %s characters.
it: La lunghezza della stringa inserita non è tra %s e %s caratteri.

# validator.stringlength.less
source: The length of the given string is less than %s characters.
it: La lunghezza della stringa inserita è inferiore a %s caratteri.

# validator.string.notvalid
source: A valid string is expected.
it: È richiesta una stringa valida.

# validator.stringlength.exceed
source: The length of the given string exceeded %s characters.
it: La lunghezza della stringa inserita è superiore a %s caratteri.

# validator.alphanumeric.notvalid
source: The given subject was not a valid alphanumeric string.
it: La stringa inserita non è un valore alfanumerico valido.

# validator.datetime.notvalid
source: The given subject was not a valid DateTime. Got: '%s'
it: Il valore inserito non è una data valida. '%s'

# validator.float.notvalid
source: The given subject was not a valid float.
it: Il valore inserito non è un numero decimale valido.

# validator.text.notvalid
source: The given subject was not a valid text (e.g. contained XML tags).
it: Il contenuto inserito non è un testo valido (es. contiene tag XML).

# validator.regularexpression.nomatch
source: The given subject did not match the pattern.
it: Il valore inserito non è compatibile con il pattern.

# validator.numberrange.notvalid
source: The given subject was not a valid number.
it: Il valore inserito non è un numero valido.

# validator.numberrange.range
source: The given subject was not in the valid range (%s - %s).
it: Il valore inserito non è nell'intervallo corretto (%s - %s).

# validator.notempty.null
source: The given subject was NULL.
it: Il valore inserito è NULL.

# validator.notempty.empty
source: The given subject was empty.
it: Il valore inserito è vuoto.

# validator.number.notvalid
source: The given subject was not a valid number.
it: Il valore inserito non è un numero valido.

# validator.integer.notvalid
source: The given subject was not a valid integer.
it: Il valore inserito non è un intero valido.

# validator.boolean.nottrue
source: The given subject was not true.
it: Il valore inserito non è "vero".

# validator.boolean.notfalse
source: The given subject was not false.
it: Il valore inserito non è "falso".

# validator.url.notvalid
source: The given subject is no valid URL.
it: Il valore dato non è un URL valido.
