Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/webhooks/Resources/Private/Language/*.locallang_db.xlf
Languages: ar

source: Webhooks
ar: الويب هوك

# sys_webhook
source: System webhooks
ar: نظام الويب هوك

# sys_webhook.name
source: Name
ar: الاسم

# sys_webhook.name.description
source: Meaningful name of the webhook
ar: اسم ذو معنى للويب هوك

# sys_webhook.url
source: URL
ar: رابط URL

# sys_webhook.url.description
source: Target URL that should be called.
ar: عنوان URL المُستهدف الذي يجب استِدعاؤه.

# sys_webhook.method
source: HTTP Method
ar: طريقة HTTP

# sys_webhook.verify_ssl
source: Verify SSL
ar: التحقق من SSL

# sys_webhook.verify_ssl.description
source: Verify that the connection is secure and valid, this setting should only be disabled in case a verification is not possible.
ar: تحقق من أن الاتصال آمن وصحيح، يجب تعطيل هذا الإعداد فقط في حالة عدم إمكانية التحقق.

# sys_webhook.additional_headers
source: Additional Headers
ar: ترويسات إضافيّة

# sys_webhook.additional_headers.description
source: Additional headers that should be added to the HTTP request. Data must be provided as valid JSON string.
ar: ترويسات إضافية يجب إضافتها إلى طلب HTTP. يجب توفير البيانات ككود JSON صالح.

# sys_webhook.identifier
source: Identifier
ar: المُعَرِّف

# sys_webhook.identifier.description
source: This is your unique webhook identifier
ar: هذا هو مُعرّف الويب هوك الفريد الخاص بك

# sys_webhook.webhook_type
source: Webhook Trigger
ar: مُشغّل الويب هوك

# sys_webhook.secret
source: Secret
ar: سرّي

# sys_webhook.secret.description
source: The secret is mandatory to create a hash that is sent with the request. The secret can be used to verify the payload has not been modified, see the documentation for more details.
ar: السر إلزامي لإنشاء تجزئة يتم إرسالها مع الطلب. يمكن استخدام السر للتحقق من عدم تعديل الحمولة، راجع الوثائق للحصول على مزيد من التفاصيل.

# sys_webhook.secret.passwordGenerator
source: Generate secret
ar: إنشاء سِر

# sys_webhook.webhook_type.description
source: Trigger the webhook, ...
ar: تشغيل الويب هوك، ...

# sys_webhook.webhook_type.select
source: Select a trigger
ar: تحديد مُشغّل

# sys_webhook.webhook_type.typo3-content-page-modification
source: ... when a page is added or changed
ar: ... عند إضافة صفحة أو تغييرها

# sys_webhook.webhook_type.typo3-login-error
source: ... when an error occurs on log in
ar: ... عندما يحدث خطأ عند تسجيل الدخول

# sys_webhook.webhook_type.typo3-mfa-error
source: ... when an error occurs on multi-factor authentication
ar: ... عندما يحدث خطأ في المُصادقة مُتعددة العوامل

# sys_webhook.webhook_type.typo3-file-added
source: ... when a file is added
ar: ... عندما يتم إضافة ملف

# sys_webhook.webhook_type.typo3-file-removed
source: ... when a file is removed
ar: ... عندما يتم حذف ملف

# sys_webhook.webhook_type.typo3-file-updated
source: ... when a file is updated
ar: ... عندما يتم تحديث الملف

# sys_webhook.storage_pid
source: Storage PID
ar: مكان تخزين PID

# sys_webhook.storage_pid.description
source: Select the page on which a new record is created on.
ar: حدد الصفحة التي يتم على أساسها إنشاء سجل جديد.

# palette.config
source: Configuration
ar: التكوين

# palette.config.description
source: General configuration of the webhook.
ar: الإعدادات العامة للويب هوك.

# palette.http_settings
source: HTTP Settings
ar: إعدادات HTTP

# palette.http_settings.description
source: Advanced HTTP request settings.
ar: إعدادات طلب HTTP المُتَقدمة.

# palette.additional
source: Additional configuration
ar: التكوين الإضافي

# palette.additional.description
source: Specific configuration for the selected webhook type
ar: تكوين مُحدد لنوع الويب هوك المُحدّد
