Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/setup/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

source: User Settings
ar: إعدادات المستخدم
it: Impostazioni Utente

source: Language
ar: اللغة
it: Lingua

# languageUnavailable
source: The selected language "%s" is not available before the language files are installed.
ar: اللغة المُحددة "%s" غير مُتَوفرة قبل تثبيت ملفات اللغة.
it: La lingua selezionata "%s" non è disponibile prima che i file di lingua siano installati.

# languageUnavailable.admin
source: You can use "Manage Language Packs" in the Maintenance module to easily download new language files.
ar: يمكنك استخدام "إدارة حِزم اللغات" في وحدة الصيانة لتنزيل ملفات اللغة الجديدة بسهولة.
it: È possibile utilizzare "Manage Language Packs" nel modulo "Strumenti Admin>Manutenzione" per installare nuove lingue e aggiornare quelle già installate.

# languageUnavailable.user
source: Please ask your system administrator to do this.
ar: من فضلك اطلب من مدير النظام الخاص بك القيام بذلك.
it: Chiedi all'amministratore di sistema di farlo.

# simulate
source: Simulate backend user
ar: محاكاة مستخدم الواجهة الخلفية
it: Simula un utente di backend

# opening
source: Backend appearance
ar: مَظهر الواجهة الخلفية
it: Aspetto del backend

source: Personal data
ar: البيانات الشخصية
it: Dati personali

# startModule
source: Start up in the following module
ar: البدء في الوحدة النمطية التالية
it: Avvia con il seguente modulo

# emailMeAtLogin
source: Notify me by email when somebody logs in from my account
ar: أخبرني عن طريق البريد الإلكتروني عندما يسجل شخص ما بتسجيل الدخول من حسابي
it: Avvisami via email quando qualcuno accede dal mio account

# helpText
source: Show help text when applicable
ar: عرض نص المساعدة عند توافره
it: Mostra testo di aiuto (se disponibile)

# maxTitleLen
source: Max. title length
ar: الطول الأقصى للعنوان
it: Lunghezza massima del titolo

# edit_docModuleUpload
source: File upload directly in Doc-module
ar: تحميل الملف مباشرة في وحدة المستندات
it: Caricamento file direttamente dai moduli dell'area 'Web'

# showHiddenFilesAndFolders
source: Show hidden files and folders in the filelist
ar: إظهار الملفات والمجلدات المَخفية في قائمة الملفات
it: Mostra i file e le cartelle nascoste in Lista File

# editFunctionsTab
source: Edit and advanced functions
ar: التعديل والوظائف المُتقدمة
it: Modifica e funzioni avanzate

# setToStandard
source: Reset all values to default
ar: إعادة ضبط جميع القيم كقيم إفتراضية
it: Reimposta tutti i valori predefiniti

# resetTab
source: Reset configuration
ar: إعادة ضبط التكوين
it: Reimposta configurazione

# resetConfiguration
source: Reset configuration and clear temporary data
ar: إعادة ضبط التكوين ومسح البيانات المؤقتة
it: Reimposta la configurazione e cancella i dati temporanei

# resetConfigurationButton
source: Reset user settings to default state
ar: إعادة ضبط إعدادات المُستخدم إلى الحالة الافتراضية
it: Reimposta le impostazioni utente ai valori predefiniti

# setToStandardQuestion
source: Are you sure you want to reset all values to default?
ar: هل أنت متأكد أنك تريد إعادة تعيين جميع القيم إلى الافتراضي؟
it: Sei sicuro di voler reimpostare tutti i valori predefiniti?

# functions
source: Advanced functions
ar: وظائف متقدمة
it: Funzioni avanzate

# copyLevels
source: Recursive copy: Enter the number of page sublevels to include, when a page is copied
ar: النُسَخ المُتكررة: أدخل عدد المستويات الفرعية للصفحة لتضمينها عندما يتم نسخ الصفحة
it: Copia ricorsiva: inserisci il numero di sottolivelli di pagina da includere, quando una pagina viene copiata

# activateChanges
source: Notice! In order to activate most of these changes, please reload the backend (eg. logout and login again).
ar: ملاحظة! لتنشيط معظم هذه التعديلات، يرجى إعادة تحميل الواجهة الخلفية (على سبيل المثال اخرج من الواجهة ثم أعد الدخول إليها).
it: Avviso! Per attivare la maggior parte di queste modifiche, ricarica il backend (es. disconnettiti e accedi di nuovo).

source: levels
ar: مستويات
it: livelli

# beUser_realName
source: Your name
ar: اسمك
it: Il tuo nome

# beUser_avatar
source: Avatar
ar: الصورة الرمزية

# beUser_email
source: Your email address
ar: بريدك الإلكتروني
it: Il tuo indirizzo email

# save
source: Save configuration
ar: حفظ التكوين
it: Salva configurazione

source: New password
ar: كلمة سر جديدة
it: Nuova password

# newPasswordAgain
source: New password (repetition)
ar: كلمة مرور جديدة (التكرار)
it: Nuova password (ripeti)

# newPassword_ok
source: Password was updated.
ar: تم تحديث كلمة السر
it: Password aggiornata.

# passwordCurrent
source: Current password
ar: كلمة المرور الحالية
it: Password attuale

# passwordPolicyFailed
source: The password was NOT updated, since it does not meet the password policy requirements.
ar: لم يتم تحديث كلمة المرور لأنها لا تلبي متطلبات سياسة كلمة المرور.
it: La password NON è stata aggiornata, poiché non soddisfa i requisiti di politica di password.

source: Account security
ar: أمان الحساب
it: Sicurezza account

# mfaProviders
source: Multi-factor authentication
ar: المصادقة مُتعدِدة العوامل
it: Autenticazione multi-fattore

# mfaProviders.notAvailable
source: Multi-factor authentication is currently not available.
ar: المصادقة المتعددة العوامل غير متوفرة حاليًا.
it: L'autenticazione multi-fattore non è attualmente disponibile.

# mfaProviders.description
source: Use multi-factor authentication to secure your account by providing another factor next to your password.
ar: استخدم المُصادقة متعددة العوامل لتأمين حسابك من خلال توفير طريقة أخرى بجانب كلمة مرورك.
it: Usa l'autenticazione multi-fattore per proteggere il tuo account fornendo un altro fattore accanto alla password.

# mfaProviders.lockedMfaProviders
source: Some providers are currently locked!
ar: بعض مُقدمي الخِدْمَات مقفلون حالياً!
it: Alcuni provider sono attualmente bloccati!

# mfaProviders.enabled
source: Enabled
ar: مُفعَّل
it: Abilitato

# mfaProviders.setupLinkTitle
source: Setup multi-factor authentication
ar: إعداد المصادقة متعددة العوامل
it: Imposta autenticazione multi-fattore

# mfaProviders.manageLinkTitle
source: Manage multi-factor authentication
ar: إدارة المصادقة متعددة العوامل
it: Gestisci autenticazione multi-fattore

# setupWasUpdated
source: User settings were updated.
ar: تم تحديث إعدادات المستخدم.
it: Le impostazioni utente sono state aggiornate.

# newPassword_failed
source: Password was NOT updated because you didn't enter the same password twice.
ar: لم يتم تحديث كلمة السر لأنك لم تدخل نفس كلمة السر في المرتين.
it: La password NON è stata aggiornata perché non hai inserito la stessa password due volte.

# oldPassword_failed
source: Password was NOT updated because you didn't enter the correct current password.
ar: لم يتم تحديث كلمة المرور لأنك لم تدخل كلمة المرور الحالية الصحيحة.
it: La password NON è stata aggiornata perché non hai inserito la password corrente corretta.

# settingsAreReset
source: The user settings have been reset to default values and temporary data has been cleared.
ar: تمت إعادة تعيين إعدادات المستخدم إلى القيم الافتراضية وتم مسح البيانات المؤقتة.
it: Le impostazioni utente sono state reimpostate ai valori predefiniti e i dati temporanei sono stati cancellati.

# startModule.firstInMenu
source: - First module in menu -
ar: - الوحدة الأولى في القائمة -
it: - Primo modulo nel menù -

# avatar.clear
source: Remove selected avatar image
ar: إزالة الصورة الرمزية المُحددة
it: Rimuovi l'immagine avatar selezionata

# avatar.openFileBrowser
source: Open file browser to select avatar image
ar: افتح مُتصفح الملفات لتحديد الصورة الرمزية
it: Sfoglia e seleziona l'immagine dell'avatar

# backendTitleFormat
source: Format of window title in backend
ar: تنسيق عنوان النافذة في الواجهة الخلفية
it: Formato del titolo della finestra nel backend
