Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/setup/Resources/Private/Language/*.locallang_csh_mod.xlf
Languages: ar, fr

# .alttitle
source: User > Setup module
ar: مستخدم<وحدة الإعداد.
fr: Utilisateur > Module de configuration

# .description
source: The Setup module allows the backend user to customize TYPO3 for his own login sessions. This includes the backend language and various other interface features.
ar: تساعد وحدة الإعداد مستخدم الوجهة الخلفية لإعداد تيبو3 لإستقبال جلسات الدخول الخاص بالمستخدم. ويتضمن ذلك إختيار لغة الوجهة الخلفية و العديد من خصائص الأخرى الخاصة بالوجهة الأمامية.
fr: Le module Configuration permet à l'utilisateur backend de personnaliser son interface TYPO3. Ceci comprend la langue du backend et bien d'autres fonctionnalités liées à l'interface.

# .details
source: <b>Notice [For Admins]:</b> These settings can all be overridden or have their default values changed by "User TSconfig". To read more about this concept, see the link below!
ar: <b>لاحظ [خاص بالمرشدين]:</b>يمكن التجاوز عن كل عمليات الضبط هذه كما ويمكن "User TSconfig"تغير القيم الأساسية لها. لقراءة المزيد عن هذا الموضوع برجاء النظر إلى الرابط بالأسفل.
fr: <b>Note [Pour les Administrateurs]:</b> Tous ces paramètres peuvent être surchargés ou leurs valeurs par défaut changées par le "USER TSconfig". Pour en savoir plus à propos de ce concept, voir le lien ci-dessous!

# .image_descr
source: The Setup module is selected in the left menu. This is how the Setup module interface looks like - a list of options to configure.
ar: يتم إختيار وحدة الإعدادمن القائمة المدرجة على اليسار.هكذا يكون شكل وحدة الإعداد المدرجة على الوجهة الأمامسة-تدرج قائمة بالخصائص للضبط.
fr: Le module Setup est sélectionné dans le menu de gauche. C'est ce à quoi ressemble l'interface du module - une liste d'options à configurer.

# language.alttitle
source: Backend Language selection
ar: إختيار لغة الجبهة الخلفية
fr: Sélection de la langue backend

# language.description
source: Select the backend language you prefer. Most parts of TYPO3s backend (for regular users) are translated into other languages.
ar: أختر اللغة التي تفضلها في الجبهة الخلفية.يتم ترجمة معظم اللغات المستخدمة في الجبهة الخلفية(للمستخدمين العادين) إلى لغات أخرى.
fr: Sélectionnez la langue backend que vous préférez. La plupart des parties du backend de TYPO3 (pour les utilisateurs réguliers) sont traduites en d'autres langues.

# language.details
source: <b>Warning [technical]:</b> If TYPO3 is not configured to use a single character set (through $TYPO3_CONF_VARS[BE][forceCharset]) then all data entered in the backend is submitted in the character set of the selected backend language. This leads to inconsistent data storage if some users are using the backend in Russian and others in English which uses different character sets. The solution clearly is to set the configuration option mentioned above to a value like "utf-8". This must be done by the developers responsible for the whole system configuration.
ar: <b>تحذير [technical]:</b> إذا لم يتم تكوين TYPO3 لاستخدام مجموعة أحرف واحدة (من خلال $$TYPO3_CONF_VARS[BE][forceCharset])، سيتم إرسال جميع البيانات التي تم إدخالها في الواجهة الخلفية في مجموعة الأحرف للغة الواجهة الخلفية المُحددة. يؤدي هذا إلى تخزين بيانات غير مُتَسِقة إذا كان بعض المستخدمين يستخدمون الواجهة الخلفية باللغة الروسية والبعض الآخر باللغة الإنجليزية التي تستخدم مجموعات أحرف مختلفة. من الواضح أن الحل هو ضبط خِيار التكوين المذكور أعلاه على قيمة مثل "utf-8". يجب أن يتم ذلك من قبل المطورين المسؤولين عن تكوين النظام بالكامل.
fr: <b>Avertissement [technical]:</b> Si TYPO3 n'est pas configuré pour utiliser un jeu de caractères unique (via $TYPO3_CONF_VARS[BE][forceCharset]) alors toutes les données saisies dans le backend sont soumises dans le jeu de caractères de la langue de backend sélectionnée. Cela conduit à un stockage de données incohérent si certains utilisateurs utilisent le backend en russe et d'autres en anglais qui utilisent différents jeux de caractères. La solution est clairement de définir l'option de configuration mentionnée ci-dessus à une valeur comme "utf-8". Cela doit être fait par les développeurs responsables de l'ensemble de la configuration du système.

# language.image_descr
source: TYPO3 is translated into around 40 languages. English is the default language and all labels must be available in English first and foremost. This screenshot shows translations for Hebrew, Arabic, Russian and Chinese.
ar: تم ترجمة تيبو3 إلى أكثر من 40 لغة.و اللغة الإنجليزية هي اللغة الأساسية ويجب أن تصدر جميع العناوين أولا وبصفة أساسة باللغة الإنجليزية.وتعرض لقطة الشاشة هذه العديد من التراجمات إلى العبرية، الهربية،الروسية،و كذلك الصينية.
fr: TYPO3 est traduit dans près de 40 langues. L'anglais est la langue par défaut et toutes les labels doivent être disponibles en premier et avant tout en anglais. Cette capture d'écran montre des traductions en l'hébreu, arabe, russe et chinois.

# option_startModule.alttitle
source: Start module
ar: بَدْء الوحدة
fr: Module de démarrage

# option_startModule.description
source: Let you select the module that is called when you login in the Backend The default module is "About Modules".
ar: يُتاح لك تحديد الوحدة التي يتم استدعاؤها عند تسجيل الدخول في الواجهة الخلفية. الوحدة الافتراضية هي "حول الوِحدات".
fr: Vous laisse sélectionner le module appelé quand vous vous connectez au Backend. Le module par défaut est "À propos des modules".

# option_helpText.alttitle
source: Show help text when applicable
ar: عرض نص المساعد إن أمكن تطبيقة
fr: Afficher l'aide contextuelle si applicable

# option_helpText.description
source: If set, some help texts will appear by default. Applies to the "Legend" text in the Web>Access module for instance.
ar: عند ضبط هذا الخيار ستظهر بعض نصوص المساعدة بصورة أساسية.وهذه الخيارات تنطبق مثلا على وحدة وب>دخول.
fr: Si défini, certains textes d'aide apparaîtront par défaut. S'applique au texte « Légende » dans le module Web>Accès par exemple.

# option_maxTitleLen.alttitle
source: Maximum title length
ar: الحد الأقصى لطول العنوان.
fr: Taille maximale du titre

# option_maxTitleLen.description
source: TYPO3 will often crop long titles of records etc. so only the first X characters are shown. Often the number of shown characters depends on this variable. For instance the length of page titles in the page tree is determined by this value.
ar: وغالبا ما يقوم تيبو3 بقص اسماء العناوين الطويلة للسجلات إلخ.وعليه فإنه يتم عرض أول أحرف (س)فقط .وغالبا ما يعتمد عدد الأحرف المعروضة على هذا التنوع.فعلى سبيل المثال تستخدم هذه القيمة في تحديد طول عنوان الصفحة داخل صفحة الشجرة.
fr: TYPO3 coupe souvent les longs titres des enregistrements, etc. donc seulement les n premiers caractères seront affichés. Souvent le nombre de caractères affichés dépend de cette variable. Par exemple la longueur des titres des pages dans l'arborescence est déterminée par cette valeur.

# option_maxTitleLen.image_descr
source: In this case the Maximum Title length is set to 10 - and the result is that titles in the page tree - as well as other places in the backend - will be cropped after 10 characters, then suffixed by "...". The default value is "30".
ar: وفي هذه الحالة فإنه يتم تحديد أقصى طول للعنوان بعشرة أحرف-وتكون النتيجة أنه سيتم قطع العناوين التي يزيد عدد احرفها عن عشرة أحرف سواء كانت هذه العناوين داخل صفحة الشجرة أو في أي مكان آخر-ثم يلحق بها الداخلة "...".مع العلم بأن القيمة الأساسية لطول العنوان هي"30" حرف.
fr: Dans ce cas, la longueur maximale du titre est fixée à 10 - et le résultat est que les titres dans l'arborescence de la page - ainsi que d'autres endroits dans le backend - seront coupés après 10 caractères, puis suffixé par "...". La valeur par défaut est "30".

# option_copyLevels.alttitle
source: Recursive Copy
ar: النسخ التكراري
fr: Copie récursive

# option_copyLevels.description
source: When you copy a page, subpages can also be copied along if you set this option. The number you set here defines the number of levels under a page to include in a copy operation.
ar: عند نسخ صفحة ما فإن الصفحات الفرعية تنسخ بالتبعية فقط عند ضبطك لهذه الخاصية.فإن الرقم الذي تقوم بتحديده يعرف عدد المستويات المدرجة أسفل الصفة المقرر نسخها.
fr: Quand vous copiez une page, les sous-pages peuvent aussi l'être si vous mettez cette option. Le nombre que vous mettez ici défini le nombre de niveaux de sous-page à inclure lors de l'opération de copie.

# option_edit_RTE.alttitle
source: Enable Rich Text Editor
ar: إتاحة محرر النص الغني.
fr: Activer le Rich Text Editor

# option_edit_RTE.description
source: If set, the Rich Text Editor in TYPO3 will be enabled for you. Normally you wouldn't want to disable this option.
ar: عند ضبط هذا الخيار،سيكون محرر النصوص الغني الخاص بتيو3 متاحا لك. و الطبع فإنك لست بحاجه لإلغاء هذه الخاصية.
fr: Si défini, l'éditeur de texte riche dans TYPO3 sera activé pour vous. Normalement, vous ne voudriez pas désactiver cette option.

# option_edit_RTE.details
source: A Rich Text Editor (RTE) means that a text editing field has buttons for making selected text bold, italic etc. Whether a RTE is available also depends on factors like the browser you are using and which extensions are installed. Finally RTEs are applied to only a few record fields. The most well known example would be the Text field of a Content Element.
ar: يعني مُعالج النُصوص (RTE) أن حقل تعديل النص يحتوي على أزرار لجعل النص المُحدد غامقًا ومائلًا وما إلى ذلك. ويعتمد ما إذا كان RTE مُتاحًا أيضًا على عوامل مثل المُتصفح الذي تستخدمه والإضافات المثبتة. أخيرًا، يتم تطبيق RTEs على عدد قليل من حقول التسجيل. المثال الأكثر شهرة هو حقل النص الخاص بعنصر المحتوى.
fr: Un éditeur de texte enrichi (RTE) signifie qu'un champ d'édition de texte a des boutons pour faire du texte en gras, en italique, etc. La disponibilité d'une RTE dépend également de facteurs tels que le navigateur que vous utilisez et les extensions installées. Enfin, les RTEs ne sont appliqués qu'à quelques champs d'enregistrement. L'exemple le plus connu serait le champ de texte d'un élément de contenu.

# option_edit_docModuleUpload.alttitle
source: Enable File Uploads in editing forms
ar: تفعيل خاصية تحديث الملف فى نماذج التحرير.
fr: Activer les téléchargements de fichiers dans les formulaires d'édition

# option_edit_docModuleUpload.description
source: This option will enable an "Upload" box for each field in TYPO3 records where you can attach a file or image. Most likely you don't want to disable this since it is usually just a nice thing to have.
ar: تمكنك هذه الخاصية من إتاحة صندوق "التحديث"لكل ملف من سجلات تيبو3حيث يمكنك إرفاق صورة أو ملف.غالبا فإنك لا ترغب إبطال هذه الخاصية حيث أنها عادة من الخواص الجيد الحصول عليها.
fr: Cette option activera une boîte "Upload" pour chaque champ dans les enregistrements de TYPO3 où vous pouvez joindre un fichier ou une image. Il est très probable que vous ne vouliez pas désactiver cela car c'est généralement une bonne chose à avoir.

# option_edit_docModuleUpload.details
source: If you disable the Upload box there is still the TYPO3 Element Browser left for attaching files and images.
ar: حتى إذا ما قمت بإبطال هذه الخاصية فإنك بذلك لا تلغي صندوق التحديث المجود في مستعرض العنصر في تيبو3و المتروك من أجل إلحاق صورة أو ملف.
fr: Si vous désactivez la boîte de téléchargement, il reste le navigateur d’éléments TYPO3 pour attacher des fichiers et des images.

# option_flexibleTextareas_MaxHeight.alttitle
source: Maximum height of text areas
ar: أفصى ارتفاع لمناطق النص
fr: Hauteur maximum des zones de texte

# option_flexibleTextareas_MaxHeight.description
source: Define the maximum height of text areas in pixels.
ar: تحديد أقصى ارتفاع لمناطق النص بالبكسل.
fr: Définit la hauteur maximale de la zone de texte (en pixel).

# option_showHiddenFilesAndFolders.description
source: Defines whether you want to list all the hidden files and folders (beginning with a .) in the filelist and element browser.
ar: يُحدد ما إذا كنت تريد إدراج جميع الملفات والمجلدات المَخفية (بدءًا من a.) في قائمة الملفات ومستعرض العناصر.
fr: Définit si vous voulez lister tous les fichiers et dossiers cachés (commençant par un .) dans la liste de fichiers et dans le navigateur d'éléments.

# option_showHiddenFilesAndFolders.details
source: By default all hidden files are not displayed in filelists and element browsers and link pickers. This option enables to additionally show the hidden files.
ar: افتراضيًا، لا يتم عرض جميع الملفات المخفية في قوائم الملفات ومتصفحات العناصر ومُنتقي الروابط. يتيح هذا الخيار عرض الملفات المخفية بالإضافة إلى ذلك.
fr: Par défaut, tous les fichiers cachés ne sont pas affichés dans les listes de fichiers, les navigateurs d’éléments et les sélecteurs de liens. Cette option permet d’afficher les fichiers cachés.

# option_beUser_realName.alttitle
source: Your real name
ar: اسمك الحقيقي
fr: Votre vrai nom

# option_beUser_realName.description
source: Enter your real name here.
ar: إدخل اسمك الحقيقي هنا.
fr: Entrez votre vrai nom ici

# option_beUser_email.alttitle
source: Your email address
ar: إدخل بريدك الإلكتروني.
fr: Votre adresse email

# option_beUser_email.description
source: Make sure this is a valid email address for you. This is the contact address that the backend administrator will use if he needs to contact you. Also, the TYPO3 system might need to send you messages at various times and this will be the recipient address.
ar: تأكد من أن هذا هو بريدك الإلكتروني المستخدم.وسيكون هو عنوان الإتصال الذي يستخدمه مشرف الواجهة الخلفية للإتصال بك.وقد يكون نظام تيبو3 في حاجة إلى مراسلتك في أوقات متعددة وسيكون هذا العنوان هو المستقبل لجميع رسائلك.
fr: Assurez-vous qu'il s'agit d'une adresse e-mail valide pour vous. Il s'agit de l'adresse de contact que l'administrateur backend utilisera s'il a besoin de vous contacter. De plus, le système de TYPO3 peut avoir besoin de vous envoyer des messages à différents moments et ce sera l'adresse de réception.

# option_emailMeAtLogin.alttitle
source: Notify by login
ar: الإعلام بالدخول.
fr: Notifier à la connexion

# option_emailMeAtLogin.description
source: If you set this option you will receive an email from TYPO3 each time you (or "someone") logs in using your username. You might like to receive such a "warning" as a security measure so you will know if someone else picks up your password and uses your account.
ar: عند ضبط هذا الخيار سيصل لك بريدا إلكترونيا من تيبو3 في كل مرة تقوم أنت( أو أي شخص أخر )بالدخول مستخدما اسم المرور الخاص بك.وقد تكون قي حاجة إلي عملية " التحذير" كوسيلة لإختبار الأمان وعليه فستعرف ما إن تعرف على كلمة السر الخاصة بك ويستخدمها للدخول إلى حسابك الخاص.
fr: Si vous définissez cette option, vous recevrez un email de TYPO3 à chaque fois que vous (ou "quelqu'un") vous connecterez en utilisant votre nom d'utilisateur. Vous pourriez recevoir un tel "avertissement" comme mesure de sécurité afin que vous sachiez si quelqu'un d'autre récupère votre mot de passe et utilise votre compte.

# option_avatar.alttitle
source: Avatar
ar: الصورة الرمزية

# option_avatar.description
source: You can personalize your TYPO3 user profile by adding an avatar. It will be shown at multiple places in the backend, e.g. in the topbar, next to your username.
ar: يمكنك تخصيص ملف تعريف مُستخدم TYPO3 الخاص بك عن طريق إضافة صورة رمزية. سيتم عرضه في أماكن متعددة في الواجهة الخلفية، على سبيل المثال في الشريط العلوي بجوار اسم المستخدم الخاص بك.
fr: Vous pouvez personnaliser votre profil utilisateur TYPO3 en ajoutant un avatar. Il sera affiché à plusieurs endroits dans le backend, par exemple dans la barre supérieure, à côté de votre nom d'utilisateur.

# option_newPassword.alttitle
source: Change password
ar: تغير كلمة السر
fr: Changez le mot de passe

# option_newPassword.description
source: Enter a new password for your backend account
ar: أدخل كلمة مرور جديدة لحسابك في الواجهة الخلفية
fr: Saisissez un mot de passe pour votre compte backend

# option_newPassword.details
source: The passwords are encrypted to an MD5 hash when you leave the field so no plain text password is sent over the wire.
ar: عند ترك هذا الحقل يتم تشفير كلمات السر بالإمتداد MD5 hash وعليه فلا يرسل نص خالي لكلمة السر عبر اتلأسلاك.
fr: Les mots de passe sont chiffrés à un hachage MD5 lorsque vous quittez le champ, donc aucun mot de passe en texte brut n'est envoyé sur le réseau.

# option_newPasswordAgain.alttitle
source: Change password, confirm
ar: تأكيد تغير كلمة السر
fr: Changez le mot de passe (confirmation)

# option_newPasswordAgain.description
source: Confirm the new password by entering it again, exactly like above. If the two new passwords do not match, the password will not be changed.
ar: قم بتأكيد كلمة السر الخاصة بك و ذلك بإدخالها مرة أخرى، مطابقة لما كتبتبه تماما. وإذا لم تتطابق كلمتى السر، فإن كلمة السر يتم تغيرها مباشرة.
fr: Confirmez le nouveau mot de passe en le saisissant à nouveau, exactement comme ci-dessus. Si les deux nouveaux mots de passe ne correspondent pas, le mot de passe ne sera pas changé.

# option_mfaProviders.alttitle
source: Multi-factor authentication
ar: المصادقة مُتعدِدة العوامل
fr: Authentification multi-facteurs

# option_mfaProviders.description
source: Manage your multi-factor authentication settings. This can be used to secure your account by providing another factor next to your password.
ar: إدارة إعدادات المصادقة مُتعددة العوامل. يمكن استخدام هذا لتأمين حسابك من خلال توفير عامل آخر بجانب كلمة المرور الخاصة بك.
fr: Gérez vos paramètres d'authentification multi-facteurs. Cela peut être utilisé pour sécuriser votre compte en fournissant une autre méthode d'authentification en plus de votre mot de passe.

# option_backendTitleFormat.alttitle
source: Format of window title in backend
ar: تنسيق عنوان النافذة في الواجهة الخلفية
fr: Format du titre de la fenêtre dans le backend

# option_backendTitleFormat.description
source: Define the order within the TYPO3 backend window title, which is usually displayed in the browser tab. Either the site name followed by the current module name or vice versa.
ar: تحديد الترتيب داخل عنوان نافذة الواجهة الخلفية لـ TYPO3، والذي يتم عرضه عادة في علامة التبويب المتصفح. إما أن يتبع اسم الموقع اسم الوحدة الحالية أو العكس.
fr: Définissez l'ordre dans le titre de la fenêtre du backend de TYPO3, qui est généralement affiché dans l'onglet du navigateur. Soit le nom du site suivi du nom du module actuel, soit l'inverse.

# reset.alttitle
source: Reset all Values to default
ar: إعادة ضبط جميع القيم كقيم إفتراضية.
fr: Réinitialiser toutes les valeurs

# reset.description
source: If you select this option all settings in this module will be reset to the default settings of the system.
ar: عند إختيار هذه الخاصية فإنه سيتم عادة ضبط جميع ضوابط هذه الوحدة كضوابطا إفتراضية للنظام.
fr: Si vous sélectionnez cette option, tous les paramètres de ce module seront réinitialisés aux valeurs par défaut du système.

# reset.details
source: This does not apply to user name, email and password settings of course.
ar: وهذه الخاصية غير مطبقة بالطبع على تضبيط اسم المستخدم،بريده الإلكتروني و كلمة المرور الخاصة به.
fr: Cela ne s'applique pas au nom d'utilisateur, à l'adresse email et au mot de passe.

# simuser.alttitle
source: Simulate backend user
ar: يقوم هذا الملف بمحاكاة مستخدم الواجهة الخلفية.
fr: Simuler un utilisateur backend

# simuser.description
source: This option allows "admin"-users to change settings for another backend user in the system.
ar: يمكن هذا الخيار المستخدمين "المرشدين"من تغير الضوابط لتناسب مستخدم آخر من مستخدمي الواجهة الخلفية للنظام.
fr: Cette option permet aux utilisateurs "admin" de changer les paramètres pour un autre utilisateur backend du système.

# option_enableInstallTool.alttitle
source: Admin control for re-enabling Install Tool access
ar: أداة تحكّم المشرف لإعادة تمكين الوصول إلى أداة التثبيت
fr: Contrôle administrateur pour réactiver l'accès à l'outil d'installation

# option_enableInstallTool.description
source: By clicking this button, a file typo3conf/ENABLE_INSTALL_TOOL is created (or removed if it already exists). It unlocks the access to the Install Tool (password is still needed!) and will be removed automatically after 1 hour.
ar: بالنقر فوق هذا الزر، يتم إنشاء مِلَفّ typo3conf / ENABLE_INSTALL_TOOL (أو إزالته إذا كان موجودًا بالفعل). يفتح الوصول إلى أداة التثبيت (لا تزال هناك حاجة إلى كلمة المرور!) وستتم إزالتها تلقائيًا بعد ساعة واحدة.
fr: En cliquant sur ce bouton, un fichier typo3conf/ENABLE_INSTALL_TOOL est créé (ou supprimé s'il existe déjà). Il déverrouille l'accès à l'outil d'installation (le mot de passe est toujours nécessaire !) et sera supprimé automatiquement dans 1 heure.
