Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/impexp/Resources/Private/Language/*.locallang_csh.xlf
Languages: ar, fr, it

# extensionDependencies.details
source: During import warnings will appear for all selected extensions from this list which were not installed.
ar: وسيظهر أثناء عملية الإستيراد تحذيرات لجميع إمتدادات هذه القائمة الغير محملة في القائمة.
fr: Pendant l'importation, des avertissements apparaîtront pour toutes les extensions sélectionnées de cette liste qui n'ont pas été installées.
it: Durante l'importazione appariranno avvisi per tutte le estensioni selezionate da questa lista che non sono ancora state installate.

# _extensionDependencies.image
source: EXT:impexp/Resources/Public/Images/cshimages/extdep.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/extdep.png

# presets.alttitle
source: Configuration presets
ar: التجهيزات الأولية لعملية الضبط.
fr: Présélections de configuration
it: Preset di configurazione

# presets.description
source: Enables you to save an export configuration for later re-use. Useful if you need to export the same configuration with regular intervals.
ar: وتيح لك هذه الخاصية تخزين ضبطا لعملية التصدير لإعادة إستخدامه مرة أخرى.وقد يكون ذلك مفيدا إذا ما أردت تصدير نفس عملية الضبط على فترات منتظمة.
fr: Permet de sauvegarder une configuration d'exportation pour une réutilisation ultérieure. Utile si vous avez besoin d'exporter la même configuration à intervalles réguliers.
it: Consente di salvare una configurazione di esportazione per il successivo riutilizzo. Utile se è necessario esportare la stessa configurazione a intervalli regolari.

# presets.details
source: In the "Select preset" box you can select any previously saved preset to load. If you are exporting a page the presets listed will be those found for the start page ID. For records, any preset can be loaded. To load a preset, select it in the selector and press "Load". If you press "Merge" instead the settings from the preset will be merged with the current configuration. This is meaningful in cases where you select multiple individual tables or records. To save a preset, simply enter a title in the title box and press "Save". This will create a new preset. If you press save while having selected an existing preset you will overwrite it. To delete old presets, simply select it and press "Delete". The checkbox "Public" can be set if you want to share your preset with other users of the system. Otherwise they are personal to you.
ar: في مُربع "تحديد مسبق" يمكنك تحديد أي تعيين محفوظ مُسبقاً للتحميل. إذا كنت تقوم بتصدير صفحة، فستكون الإعدادات المُسبقة المُدرجة هي تلك التي يتم العثور عليها لمُعرّف صفحة البَدْء. للسجلات، يمكن تحميل أي تعيين مسبق. لتحميل الإعداد المسبق، حدد في المُحدّد واضغط على "تحميل". إذا قمت بالضغط على "الدمج" بدلاً من ذلك سيتم دمج الإعدادات من الإعداد المسبق مع الإعدادات الحالية. هذا ذو مغزى في الحالات التي تختار فيها جداول أو سجلات فردية متعددة. لحفظ الإعداد المسبق، ببساطة أدخل عنوان في مربع العنوان واضغط على "حفظ". سيؤدي هذا إلى إنشاء تعيين مسبق جديد. إذا قمت بالضغط على الحفظ في أثناء تحديد الضبط المسبق الموجود سوف تقوم بالكتابة. لحذف السابق القديم، ببساطة قم باختياره واضغط على "حذف". يمكن تعيين مربع الاختيار "العام" إذا كنت ترغب في مشاركة الإعداد المسبق الخاص بك مع المستخدمين الآخرين للنظام. وإلا فإنهم خاصّين بك فقط.
fr: Dans la zone "Sélectionner le préréglage", vous pouvez sélectionner n'importe quel préréglage précédemment enregistré à charger. Si vous exportez une page, les préréglages listés seront ceux de l'ID de la page de démarrage. Pour les enregistrements, tout préréglage peut être chargé. Pour charger un préréglage, sélectionnez-le dans le sélecteur et appuyez sur "Charger". Si vous appuyez sur « Fusionner » à la place, les paramètres du préréglage seront fusionnés avec la configuration actuelle. Ceci est significatif dans les cas où vous sélectionnez plusieurs tables ou enregistrements. Pour enregistrer un préréglage, entrez simplement un titre dans la zone titre et appuyez sur "Enregistrer". Cela créera un nouveau préréglage. Si vous appuyez sur Enregistrer tout en ayant sélectionné un préréglage existant, vous le remplacerez. Pour supprimer les anciennes presets, il suffit de le sélectionner et de cliquer sur "Supprimer". La case à cocher "Public" peut être définie si vous voulez partager votre préréglage avec d'autres utilisateurs du système. Sinon ils sont personnels.
it: Nel menù a tendina "Seleziona preset" è possibile selezionare qualsiasi preset, precedentemente salvato, da caricare. Se stai esportando una pagina, i preset elencati saranno quelli trovati per l'ID della pagina iniziale. Per i record, qualsiasi preset può essere caricato. Per caricare un preset, selezionalo nel menù e premere "Carica". Se premi invece "Unisci" le impostazioni del preset verranno unite con quelle correnti. Questo è significativo nei casi in cui dovessi selezionare più tabelle o record singolarmente. Per salvare un preset, basta inserire un titolo nella casella "Titolo del nuovo preset" e premere "Salva". Questo creerà un nuovo preset. Se premi "Salva", mentre hai selezionato un preset esistente, lo sovrascriverai. Per eliminare un preset esistente, selezionalo e premi "Elimina". L'opzione "Pubblico" può essere spuntata se si desidera condividere il preset con altri utenti del sistema. Altrimenti i preset sono personali.

# presets.image_descr
source: The preset selector in the export interface.
ar: المُحدد المُعدّ مُسبقاً في واجهة التصدير.
fr: Le sélecteur de préréglage dans l'interface d'exportation.
it: Il selettore dei preset nell'interfaccia di esportazione.

# metadata.alttitle
source: Meta data setting
ar: ضبط البيانات الواصفة.
fr: Configuration des méta données
it: Impostazione Metadati

# metadata.description
source: Set meta data for the export. This is highly encouraged if your exported content goes into eg. a template collection of sorts.
ar: يعمل هذا الملف على تجهيز البيانات الواصفة للتصدير.وتفعل هذهالعملية بشدة إذا ما مر محتوى التصدير خلال نموذج مجمع من الأنواع.
fr: Définir les métadonnées pour l'exportation. Ceci est fortement encouragé si votre contenu exporté entre par exemple une collection de modèles de types.
it: Imposta i metadati per l'esportazione. Questo è consigliato se il contenuto esportato va a popolare una raccolta.

# metadata.details
source: The meta data will help users of your exported files to know what they can expect to be inside and what things they should be aware of and take into account during import. The "Title" and "Description" should contain the basic information about the export. The "Notes" field can be used for additional details, especially remarks about intentions or requirements that apply.
ar: ستساعد البيانات الوَصفية مستخدمي الملفات المُصدَّرة الخاصة بك على معرفة ما يمكن أن يتوقعوا أن يكونوا داخلها وما هي الأشياء التي يجب أن يكونوا على علم بها وأخذها في الاعتبار في أثناء الاستيراد. يجب أن يحتوي "العنوان" و "الوصف" على المعلومات الأساسية حول التصدير. يمكن استخدام حقل "الملاحظات" للحصول على تفاصيل إضافية، ولا سيما الملاحظات على النيات أو المتطلبات التي تنطبق.
fr: Les métadonnées aideront les utilisateurs de vos fichiers exportés à savoir ce qu'il y a dedans et ce qu'ils doivent savoir et prendre en compte lors de l'importation. Le "titre" et la "description" doivent contenir les informations de base sur l'export. Le champ "notes" peut être utilisé pour des informations supplémentaires, en particulier les remarques sur les intentions ou les exigences qui s'appliquent.
it: I metadati aiuteranno gli utilizzatori, dei tuoi file esportati, a sapere cosa contengono e quali cose dovrebbero prendere in considerazione durante l'importazione. Il "Titolo" e la "Descrizione" dovrebbero contenere le informazioni di base dell'esportazione. Il campo "Note" può essere utilizzato per ulteriori dettagli, in particolare osservazioni su finalità o requisiti applicabili.

# _metadata.image
source: EXT:impexp/Resources/Public/Images/cshimages/metadata.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/metadata.png

# fileFormat.alttitle
source: File format options
ar: خصائص تنسيق الملف.
fr: Options de format de fichier
it: Opzioni del formato file

# fileFormat.description
source: You can export your records to a generic XML format which potentially can be imported by other applications. However, the schema of the XML is TYPO3 specific. Alternatively, you can select a TYPO3 specific binary format called "T3D".
ar: يمكنك تصدير السجلات الخاصة بك إلى تنسيق XML العام الذي يمكن استيراده بواسطة تطبيقات أخرى. ومع ذلك، فإن مخطط XML محدد TYPO3. بدلاً من ذلك، يمكنك اختيار صيغة ثنائية محددة TYPO3 تسمى "T3D".
fr: Vous pouvez exporter vos enregistrements vers un format XML générique qui peut potentiellement être importé par d'autres applications. Cependant, le schéma du XML est spécifique à TYPO3, ou vous pouvez choisir un format binaire spécifique à TYPO3 appelé "T3D".
it: Puoi esportare i record in un formato XML generico, che potenzialmente può essere importato da altre applicazioni. Tuttavia, lo schema di XML è specifico per TYPO3. In alternativa, puoi selezionare un formato binario specifico di TYPO3 chiamato "T3D".

# fileFormat.details
source: Generally you should use the XML format. The T3D compressed format is usually smaller, but much harder to read and process. Entering a file name to save makes it possible to write your export directly to a file (pressing "Save to filename") instead of downloading it (pressing "Download export"). The correct file extensions depending on file format is automatically applied. Files are saved in a proper file mount in "fileadmin/". This is shown to you upon saving. Existing files are overwritten.
ar: عموماً، يجب عليك استخدام تنسيق XML. التنسيق المضغوط T3D هو عادة أصغر، ولكنه أصعب بكثير من القراءة والمعالجة. إدخال اسم مِلَفّ للحفظ، يجعل من المُمكن كتابة التصدير الخاص بك مباشرة إلى مِلَفّ (اضغط على "حفظ إلى اسم المِلَفّ") بدلاً من تحميله (اضغط على "تنزيل التصدير"). يتم تطبيق إضافات المِلَفّ الصحيحة اعتماداً على تنسيق المِلَفّ تلقائياً. يتم حفظ الملفات في مِلَفّ مناسب في "fileadmin/". هذا يظهر لك عند الحفظ. يتم الكتابة فوق الملفات الموجودة.
fr: Généralement, vous devriez utiliser le format XML. Le format compressé T3D est généralement plus petit, mais beaucoup plus difficile à lire et à traiter. La saisie d'un nom de fichier à enregistrer permet d'écrire directement votre exportation dans un fichier (appuyez sur "Enregistrer dans le nom de fichier") au lieu de le télécharger (appuyez sur "Télécharger l'exportation"). Les extensions de fichier correctes selon le format de fichier sont automatiquement appliquées. Les fichiers sont enregistrés dans un montage de fichier approprié dans "fileadmin/". Cela vous est montré lors de l'enregistrement. Les fichiers existants sont écrasés.
it: Generalmente dovresti usare il formato XML. Il formato compresso T3D è di solito più piccolo, ma molto più difficile da leggere e da elaborare. L'inserimento di un nome file da salvare permette di scrivere l'esportazione direttamente su un file (con "Salva su file") invece di scaricarlo (con "Scarica l'esportazione"). Le estensioni di file corrette, a seconda del formato di file, vengono automaticamente applicate. I file vengono salvati in un file corretto in "fileadmin/". Questo viene mostrato al momento del salvataggio. I file esistenti vengono sovrascritti.

# _fileFormat.image
source: EXT:impexp/Resources/Public/Images/cshimages/fileformat.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/fileformat.png

# import.alttitle
source: Importing TYPO3 records
ar: تصدير سجلات تيبو3.
fr: Importation des enregistrements TYPO3
it: Importazione record TYPO3

# import.description
source: To import TYPO3 T3D/XML files into the page tree you click any page in the page tree (including the root page!), select "More options" and then "Import". This will bring up the import interface where you can select a file to import or upload a new one.
ar: لاستيراد ملفات TYPO3 T3D/XML إلى شجرة الصفحة، انقر فوق أي صفحة في شجرة الصفحة (بما في ذلك صفحة الجذر)! ، حدد "خيارات إضافية" ثم "استيراد". سيؤدي هذا إلى جلب واجهة الاستيراد حيث يمكنك تحديد ملف لاستيراد أو تحميل ملف جديد.
fr: Pour importer des fichiers TYPO3 T3D/XML dans l'arborescence de pages, cliquez sur n'importe quelle page de l'arborescence (y compris la page racine !), sélectionnez "Plus d'options" puis "Importer". Cela fera apparaître l'interface d'importation où vous pouvez sélectionner un fichier à importer ou en télécharger un nouveau.
it: Per importare i file TYPO3 T3D/XML, nell'albero delle pagine, fai clic su qualsiasi pagina nell'albero delle pagine (inclusa la pagina root), seleziona "Altre opzioni" e poi "Importa". Questo farà apparire l'interfaccia di importazione dove è possibile selezionare un file da importare o caricarne uno nuovo.

# import.details
source: <b>Tip: Import into a Folder</b> To make sure that no records are lost during the import, you can make yourself safe by importing into a Folder you create first. After the import you can move all records to the final destinations. An example of such a scenario is if you configured the export to include relations; In that case a number of records may follow the export outside the page tree structure you are exporting. To make sure that all of these external records are written to the database, importing into a Folder is a good idea. <b>Error messages:</b> Remember to consult the Message-tab before/after importing to see if there are any error messages there!
ar: <b>تلميح: استيراد إلى مجلد</b> للتأكد من عدم فقدان أي سجلات في أثناء الاستيراد، يمكنك أن تخطو بأمان عن طريق الاستيراد إلى مجلد قمت بإنشائه أولاً. بعد الاستيراد، يمكنك نقل جميع السجلات إلى الوجهات النهائية. مثال على هذا السيناريو: إذا قمت بتكوين التصدير بحيث يشمل العلاقات؛ في هذه الحالة قد يتبع عدد من السجلات التصدير خارج بنية شجرة الصفحات التي تصدرها. والتأكد من أن جميع هذه السجلات الخارجية مكتوبة إلى قاعدة البيانات، فإن الاستيراد إلى مجلد فكرة جيدة. <b>رسائل الخطأ:</b> تذكر أن تستشير رسالة التبويب قبل / بعد الاستيراد لمعرفة ما إذا كانت هناك أي رسائل خطأ هناك!
fr: <b>Astuce : Importer dans un dossier</b> Pour vous assurer qu'aucun enregistrement n'est perdu pendant l'importation, vous pouvez vous protéger en important dans un dossier que vous créez d'abord. Après l'importation, vous pouvez déplacer tous les enregistrements vers les destinations finales. Un exemple d'un tel scénario est si vous avez configuré l'exportation pour inclure des relations ; Dans ce cas, un certain nombre d'enregistrements peuvent suivre l'exportation en dehors de la structure de l'arborescence de pages que vous exportez. Pour s'assurer que tous ces enregistrements externes sont écrits dans la base de données, importer dans un dossier est une bonne idée. <b>Messages d'erreur :</b> N'oubliez pas de consulter l'onglet Messages avant/après l'importation pour voir s'il y a des messages d'erreur !
it: <b>Suggerimento: importa in una cartella</b> Per assicurarsi che nessun record venga perso durante l'importazione, puoi importare in una cartella precedentemente creata. Dopo l'importazione sarà possibile spostare tutti i record verso le destinazioni corrette. Un esempio di tale scenario potrebbe essere il caso in cui hai configurato l'esportazione per includere relazioni. In tal caso, un certo numero di record può seguire l'esportazione al di fuori della struttura dell'Albero delle Pagine, che si sta importando. Per assicurarsi che tutti questi record esterni siano scritti nel database, è una buona idea importare in una specifica cartella. <b>Messaggi di errore:</b> Ricordarsi di consultare la scheda Messaggio-prima / dopo l'importazione per vedere se ci sono messaggi di errore lì!

# _import.image
source: EXT:impexp/Resources/Public/Images/cshimages/import.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/import.png

# importFile.alttitle
source: Select file to import
ar: إختيار الملف المقرر تصديره.
fr: Sélectionnez le fichier à importer
it: Seleziona il file da importare

# importFile.description
source: The files displayed are those with an extension T3D or XML from fileadmin/, fileadmin/export/ and your "TEMP" folder (if any).
ar: وتكون الملفات المعروضة هي ذات الإمتداد T3D أو XML والتي تم تصديرها من fileadmin/, fileadmin/export/وككذلك من مجلدك "TEMP"(إن وجد بداخله أي منها).
fr: Les fichiers affichés sont ceux avec une extension T3D ou XML de fileadmin/, fileadmin/export/ et votre dossier "TEMP" (le cas échéant).
it: I file visualizzati sono quelli con estensione T3D o XML da fileadmin/, fileadmin/export/ e la cartella "TEMP" (se presente).

# _importFile.image
source: EXT:impexp/Resources/Public/Images/cshimages/import_selectfile.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/import_selectfile.png

# update.alttitle
source: Update instead of Insert
ar: التصدير عوضا عن الإدراج.
fr: Mettre à jour plutôt que d'insérer
it: Aggiorna invece di inserire

# update.description
source: By default the import operation inserts new records in the system. Using this option will update existing records.
ar: وبصفة إفتراضية فإن عملية التصدير تعمل على إدراج سجلات جديدة في النظام.واستخدام هذه الخاصية يعمل على تحديث سجلات الخرج
fr: Par défaut, l'opération d'importation insère de nouveaux enregistrements dans le système. Utiliser cette option mettra à jour les enregistrements existants.
it: Per impostazione predefinita, l'operazione di importazione inserisce nuovi record nel sistema. Utilizzando questa opzione aggiornerà i record esistenti.
