Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/impexp/Resources/Private/Language/*.locallang_csh.xlf
Languages: ar, fr, it

# inclRelations.details
source: Background: When you export a record in TYPO3 it might contain relations to other records in the system. You have to tell the export interface what to do with these relations. Basically there are three scenarios: - If relations are found between records that are all in the export configuration, there is no problem: The relations are automatically mapped to the new id's of those records when imported. - If the records related to are not included the relation will be lost (indicated with an error message in the preview) unless you a) either select that table in this selector box in which case all relations to that table will be included or b) if you set the table as a static table (in which case the relation is untouched and imported as-is - but which will of course break if no record with that UID is found in the import system). <b>Soft References:</b> Soft references are when a record contains pointers to external files or records but in fields where there are no formal relation configured. Examples of this is when a content element contains a "&lt;link 123&gt;" tag that represents a link to the page 123. This is not picked up formally as a reference, but is found anyhow as a "soft reference". The same goes for &lt;img&gt; tags with images from eg. "fileadmin/". By default soft references pointing to records or files will act as normal references; either including the referenced item or showing an error. However you can also choose to exclude the handling of individual soft references or maybe set the value as "editable" upon import. This is done with a selector box in the export preview.
ar: خلفية:عندما تقوم بتصدير سجلا ما داخل تيبو3 فقد يكون مرتبطا بسجلات أخرى داخل النظام.وعليك بإخبار واجهة التصدير كيف يجب أن تتعامل مع هذه الإرتباطاط.وبصورة أساسية يوجد ثلالثة سيناريوهات: إذا ما إنشأت هذه الروابط بين السجلات الواقعة جميعها داخل ظبط التصدير، وهذا لا مشكلة فيه:حيث تحول هذه الروابط إلى إمتدادات عند استيرادها إلى إمتدادات جديدة id لهذه السجلات. -وإذا لم يتم تضمين السجلات المرتطة فإنه ستفقد الروابط بين السجلات(ويشار إلى ذلك برسالة خطاء في العرض) إلا إذا a) لم تختار هذا الجدول في صندوق الإختيار في أي تكون جميع الروابط متضمنة داخل هذا الجدول. أو b)إذا ما تم ضبط الجدول كجدول إستاتيكي( في أي حالة لم يتم التعرض فيها للرابطة و لم يتم تصديرها كإمتداد -is و التي ستكسر بالطبع إذا لم يتم العثور على سجل بهذا UID داخل نظام التصدير). <b>المراجع المرنة:</b>تستخدم المراجع المرنة إذا ما إحتوى السجل على مؤشرات لملفات خارجية أو لسجلات ولكنها لا تستخدم إذا لم ضبط أي روابط صورية بين الحقول. ومثال على ذلك إذا ما إشتمل عنصر المحتوى على الملف الواصف "&lt;link 123&gt;" الذي يعرض رابطا للصفحة 123. ولا يعتد بذلك كمرجع بصورة رسمية،ولكنه يوجد بصورة ما "كمرجع مرن". و نفس الشئ بالنسبة للملفات الواصفة &lt;img&gt و المرفق بها صورا من "fileadmin/". وتشير الملفات المرنة بصورة إفتراضية إلى كل من الملفات و السجلات التي تعمل كمراجع عادية؛ سواء سواء كانت مشتملة على عناصر مرجعية أم أظهرت رسالة خطء.وبالرغم من ذلك فلك أن تستثنى عملية تناول المراجع المرنة الشخصية أو من الجائز ضبط القيمة على أنها قيمة "قابلة للتحرير"على إستيراد.ويم ذلك من خلال صندوق الإختيار داخل عرض التوريد.
fr: Explication : lorsque vous exportez un enregistrement dans TYPO3, il peut contenir des relations avec d'autres enregistrements du système. Vous devez dire à l'interface d'exportation que faire de ces relations. Dans l'ensemble, il y a trois scénarios : - Si des relations sont trouvées entre les enregistrements qui sont tous dans la configuration d'exportation, il n'y a pas de problème : les relations sont automatiquement mises à jour avec les nouveaux identifiants de ces enregistrements lorsqu'ils sont importés. - Si les enregistrements liés ne sont pas inclus, la relation sera perdue (indiquée avec un message d'erreur dans l'aperçu) à moins que vous a) sélectionnez cette table dans cette liste de choix, auquel cas toutes les relations à cette table seront incluses ou b) si vous définissez la table comme une relation statique (dans ce cas, la relation n'est pas touchée et importée comme telle - mais qui se cassera bien sûr si aucun enregistrement avec cet UID n'est trouvé lors de l'importation). <b>Références softs :</b> Les références softs sont quand un enregistrement contient des pointeurs vers des fichiers ou des enregistrements externes, mais dans des champs où il n'y a pas de relation directement configurée. Par exemple quand un élément de contenu contient une balise "&lt;link 123&gt;" qui représente un lien vers la page 123. Cela n'est pas pris directement comme une référence, mais est tout de même trouvé comme une "référence soft". Il en va de même pour les balises &lt;img&gt; avec des images du "fileadmin/". Par défaut, les références softs pointant vers des enregistrements ou des fichiers agiront comme des références normales ; soit inclure l'élément référencé soit afficher une erreur. Cependant vous pouvez aussi choisir d'exclure la prise en compte de chaque référence soft ou encore définir la valeur comme "éditable" lors de l'importation. Ceci est possible avec une option dans l'aperçu d'exportation.
it: Quando esporti un record in TYPO3, tale record potrebbe contenere relazioni con altri record nel sistema. Devi definire cosa fare con queste relazioni. Ci sono tre scenari: - Se ci sono relazioni tra record che sono tutti nella configurazione di esportazione, non c'è problema: le relazioni vengono mappate automaticamente al nuovo UID di quei record importati. - Se i record correlati non sono inclusi nella configurazione di esportazione, la relazione verrà persa (indicata con un messaggio di errore nell'anteprima) a meno che a) non selezioni la tabella in questo selettore, nel qual caso tutte le relazioni con quella tabella saranno incluse o b) se imposti la tabella come una tabella statica, nel qual caso la relazione non viene toccata e importata, ma che ovviamente si romperà se non si trova alcun record con quell'UID, durante l'importazione. <b>Riferimenti (a file/record):</b> i riferimenti sono campi di record contenenti puntatori a file o record esterni, ma in campi in cui non ci sono relazioni formali configurate. Un esempio di questo è quando un elemento di contenuto ha un tag "&lt;link 123&gt;" che rappresenta un collegamento alla pagina 123. Questo non è preso formalmente come relazione, ma è considerato come un "riferimento". Lo stesso vale per il tag &lt;img&gt;, per le immagini, per esempio dalla cartella "fileadmin/". Per default i riferimenti, che puntano a record o a file, fungono da riferimenti normali; includendo l'elemento referenziato o mostrando un errore. Tuttavia è anche possibile scegliere di escludere la gestione di singoli riferimenti o, in alternativa, impostare il valore come "modificabile" al momento dell'importazione. Questo è fatto con un selettore nell'anteprima di esportazione.

# inclRelations.image_descr
source: This example shows tree examples of references; a) an image attached to a content element, b) a relation to a frontend usergroup UID, and c) a soft reference found in the bodytext field of a record, here it is the link-tag pointing to the page with UID 1. Notice in the previous image how the relation to the frontend user group was lost. This has been corrected in this screenshot where the fe_group table has been selected in the list of table for which to include relations. The result is that the frontend usergroup is included as a record outside the exported pagetree. If you wanted to keep the relation but not include the usergroup you have to set "fe_groups" as a static table instead. See below. This example shows a TypoScript Template Record where multiple soft references has been found. The first one is an email address. Here it is configured to be editable. This means that upon import the user will have a chance to edit the value before the import is actually done. This is very useful when exported files are used as templates. Another example includes a PHP script which we don't want to include in the export and therefore we have selected the exclude option for the soft reference.
ar: يعرض هذا المثال ثلاثة أمثلة للمراجع؛ a) الصور المرفقة بعنصر المحتوى، b) علاقة لـUID لمجموعة المستخدم الأمامية، و (C مرجع مرن يوجد داخل حقل جسد النص الخاص بالسجل، وإليك نمط - الرابط الذي يشير إلى الصفحة بـ UID1. لاحظ كيف أن مجموعة الصورة السابقة فقدت العلاقة بمجموعة مستخدم الواجهة الأمامية. وقد تم تصليح ذلك داخل هذا الاختصار؛ حيث تم انتقاء جدول fe_group داخل قائمة الجدول تدرج قائمة الجدول بها.وستكون النتيجة هي إدراج مجموعة مستخدمي الواجهة الأمامية كسجل خارج صفحة الشجرة المستوردة. وإذا أردت، عوضا عن ذلك‘ الحفاظ على العلاقة دون إدراج مجموعة المستخدم فعليك ضبط "fe_group " كجدول ثابت عوضا عن ذلك. انظر بالأسفل يعرض هذا المثال سجل إحدى سجلات مخطوطة تيبو، حيث يوجد العديد من المراجع المرنة. ويعبر الجزء الأول عن عنوان البريد الإلكتروني. وقد تمت عملية ضبطه هنا كي يتم تحريره. وهذا يعني أنه وفقا للتصدير سيكون للمستخدم الفرصة لتحرير القيمة قبل أن تتم عملية التصدير بالفعل. ويكون ذلك مفيدا جدا عند استخدام الملفات المستوردة كنماذج.مثال آخر يتضمن مخطوطة والذي لا نريد إدراجه في عملية الاستيراد، ولذلك قمنا بانتقاء الخيار المحظور للمرجع المرن.
fr: Cet exemple montre des exemples d'arbres de références; a) une image attachée à un élément de contenu, b) une relation avec un UID de groupe d'utilisateurs frontend, et c) une référence soft trouvée dans le champ bodytext d'un enregistrement, avec une balise de lien pointant vers la page avec UID 1. Remarquez dans l'image précédente comment la relation avec le groupe d'utilisateurs en frontend a été perdue. Ceci a été corrigé dans cette capture d'écran où la table fe_group a été sélectionnée dans la liste des tables pour lesquelles inclure des relations. Le résultat est que le groupe d'utilisateurs du frontend est inclus comme un enregistrement en dehors de l'arborescence exportée. Si vous voulez conserver la relation, mais ne pas inclure le groupe d'utilisateurs, vous devez définir "fe_groups" comme une relation statique à la place. Voir ci-dessous. Cet exemple montre un enregistrement de gabarit TypoScript où plusieurs références softs ont été trouvées. La première est une adresse e-mail. Ici, elle est configurée pour être modifiable. Cela signifie que lors de l'importation, l'utilisateur aura l'opportunité de modifier la valeur avant que l'import ne soit fait. Ceci est très utile lorsque les fichiers d'export sont utilisés comme modèles. Un autre exemple inclut un script PHP que nous ne voulons pas inclure dans l'export et c'est pourquoi nous avons sélectionné l'option d'exclusion pour cette référence soft.
it: Questo mostra tre esempi di riferimenti: a) a un'immagine allegata a un elemento di contenuto, b) a un UID di gruppo utenti FE e c) a un riferimento nel campo testo di un record, ovvero un tag collegamento che punta alla pagina con UID 1. Nota come, nell'immagine precedente, la relazione con il gruppo utente FE è stata persa. Questo è stato poi corretto selezionando la tabella fe_group nell'elenco delle tabelle per le quali includere le relazioni. Il risultato è che il gruppo utente FE è incluso come record, al di fuori della pagina esportata. Se si desidera mantenere la relazione, ma non includere il "gruppo utenti", è necessario impostare "fe_groups" come tabella statica. Vedi sotto. Questo esempio mostra un record di Template TypoScript in cui sono stati trovati più riferimenti. Il primo è un indirizzo email. Qui è configurato per essere modificabile. Ciò significa che al momento dell'importazione l'utente avrà la possibilità di modificare il valore prima che l'importazione sia effettivamente fatta. Questo è molto utile quando i file esportati vengono utilizzati come modelli. Un altro esempio include uno script PHP che non vogliamo includere nell'esportazione: quindi abbiamo selezionato l'opzione di esclusione per il riferimento.

# staticRelations.alttitle
source: Set static tables
ar: ضبط الجداول الإستاتيكية
fr: Régler les tables statiques
it: Imposta tabelle statiche

# staticRelations.description
source: Select which tables in addition to the static TYPO3 tables to keep relations untouched for. Takes precedence over "Include relations" configured tables.
ar: حدد أي الجداول بالإضافة إلى الجداول الإستاتيكية يجب الإبقاء عليها كما هي.وتكون لها الأولوية على الجداول المعدة بخيار"إدراج الروابط".
fr: Sélectionnez les tables en plus des tables statiques TYPO3 pour garder les relations intactes. Prend la priorité sur les tables configurées "Include relations".
it: Seleziona per quali tabelle, in aggiunta alle tabelle statiche TYPO3, vuoi mantenere le relazioni inalterate. Ha la precedenza sulle tabelle configurate in "Includi relazioni".

# staticRelations.details
source: By default all relations to static tables in TYPO3 are kept untouched. Of course those static tables should be present in the import system in order for this to work correctly. However there might be circumstances where you move information between two systems where theoretically non-static tables should just keep relations untouched. Examples could be "sys_languages" or TemplaVoila data structures / template objects where two systems might contain the same set of records in those tables while you are importing pages and content elements freely.
ar: وبصورة إفتراضية يجب الإبقاء على جميع روابط الجداول الإستاتيكية الخاصة بتيبو3.وبالطبع لابد و أن تعرض هذه الجداول الإستاتيكية داخل نظام الإستيراد لضمان صحة عملها.وعلى الرغم من ذلك فقد تحتاج بعض الظروف إلى نقل المعلومات بين نظامين وفي هذه الحالة يجب الإبقاء على روابط الجداول الغير إستاتيكية نظريا.وقد يكون مثال ذلك "لغات النظام"أو عناصر نموذج /بنية البيانات الخاصة بالنموذجTemplaVoila حيث من الممكن لنظامين أن يشتملا على سجلات هذه الجداول و المضبوطة بنفس الكيفية و ذلك أثناء إستيراد الصفحات و عناصر المحتوى.
fr: Par défaut, toutes les relations avec les tables statiques de TYPO3 sont conservées. Bien sûr, ces tables statiques devraient être présentes dans le système d'importation pour que cela fonctionne correctement. Cependant il peut y avoir des circonstances où vous déplacez des informations entre deux systèmes où théoriquement les tables non statiques devraient juste garder les relations intactes. Les exemples peuvent être "sys_languages" ou des structures de données / template TemplaVoila où deux systèmes peuvent contenir le même ensemble d'enregistrements dans ces tables pendant que vous importez librement des pages et des éléments de contenu.
it: Per default, tutte le relazioni con le tabelle statiche di TYPO3 sono mantenute intatte. Naturalmente tali tabelle statiche dovrebbero essere presenti nel sistema di importazione affinché possa funzionare correttamente. Tuttavia potrebbero esserci circostanze in cui si spostano le informazioni tra due sistemi in cui, teoricamente, le tabelle non statiche dovrebbero mantenere intatte le relazioni. Esempi potrebbero essere "sys_languages" o record Template per i quali i due sistemi potrebbero contenere lo stesso insieme di record in quelle tabelle, mentre si importano pagine ed elementi di contenuto.

# staticRelations.image_descr
source: In this example you see how a number of records are pointing to a System Language record which will become lost relations when imported because the record is not included in the export. However; in the target system the System Languages are exactly the same and therefore you just want a static mapping of the relations. The static mapping is obtained by selecting the "sys_language" table as a static template meaning that the relations are kept at their current values assuming that they will be exactly the same in the target system when imported.
ar: وفي هذا المثال يمكن ان ترى كيف يمكن لعدد من السجلات أن تشير إلى سجل لغة النظام والذي يقفد ما به من روابط أثناء عملية التصدير نظرا لعدم إدراجح السجل في ملفات التصدير.وبالرغم من ذلك؛ فبداخل النظام الهدف تتشابه جميع لغات النظام وعليه فإنك تكون في حاجة فقط إلى عمل مقابلة إستاتيكية للروابط. وتتم المقابلة الإستاتيكية بإختيار الجدول"لغة النظام"كنموذج إستاتيكي يعني أنه تم الإبقاء على الروابط كما هي عند قيمها الحالية بفرض أنها ستظل كما هي داخل النظام الهدف أثناء عملية الإستيراد.
fr: Dans cet exemple, vous voyez comment un certain nombre d'enregistrements pointent vers un enregistrement Langages du système qui deviendra une relation perdue lors de l'importation parce que l'enregistrement n'est pas inclus dans l'exportation. Cependant, dans le système cible, les Langages du système sont exactement les mêmes et vous voulez juste une correspondance statique des relations. La correspondance statique est obtenue en sélectionnant la table "sys_language" comme table statique, ce qui signifie que les relations sont conservées à leurs valeurs actuelles en supposant qu'elles seront exactement les mêmes dans le système cible lors de leur importation.
it: In questo esempio si vede come un certo numero di record stanno puntando a un record di lingua di sistema che diventeranno "relazioni perse" quando importate, perché il record non è incluso nell'esportazione. Tuttavia nel sistema di destinazione, le lingue di sistema sono esattamente le stesse e quindi si desidera solo una mappatura statica delle relazioni. La mappatura statica si ottiene selezionando la tabella "sys_language" come modello statico che significa che le relazioni sono mantenute ai loro valori attuali supponendo che saranno esattamente le stesse nel sistema di destinazione, quando importati.

# excludedElements.alttitle
source: Excluded elements
ar: عناصر مستثناه
fr: Eléments exclus
it: Elementi esclusi

# excludedElements.description
source: By the "Exclude" checkbox you can exclude specific records from the preview display of the export. Which records has been picked for specific exclusion is listed here. You can also clear the exclusion configuration.
ar: بإختيار خاصية "مستثنى" من صندوق الإختيار يتم إستثناء سجلات خاصة من العرض الخاص بالتصدير.أي السجلات قد تم تحديدها كي تستثنى من القائمة.كما أيضا إلغاء عملية الإستثناء.
fr: En cliquant sur la case à cocher "exclure", vous pouvez exclure des enregistrements spécifiques à l'export prévu. Vous pouvez voir la liste des enregistrements à exclure ici. Vous pouvez aussi effacer les paramètres d'exclusion.
it: Con l'opzione "Escludi" è possibile escludere record specifici dall'anteprima di esportazione. Qui sono elencati i record scelti per un'esclusione specifica. Puoi anche annullare la configurazione di esclusione.

# _excludedElements.image
source: EXT:impexp/Resources/Public/Images/cshimages/excludebox.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/excludebox.png

# htmlCssResources.alttitle
source: Exclude resources from HTML and CSS files
ar: إستثناء المصادر من ملفات HTMLوCSS.
fr: Exclure les ressources des fichiers HTML et CSS
it: Escludi file HTML e CSS

# htmlCssResources.description
source: When an HTML or CSS file is found as a soft reference the files are parsed for references to external media (such as images) and if any are found they are also exported. If you don't want this behaviour, click this option.
ar: وإذا ما تواجد أي من الملفين HTML or CSS كمرجع مرن فإن هذه الملفات تقطع لتعمل كمراجع لوسائط الخارجية(كالصور مثلا)و إذا ما تواجد أي من هذه الملفات فإنه يتم تصديرها مباشرة.وإذا لا كنت ترغب في حدوث ذلك ، يمكنك النقر على هذا الخيار.
fr: Lorsqu'un fichier HTML ou CSS est trouvé comme une référence soft, les fichiers sont analysés pour des références à des médias externes (comme des images) et s'ils sont trouvés, ils sont également exportés. Si vous ne voulez pas ce comportement, activez cette option.
it: Quando un file HTML o CSS viene trovato come riferimento, i file vengono analizzati per i riferimenti a supporti esterni (come per le immagini) e se vengono trovati saranno esportati. Se non vuoi questo comportamento, fai clic su questa opzione.

# htmlCssResources.details
source: Notice: Resources found inside an HTML or CSS file are not analyzed further. For instance it means that any CSS files referred to from within an HTML will not be traversed - but CSS files referred to inside the Setup or Constant field of a TypoScript template record will be!
ar: ملاحظة: الموارد التي تم العثور عليها داخل مِلَفّ HTML أو CSS لم يتم تحليلها أكثر. على سبيل المثال، هذا يعني أن أي ملفات CSS المشار إليها من داخل HTML لن يتم تجاوزها - ولكن ملفات CSS المشار إليها داخل الإعداد أو الحقل الثابت لسجل قالب TypoScript سوف تكون!
fr: Information : les ressources trouvées dans un fichier HTML ou CSS ne sont pas analysées à leur tour. Par exemple, cela signifie que tous les fichiers CSS mentionnés à partir d'un code HTML ne seront pas parcourus - mais les fichiers CSS référencés dans le champ Setup ou Constant d'un enregistrement de gabarit TypoScript le seront !
it: Nota: le risorse (es. le immagini, le font) trovate all'interno di un file HTML o CSS non vengono analizzate ulteriormente. Significa che qualsiasi file CSS, a cui si fa riferimento all'interno di un HTML, non sarà analizzato, ma i file CSS, a cui si fa riferimento Costanti e Configurazione di un Template TypoScript, saranno invece analizzati!

# htmlCssResources.image_descr
source: In this example you can see that a soft reference has been found pointing to an HTML file inside fileadmin/ Since it was an HTML file it was parsed and further a number of files were found referenced inside it and now included with the export. This feature is specifically created to support export of template configurations where external HTML files play a role.
ar: وفي هذا المثال يمكن أن نرى ان المرجع المرن قد وجدت تشير إلى إحدى ملفات HTML مجلد المدرج داخل fileadmin/وبإعتبار أنه ملف HTMLفقد تم تحلييله إلى حيث وجد بداخل عدد x من الملفات محالا إليها و التي قد تم تضمينها الآن مع ملفات التصدير.
fr: Dans cet exemple, vous pouvez voir qu'une référence soft pointant vers un fichier HTML dans fileadmin/. Vu qu'il s'agissait d'un fichier HTML, il a été analysé et un certain nombre de fichiers référencés ont été trouvés à l'intérieur et sont maintenant inclus avec l'exportation. Cette fonctionnalité est spécialement créée pour permettre l'export des configurations de gabarits où les fichiers HTML externes jouent un rôle.
it: In questo esempio puoi vedere che è stato trovato un riferimento che indica un file HTML all'interno di fileadmin/. Essendo un file HTML è stato analizzato e inoltre sono stati trovati alcuni file referenziati al suo interno e ora inclusi con l'esportazione. Questa funzione è specificamente creata per supportare l'esportazione di configurazioni di modelli in cui i file HTML esterni giocano un ruolo fondamentale.

# extensionDependencies.alttitle
source: Extension Dependencies
ar: الأمتدادت المستقلة.
fr: Dépendances des extensions
it: Dipendenze

# extensionDependencies.description
source: Select which extensions should be installed in the import system in order for your exported content to work correctly. Examples could be "templavoila" for templating, "fluid_styled_content" for the template, "tt_news" for a news archive etc.
ar: حدد أي من الإضافات يجب تثبيتها في نظام الاستيراد لكي يعمل المحتوى الذي تم تصديره بشكل صحيح. يمكن أن تكون الأمثلة "templavoila" للقالب، "fluid_styled_content" للقالب، "tt_news" لأرشيف الأخبار، إلخ.
fr: Sélectionnez les extensions qui doivent être installées dans le système d'importation pour que votre contenu exporté fonctionne correctement. Les exemples pourraient être "templavoila" pour le template, "fluid_styled_content" pour le template, "tt_news" pour une archive de nouvelles, etc.
it: Seleziona quali estensioni dovranno essere installate nel sistema, in cui sarà effettuata l'importazione, affinché il contenuto esportato funzioni correttamente. Esempi potrebbero essere "templavoila", "fluid_styled_content", "tt_news" per le notizie, ecc.
