Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/impexp/Resources/Private/Language/*.locallang.xlf
Languages: ar

source: Import
ar: استيراد

source: Export
ar: تصدير

# title
source: Import / Export
ar: استيراد/ تصدير

# title_import
source: Import
ar: استيراد

# title_export
source: Export
ar: تصدير

# tableselec_configuration
source: Configuration
ar: ضبط

# exportdata_savedFile
source: SAVED FILE
ar: ملف محفوظ

# exportdata_savedInSBytes
source: Saved in "%s", bytes %s
ar: محفوظ في "%s" ، عدد وحدات البايت %s

# exportdata_problemsSavingFile
source: Problems saving file
ar: حدثت مشكلة أثناء حفظ الملف

# exportdata_badPathS
source: Bad path: "%s"
ar: مسار غير جيد: "%s"

# exportdata_filePreset
source: File & Preset
ar: ملف وإعداد أولي

# exportdata_advancedOptions
source: Advanced Options
ar: خيارات متقدمة

# exportdata_messages
source: Messages
ar: الرسائل

# execlistqu_structureToBeExported
source: Structure to be exported
ar: الهيكل المُراد تصديره

# impexpcore_toggle_all_disabled_records
source: Toggle disabled records
ar: تبديل التسجيلات المُعطّلة

# makeconfig_exportPagetreeConfiguration
source: Export pagetree configuration
ar: تصدير تكوين شجرة الصفحة

# makeconfig_pageId
source: Page ID
ar: ID الصفحة

# makeconfig_tree
source: Tree
ar: شجرة

# makeconfig_noTreeExportedOnly
source: No tree exported - only tables on the page.
ar: لم يتم تصدير أي شجرة - فقط الجداول على الصفحة.

# makeconfig_tablesOnThisPage
source: Tables on this page
ar: الجداول على هذه الصفحة

# makeconfig_levels
source: Levels
ar: المستويات

# makeconfig_includeTables
source: Include tables
ar: تضمين الجداول

# makeconfig_exportSingleRecord
source: Export single record
ar: تصدير سجل مُفرد

# makeconfig_record
source: Record
ar: السجل

# makeconfig_exportTablesFromPages
source: Export tables from pages
ar: تصدير الجداول من الصفحات

# makeconfig_tablePids
source: Table/Pids
ar: الجدول/Pids

# makeconfig_tableListEntry
source: Table "%s" from %s
ar: الجدول "%s" من %s

# makeconfig_relationsAndExclusions
source: Relations and Exclusions
ar: العلاقات والاستثناءات

# makeconfig_includeRelationsToTables
source: Include relations to tables
ar: تضمين العلاقات في الجداول

# makeconfig_useStaticRelationsFor
source: Use static relations for tables
ar: استخدم العلاقات الثابتة للجداول

# makeconfig_showStaticRelations
source: Show static relations
ar: إظهار العلاقات الثابتة

# makeconfig_excludeElements
source: Exclude elements
ar: استبعاد عناصر

# makeconfig_clearAllManualExclusions
source: Clear all manual exclusions
ar: مسح جميع الاستثناءات اليدوية

# makeconfig_noManuallyExcludedElementsYet
source: No manually excluded elements yet. Exclude by setting checkboxes below in the element display.
ar: لا توجد عناصر مُستثناة يدوياً حتى الآن. يمكنك الاستثناء عن طريق إعداد مربعات الاختيار أدناه في عرض العنصر.

# makeconfig_excludeDisabledElements
source: Exclude disabled elements
ar: استبعاد العناصر المُعطّلة

# makeadvanc_update
source: Update
ar: تحديث

# makeadvanc_softReferences
source: Soft References
ar: المراجع البرمجيّة

# makeadvanc_excludeHtmlCssFile
source: Exclude HTML/CSS file resources
ar: استبعاد مصادر مِلَفّ HTML/CSS

# makeadvanc_files
source: Files
ar: الملفات

# makeadvanc_saveFilesOutsideExportFile
source: Save files in extra folder beside the export file
ar: حفظ الملفات في مجلد إضافي بجانب ملف التصدير

# makeadvanc_saveFilesOutsideExportFile_limit
source: (supported for "Save to filename" only)
ar: (مدعوم لـ "حفظ إلى اسم الملف" فقط)

# makeadvanc_extensionDependencies
source: Extension dependencies
ar: تبعيات الإضافة

# makeadvanc_selectExtensionsThatThe
source: Select extensions that the exported content depends on
ar: حدد الإضافات التي يعتمد عليها المحتوى المُصدّر

# makesavefo_update
source: Update
ar: تحديث

# makesavefo_presets
source: Presets
ar: الإعدادات المُسبقة

# makesavefo_selectPreset
source: Select preset
ar: حدد الإعداد المُسبق

# makesavefo_load
source: Load
ar: تحميل

# makesavefo_save
source: Save
ar: حفظ

source: Please confirm
ar: الرجاء التأكيد

# makesavefo_areYouSure
source: Are you sure?
ar: هل أنت واثق؟

# makesavefo_delete
source: Delete
ar: حذف

# makesavefo_merge
source: Merge
ar: تجميع

# makesavefo_titleOfNewPreset
source: Title of new preset
ar: عنوان الإعداد المُسبق الجديد

# makesavefo_public
source: Public
ar: عام

# makesavefo_outputOptions
source: Output options
ar: خيارات المُخرجات

# makesavefo_title
source: Title
ar: العنوان

# makesavefo_description
source: Description
ar: الوَصف

# makesavefo_notes
source: Notes
ar: الملاحظات

# makesavefo_t3d_compressed
source: T3D file / compressed
ar: ملف T3D / مضغوط

# makesavefo_t3d
source: T3D file
ar: ملف T3D

# makesavefo_xml
source: XML
ar: صيغة XML

# makesavefo_fileFormat
source: File format
ar: صيغة الملف

# makesavefo_filenameSavedInS
source: Filename (saved in "%s")
ar: اسم الملف (حفظ في "%s")

# makesavefo_downloadExport
source: Download export
ar: تصدير تنزيل

# importdata_saveToFilename
source: Save to filename
ar: حفظ إلى اسم الملف

# importdata_selectFileToImport
source: Select file to import
ar: حدد ملف للاستيراد

# importdata_file
source: File
ar: الملف

# importdata_fromPathS
source: From path: %s
ar: من المسار: %s

# importdata_noteNoDecompressorAvailable
source: NOTE: No decompressor available for compressed files!
ar: ملاحظة: لا يوجد برنامج فك يتوافر للملفات المضغوطة!

# importdata_importOptions
source: Import Options
ar: خيارات الاستيراد

# importdata_update
source: Update
ar: تحديث

# importdata_updateRecords
source: Update records
ar: سجلات التحديث

# importdata_thisOptionRequiresThat
source: This option requires that the structure you import already exists on this server and only needs to be updated with new content!
ar: يتطلب هذا الخيار أن تتواجد البنية التي تستوردها بالفعل على هذا الملقم وأنك تحتاج فقط إلى تحديثها بالمحتوى الجديد!

# importdata_ignorePidDifferencesGlobally
source: Ignore PID differences globally
ar: تجاهل اختلافات أرقام التعريف بشكل عام

# importdata_ifYouSetThis
source: If you set this option, the position of updated elements will not be updated to match the structure of the input file.
ar: إذا قمت بانتقاء هذا الخيار، فلن يتم تحديث موضع العناصر المحدثة لتتناسب مع بنية ملف الدخل.

# importdata_force_all_UIDS
source: Force ALL UIDs values
ar: دفع جميع قيم النماذج

# importdata_force_all_UIDS_descr
source: With this option the original UID value of all imported records are forced to be the same. BE VERY CAREFUL WITH THIS! (Admin Only).
ar: مع هذا الخيار، فإن قيم النماذج الأصلية للسجلات النمصدرة يجب أن تكون متشابة. كن حذرا تماما من ذلك!(قاصرا على المرشدين فقط(.

# importdata_options
source: Options
ar: الخيارات

# importdata_doNotShowDifferences
source: Do not show differences in records
ar: لا تعرض الاختلافات في السجلات

# importdata_greenValuesAreFrom
source: Green values are from the import file, red values from the current database record and black values are similar in both versions.
ar: القيم الخضراء هي من ملف الاستيراد، والقيم الحمراء من سجل قاعدة البيانات الحالية والقيم السوداء هي نفسها في كلي النسختين.

# importdata_action
source: Action
ar: إجراء

# importdata_preview
source: Preview
ar: عرض أولي

# importdata_import
source: Import
ar: استيراد

# importdata_newImport
source: New import
ar: استيراد جديد

# importdata_enableLogging
source: Enable logging
ar: تفعيل تسجيل الدخول

# importdata_writeIndividualDbActions
source: Write individual database actions during import to the log
ar: كتابة إجراءات قاعدة البيانات الفردية خلال الاستيراد إلى السجل

# importdata_thisIsDisabledBy
source: This is disabled by default since there may be hundred of entries generated.
ar: هذا الخيار ملغى في الضبط الأساسي نظرا لأنه قد يكون هناك المئات من المداخل تم توليدها.

# importdata_uploadFileFromLocal
source: Upload file from local computer
ar: تحميل ملف من الحاسوب المحلي

# importdata_browse
source: Browse
ar: تصفّح

# importdata_uploadStatus
source: Upload status
ar: حالة التحميل

# importdata_success
source: Success
ar: تم بنجاح

# importdata_failureNoFileUploaded
source: Failure: No file uploaded - was it too big? Check system log.
ar: خطأ: لم يتم تحميل أي ملف - هل كان كبيرا جدا؟ يرجى فحص سجل النظام.

# importdata_upload
source: Upload
ar: تحميل

# importdata_upload_error
source: Upload error
ar: خطأ في التحميل

# importdata_upload_nodata
source: The import module hasn't received any data. This may occur due to a file upload with a large file. Please check the file size of your uploaded file with the server's post_max_size and upload_max_filesize configuration.
ar: لم تستلم وحدة الاستيراد أي بيانات. قد يحدث هذا بسبب تحميل مِلَفّ كبير الحجم. الرجاء التحقق من حجم المِلَفّ الخاص بك الذي تم تحميله مع تكوين الخادم post_max_size و upload_max_filesize configury.

# importdata_metaData
source: Meta data
ar: البيانات الوصفية

# importdata_title
source: Title
ar: العنوان

# importdata_description
source: Description
ar: الوَصف

# importdata_notes
source: Notes
ar: الملاحظات

# importdata_packager
source: Packager
ar: الحُزمْ

# importdata_email
source: Email
ar: البريد الإلكتروني

# importdata_metaData_1387
source: Meta data
ar: البيانات الوصفية

# importdata_messages
source: Messages
ar: الرسائل

# importdata_structureHasBeenImported
source: Structure has been imported, here is the result
ar: تم استيراد الهيكل, هذه هي النتيجة

# importdata_no_default_upload_folder
source: No default upload folder
ar: لا يوجد مجلد تحميل افتراضي

# filterpage_structureToBeImported
source: Structure to be imported
ar: الهيكل المُراد استيراده

source: [ ALL tables ]
ar: [ جميع الجداول ]

# impexpcore_displaycon_controls
source: Controls
ar: عناصر التحكم

# impexpcore_displaycon_title
source: Title
ar: العنوان

# impexpcore_displaycon_message
source: Message
ar: الرسالة

# impexpcore_displaycon_updateMode
source: Update Mode
ar: وضع التحديث

# impexpcore_displaycon_currentPath
source: Current Path
ar: المسار الحالي

# impexpcore_displaycon_result
source: Result
ar: النتيجة

# impexpcore_displaycon_insidePagetree
source: Inside pagetree
ar: داخل شجرة الصفحة

# impexpcore_singlereco_outsidePagetree
source: Outside pagetree
ar: خارج شجرة الصفحة

# impexpcore_singlereco_softReferencesFiles
source: Soft References Files
ar: ملفات المراجع البرمجيّة

# impexpcore_singlereco_update
source: Update
ar: تحديث

# impexpcore_singlereco_insert
source: Insert
ar: إدراج

# impexpcore_singlereco_importAsNew
source: Import as new
ar: استيراد كجديد

# impexpcore_singlereco_ignorePid
source: Ignore PID
ar: تجاهل رقم التعريف

# impexpcore_singlereco_respectPid
source: Respect PID
ar: اعتبار رقم التعريف

# impexpcore_singlereco_forceUidSAdmin
source: Force UID [%s] (Admin)
ar: النماذج[%s] (مشرف)

# impexpcore_singlereco_exclude
source: Exclude
ar: استثناء

# impexpcore_singlereco_title
source: Title
ar: العنوان

# impexpcore_singlereco_filename
source: Filename
ar: اسم الملف

# impexpcore_singlereco_value
source: Value
ar: القيمة

# impexpcore_softrefsel_record
source: Record
ar: السجل

# impexpcore_softrefsel_editable
source: Editable
ar: قابل للتحرير

# impexpcore_softrefsel_exclude
source: Exclude
ar: استثناء

# impexpcore_printerror_description
source: Description
ar: الوَصف
