Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/impexp/Resources/Private/Language/*.locallang_csh.xlf
Languages: ar, fr, it

# .alttitle
source: Import / Export
ar: استيراد/ تصدير
fr: Importer / Exporter
it: Importa / Esporta

# .description
source: Native module for importing and exporting TYPO3 data. Can export single records, content of tables, single pages, parts of or the whole page tree. Includes attached media like images and preserves relations between records. Exports either to XML or a TYPO3 specific format T3D (compressed or uncompressed). The format is meant for exchange between TYPO3 systems.
ar: الوحدة الأصلية لاستيراد وتصدير بيانات TYPO3. يمكن تصدير سجلات فردية أو محتوى جداول أو صفحات فردية أو أجزاء من شجرة الصفحة بأكملها. هذا يشمل الوسائط المُرفقة مثل الصور، ويحافظ على العلاقات بين السجلات. قم بتصديره إما إلى XML أو TYPO3 بتنسيق محدد T3D (مضغوط أو غير مضغوط). التنسيق مخصص للتبادل بين أنظمة TYPO3.
fr: Module d'import/export natif pour les données de TYPO3. Permet l'export d'enregistrements individuels, de contenus de tables, de pages, d'une partie ou de l'intégralité de l'arborescence des pages. Inclut les fichiers média attachés comme les images et préserve les relations entre les enregistrements. Exporte soit en XML, soit dans un format T3D spécifique à TYPO3 (compressé ou non). Le format est destiné à l'échange entre les systèmes TYPO3.
it: Modulo nativo per importare ed esportare i dati TYPO3. Puoi esportare singoli record, contenuto di tabelle, singole pagine, parti o l'intero albero delle pagine. Include i media allegati, come le immagini, e preserva le relazioni tra i record. Esporta in XML o nel formato specifico TYPO3 T3D (compresso o non compresso). Il formato è pensato per lo scambio tra sistemi TYPO3.

# _.image
source: EXT:impexp/Resources/Public/Images/cshimages/impexp.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/impexp.png

# .image_descr
source: Example of the preview display during export configuration of a page. Notice how records on the page are include plus how references inside the record is found and included as well (bottom of screen).
ar: مثال للعرض الأولي أثناء ضبط تصدير الصفحة.لاحظ كيف يتم إدراج سجلات الصفحة وكذلك لاحظ كيف تنشئ المراجع داخل السجل الواحد والمدرجة أيضا(أسفل الصفحة).
fr: Exemple de prévisualisation durant la configuration de l'export d'une page. Voyez comment les enregistrements d'une page sont inclus et comment les références à l'intérieur de ces enregistrements sont trouvées et inclues (bas de l'écran).
it: Esempio di anteprima durante la configurazione di esportazione di una pagina. Nota come sono inclusi i record nella pagina e come vengono trovati e inclusi anche i riferimenti all'interno del record (in fondo).

# export.alttitle
source: Exporting records from TYPO3
ar: عملية استيراد السجلات من تيبو3.
fr: Exporter les enregistrements de TYPO3
it: Esportazione di record da TYPO3

# export.description
source: To export TYPO3 T3D/XML files you click any record icon or page in the page tree (including the root page!), select "More options" and then "Export". This will bring up the export interface where you can configure options for your export session.
ar: لتصدير ملفات TYPO3 T3D/XML يمكنك النقر فوق أي أيقونة تسجيل أو صفحة في شجرة الصفحة (بما في ذلك صفحة الجذر)! ، حدد "المزيد من الخيارات" ثم "التصدير". سيؤدي هذا إلى جلب واجهة التصدير حيث يمكنك تكوين خيارات لجلسة التصدير الخاصة بك.
fr: Pour exporter des fichiers TYPO3 T3D/XML, cliquez sur l'icône d'un enregistrement ou d'une page de l'arborescence (y compris la page racine !), sélectionnez "Plus d'options" puis "Exporter". Cela affichera l'interface d'exportation où vous pourrez configurer les options pour votre projet d'exportation.
it: Per esportare i file T3D/XML di TYPO3, fai clic su qualsiasi icona o pagina del record nell'Albero delle Pagine (inclusa la pagina root!), seleziona "Altre opzioni" e poi "Esporta". Questo farà apparire l'interfaccia di esportazione dove è possibile configurare le opzioni per la sessione di esportazione.

# export.details
source: There are a number of methods by which you can export data from TYPO3: - Export a single page or branch of the page tree (use page icon context menu) - Export a single record from any page (use record icon context menu) - Export all records from a specific table on a specific page (using the Web>List module) - Export an arbitrary selection of records from the clipboard (using the Web>List module) The export format observes all TYPO3s methods for relations between the records in the export file. But you will have to configure how these relations are maintained, at least to some degree. Sometimes you would want to include records referred to, at other times you surely want to keep the original mapping. That depends on your objectives with the export. Regardless of your configuration for export you will always see a complete reflection of all chosen records and their internal relations in the preview display found in the bottom of the export module page. <b>Error messages:</b> Remember to consult the Message-tab before exporting if there are any error messages there!
ar: هناك عددا من النماذج التي تمكنك من تصدير البيانات من تيبو3 و منها: -تصدير صفحة مفردة أو فرع من فروع صفحة الشجرة(استخدم في ذلك أيقونة الصفحة الخاصة بقائمة السياق) -تصدير سجل مفرد من اي صفحة من الصفحات (استخدم لذلك أيقونة السجل الخاصة بقائمة السياق) -تصدير جميع السجلات من داخل جدول خاص داخل صفحة خاصة(استخدم لذلك نموذج وب<قائمة) -تصدير إختيارعشوائي للسجلات من ذاكرة التخزين المؤقتة (استخدم لذلك نموذج وب<قائمة) ويراقب نسق التصدير جميع الطرق التي يستخدمها تيبو3 لعمل الروابط بين السجلات داخل ملف التصدير. ولكنه عليك القيام بضبط الكيفية التي تعالج بها هذه الروابط، على الأقل لدرجة معينة. وفي بعض الحالات قد تكون في حاجة لإدراج سجلات كي يتم الإشارة إليها، وفي حالات أخرى تكون في حالة أكيدة للحفاظ على عملية المقابلة الأصلية.والتي تعتمد على اهدافك أثناء عملية التصدير. وبصرف النظر عن ضبطتك لعملية التصدير فإنك سترى دائما إنعكاس تام لجميع السجلات المختارة والروابط الداخلية الخاصة بها في العرض الأولي والمتواجد في قاع صفحة نموذج التصدير. <b>رسائل خطأ:</b> تذكر إستشارة جدولة الرسالة قبل عملية التصدير عند ظهور أي رسائل خطأ.
fr: Il y a un certain nombre de méthodes par lesquelles vous pouvez exporter des données depuis TYPO3 : - Exporter une seule page ou une seule branche de l'arborescence (utiliser le menu contextuel d'icône de page) - Exporter un seul enregistrement depuis n'importe quelle page (utiliser le menu contextuel d'icône d'enregistrement) - Exporter tous les enregistrements depuis un tableau spécifique sur une page spécifique (en utilisant le module Web>Liste de listes) - Exporter une sélection arbitraire d'enregistrements depuis le presse-papiers (en utilisant le module Web>Liste) Le format d'exportation respecte toutes les méthodes de TYPO3 pour les relations entre les enregistrements dans le fichier d'exportation. Mais vous devrez configurer la manière dont ces relations sont maintenues, du moins dans une certaine mesure. Parfois, vous voudrez embarquer les enregistrements liés, à d'autres moments, vous voudrez sûrement garder la correspondance originale. Cela dépend de vos objectifs d'exportation. Indépendamment de votre configuration pour l'exportation, vous verrez toujours une vision complète de tous les enregistrements choisis et de leurs relations internes dans l'aperçu affiché en bas de la page du module d'exportation. <b>Messages d'erreur :</b> N'oubliez pas de consulter l'onglet Message avant d'exporter s'il y a des messages d'erreur !
it: C'è un certo numero di metodi con cui è possibile esportare i dati da TYPO3: - Esportare una singola pagina o ramo dell'albero delle pagine (usare il menù contestuale dell'icona della pagina) - Esportare un singolo record da qualsiasi pagina (usare il menù contestuale dell'icona del record) - Esportare tutti i record da una specifica tabella su una pagina specifica (utilizzando il modulo Web>Lista) - Esportare una selezione arbitraria di record dalla clipboard (utilizzando il modulo Web>Lista) Il formato di esportazione rispetta tutti i metodi TYPO3 per le relazioni tra i record nel file di esportazione. Ma si dovrà configurare come queste relazioni sono mantenute, almeno in una certa misura. A volte si desidera includere i record a cui si riferisce, in altre occasioni si desidera sicuramente mantenere la mappatura originale. Ciò dipende dagli obiettivi della tua esportazione. Indipendentemente dalla tua configurazione per l'esportazione, vedrai sempre un riflesso completo di tutti i record scelti e le loro relazioni interne nella visualizzazione dell'anteprima trovata in fondo alla pagina del modulo di esportazione. <b>Messaggi di errore:</b> ricordati di consultare gli eventuali messaggi prima di esportare, nel caso ci fossero errori!

# export.image_descr
source: To export a page or record, simply click the icon and select "Export" from the context menu. With the Web>List module you can also export all records from a table by first clicking the table title to see only this table, then next to the CSV export you will find the export button for a T3D export of the table. You can export the contents of the clipboard as well by simply selecting "Export" in the menu.
ar: لتصدير صفحة أو سجل فقط عليك بالنقر على الأيقونة ثم قم بإختيار خاصية"تصدير"من قائمة السياق. وباستخدام نموذج وب<قائمة يمكنك أيضا تصدير جميع اسجلات من من جدول ما ويكون ذلك أولا بالضغط على عنوان الجدول فقط لرؤية الجدول وبالقرب من زر تصدير CSV ستجد زر تصدير لتصدير T3Dالخاص باجدول. ويمكنك تصدير محتويات ذاكرة التخزين المؤقتة أيضا و ذلك ببساطة عند النقر على خاصية "تصدير"في القائمة.
fr: Pour export une page ou un enregistrement, cliquez simplement sur son icône et sélectionnez "Export" dans le menu contextuel. Avec le module Web > Liste, vous pouvez également exporter tous les enregistrements d'une table en cliquant sur le titre de la table afin de la sélectionner, puis en cliquant sur le bouton 3export T3D de la table" placé à côté du bouton "Export CSV". Vous pouvez exporter le contenu du presse-papier en utilisant "Export" dans le menu.
it: Per esportare una pagina o un record, fai clic sull'icona e seleziona "Esporta" dal menù contestuale. Con il modulo Web>Lista puoi anche esportare tutti i record da una tabella facendo clic sul titolo della tabella per vedere solo questa tabella, poi accanto all'esportazione CSV troverai il bottone di esportazione per un'esportazione T3D della tabella. È possibile esportare anche il contenuto della clipboard semplicemente selezionando "Esporta" nel menù.

# pageTreeCfg.alttitle
source: Configuration of page tree export
ar: ضبط تصدير صفحة الشجرة.
fr: Configuration de l'arborescence à exporter
it: Configurazione dell'esportazione dell'albero delle pagine

# pageTreeCfg.description
source: Here you configure how a page or a branch of the page tree should be exported. Using the selector box you can set the number of levels of subpages to include in the export. By default all records belonging to a page is included when a page is exported.
ar: من هنا يمكنك ضبط كيف يتم تصدير صفحة أو فرع من صفحة الشجرة.وباستخدام صندوق الإختيار يمكنك ضبط عدد مستويات الصفحات الفرعية الداخلة في عملية التصدير.وبصورة أساسية يتم تصدير جميع السجلات المنتمية لهذه الصفحة.
fr: Vous pouvez configurer ici comment une page ou un branche de l'arborescence doit être exportée. En utilisant la boîte de sélection, vous pouvez définir le nombre de niveaux de sous-pages à inclure dans l'exportation. Par défaut, tous les enregistrements de la page sont inclus lorsque la page est exportée.
it: Qui puoi configurare come esportare una pagina o un ramo dell'Albero delle Pagine. Puoi impostare il numero di livelli di sottopagine da includere nell'esportazione. Per impostazione predefinita tutti i record appartenenti a una pagina sono inclusi quando una pagina viene esportata.

# _pageTreeCfg.image
source: EXT:impexp/Resources/Public/Images/cshimages/pagetreecfg.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/pagetreecfg.png

# pageTreeDisplay.alttitle
source: Page Tree
ar: صفحة الشجرة
fr: Arborescence des pages
it: Albero delle Pagine

# pageTreeDisplay.description
source: Based on the levels selected for page tree export this will show the structure that is about to be exported. If any pages are specifically excluded by the exclude option they are not shown either.
ar: وبتحديد المستويات التي سيتم تصديرها إلى صفحة الشجرة يقوم هذا الملف بعرض البنية المقرر تصديرها إلى صفحة الشجرة أيضا.وإذا ما تم استبعاد صفحات بعينها بواسطة خاصية الاستبعاد فلا يقوم الملف بعرضها.
fr: Basé sur les niveaux sélectionnés pour l'exportation de l'arborescence de pages, cela montrera la structure qui est sur le point d'être exportée. Si une page est spécifiquement exclue par l'option d'exclusion, elle ne sera pas montrée non plus.
it: In base ai livelli selezionati per l'esportazione dell'Albero delle Pagine, sarà visualizzata la struttura che sta per essere esportata. Se alcune pagine sono espressamente escluse dall'opzione di esclusione, non saranno mostrate.

# pageTreeMode.alttitle
source: Levels
ar: المستويات
fr: Niveaux
it: Livelli

# pageTreeMode.description
source: Here you select how deeply in the page tree from the current starting point to go for this export.
ar: من هنا يمكنك تحديد كيف سيكون عمق صفحة الشجرة وذلك من خلال نقطة البداية الحالية للتوجه إلى هذا التصدير.
fr: À cet endroit, vous sélectionnez le niveau de profondeur de l'arborescence que vous souhaitez exporter
it: Qui selezioni quanto profondamente, dal punto di partenza corrente nell'Albero delle Pagine, andrà questa esportazione.

# pageTreeMode.details
source: If you select "Expanded tree" it will base the export on the currently expanded levels of the page tree. Another special option is "Tables on this page" which will not include the page record itself but only include records from tables on the page, depending on the table configuration of course.
ar: وإذا ما إخترت خاصية"الشجرة الممتدة"فستتم عملية التصدير بناء على المستويات الممتدة الحالية لصفحة الشجرة.وهناك إختيار خاص أخر "الجداول المدرجة داخل الصفحة"والذي لا يدرج صفحة السجل نفسها و لكنه فقط يدرج سجلات الجداول الموجودة بالصفحة ،و هذا بالطبع يعتمد على ضبط الجداول نفسها.
fr: Si vous sélectionnez "Arborescence déployée", il basera l'exportation sur les niveaux actuellement déployées de l'arborescence des pages. Une autre option spéciale est "Tables sur cette page" qui n'inclura pas la page elle-même, mais n'inclura que les enregistrements des tables sur la page, en fonction de la configuration de la table bien sûr.
it: Se selezioni "Albero espanso", l'esportazione si baserà sui rami attualmente espansi dell'Albero delle Pagine. Un'altra opzione speciale è "Tabelle in questa pagina", che non includerà il record della pagina stessa, ma includerà solo i record dalle tabelle sulla pagina, a seconda della configurazione della tabella naturalmente.

# _pageTreeMode.image
source: EXT:impexp/Resources/Public/Images/cshimages/impexp_misc.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/impexp_misc.png

# pageTreeRecordLimit.alttitle
source: Include tables
ar: إدجرج جداول
fr: Inclure les tables
it: Includi tabelle

# pageTreeRecordLimit.description
source: When you export a page all records on the page is included by default. By this selector you can pick which tables to include exclusively if there are certain records you are not interested in seeing included.
ar: عند تصدير صفحة ما فإن عملية التصدير تشمل جميع السجلات بصورة إفتراضية.وبهذا المنتقي يمكن إلتقاط أي الجداول يمكن إدراجها على وجه الحصر إذا أردت ألا تدرج سجلات بعينها.
fr: Lorsque vous exportez une page, tous les enregistrements de la page sont inclus par défaut. Par ce sélecteur, vous pouvez choisir les tables à inclure uniquement s'il y a certains type d'enregistrements que vous ne souhaitez pas voir inclus.
it: Quando si esporta una pagina, tutti i record sulla pagina sono inclusi per impostazione predefinita. Con questo selettore puoi scegliere quali tabelle includere, esclusivamente se ci sono determinati record che non sei interessato a includere.

# pageTreeRecordLimit.details
source: In the box "Max number of records" you can set a limit to how many records are selected from a single table. This is a runaway brake in case you have an unusual large amount of records from a table.
ar: وفي صندوق"العدد الأقصى للسجلات"يمكنك ضبط حدا لعدد السجلات المختارة من الجدول المفرد.ويعمل ذلك كفاصل استبعاد في حالة ما إذا كان الجدول محتوي على عدد هائل غير معتاد من السجلات.
fr: Dans le bloc "Nombre maximum d'enregistrements", vous pouvez paramétrer le nombre maximum d'enregistrements à sélectionner dans la table. Il y a un blocage dans le cas où vous sélectionnez un nombre inhabituel d'enregistrements dans la table.
it: Nella casella "Numero massimo di records" è possibile impostare un limite a quanti record sono selezionati da una singola tabella. Questo è una sicurezza nel caso in cui si dispone di una grande quantità di record da una tabella.

# singleRecord.alttitle
source: Export single record
ar: تصدير سجل مفرد
fr: Exporter les enregistrements seuls
it: Esporta singolo record

# singleRecord.description
source: This overview tells you which independent records has been independently selected for export.
ar: يخبرك هذا العرض العام أي من السجلات المستقلة يمكن إختيارها للتصدير بصورة مستقلة.
fr: Cette vue d'ensemble vous indique quels enregistrements indépendants ont été sélectionnés indépendamment pour l'exportation.
it: Questa panoramica indica quali record indipendenti sono stati selezionati in modo indipendente per l'esportazione.

# singleRecord.image_descr
source: The way to export multiple records like this is using the clipboard like shown below.
ar: وتكون طريقة تصدير سجلات متعددة مثل هذه هي استخدام ذاكرة التخزين المؤقتة المعروضة بالأسفل.
fr: Le moyen d'exporter plusieurs enregistrements de ce type est d'utiliser le presse-papiers comme montré ci-dessous.
it: Il modo di esportare più record, come questo, è di usare la clipboard, come mostrato di seguito.

# tableList.alttitle
source: Table export
ar: تصدير الجدول.
fr: Exporter les tables
it: Esporta tabella

# tableList.description
source: Export of all records on a page from a specific table. This is configured from the Web>List module where you will have to select table-only view and click a button in the top of the page.
ar: تصدير جميع سجلات صفحة ما من خلال جدول خاص.ويتم ضبط هذه الخاصية من خلال نموذج وب<قائمة حيث يجب عليك إختيار عرض جدول واحد فقط و النقر على زر أعلى الصفحة.
fr: Exportation de tous les enregistrements de la page, pour une table spécifique. La configuration est faite dans le module Web>Liste, où vous devez sélectionner l'affichage d'une seule table, en cliquant sur le bouton "+" en dessus de la table.
it: Esportazione di tutti i record, su una pagina, da una tabella specifica. Questo è configurato dal modulo Web>Lista da cui dovrai selezionare la modalità singola-tabella e fare clic sul bottone "Esporta" in alto.

# tableList.details
source: Tip: You can select multiple table lists by simply saving each selecting as a preset and finally load/merge the selections together.
ar: نصيحة:يمكن إختيار القوائم المتعدة للجدول وذلك بتخزين كل إختيار لك على أنه ضبط مسبق و في النهاية يتم تحميل /دمج جميع الإختيارات معا.
fr: Astuce : Vous pouvez sélectionner plusieurs tables en enregistrant chaque sélection en tant que "pré-réglage" puis en chargeant l'ensemble des "pré-réglages" ensemble.
it: Suggerimento: è possibile selezionare più elenchi di tabelle singole, semplicemente salvando ogni selezione come preset e poi caricare e unire le selezioni insieme.

# tableList.image_descr
source: Here two tables from different pages are selected. This is done by first selecting the one, saving it as a preset, then select the other and merge with the saved preset. Here you see how to use the Web>List module to export all records from a table on a page.
ar: هنا يتم إختيار جداول من صفحات مختلفة.ويتم ذلك أولا بإختيار الجدول ،المخزن سابقا على أنه صبط مسبق،ثم قم بإختيار جدول آخر وإدمجه مع الجدول السابق تخزينه.وهنا يمكنك التعرف كيف يقوم نموذج وب<قائمة بتصدير جميع السجلات من جدول الصفحة.
fr: Ici vous pouvez voir deux tables de deux pages différentes. Cela est possible en sélectionnant la première, en l'enregistrant en tant que "pré-réglage", puis en sélectionnant la seconde et en fusionnant avec le précédent pré-réglage. Voila un exemple de comment utiliser le module Web > Liste pour exporter tous les enregistrements d'une table sur une page
it: Qui sono selezionate due tabelle da pagine diverse. Questo viene fatto selezionando prima una e salvandola come preset, poi selezionando l'altra e unendola al preset appena salvato. Qui vedi come utilizzare il modulo Web>Lista per esportare tutti i record da una tabella su una pagina.

# inclRelations.alttitle
source: Include relations
ar: إدراج الربط بين السجلات.
fr: Inclure les relations
it: Includi relazioni

# inclRelations.description
source: Configure the tables from which you want to include records that are found as relations in the main export configuration.
ar: يقوم هذا الملف بضبط الجداول اللآزمة لك لإدراج السجلات المنشأة في ضبط التصدير الأساسي كسجلات ربط.
fr: Configurez les tables à partir desquelles vous souhaitez inclure des enregistrements qui ont été trouvés dans les relations de la configuration principale du module d'export.
it: Configura le tabelle da cui desideri includere i record correlati nella configurazione principale di esportazione.
