Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/impexp/Resources/Private/Language/*.locallang_csh.xlf
Languages: ar, fr, it

# update.details
source: There are certain requirements you have to meet if you want the "Update" process to work. The main thing is that the records updated are those with the SAME uid as the uid in the export file. Thus an update operation only makes real sense if the export and import systems are somehow related and the same UIDs can be expected in both ends. Otherwise it will be a mess! When you update page structures the import operation will automatically try to rearrange records so they also appear in the same hierarchy and order as in the export file. This can be disabled by checking the option "Ignore PID differences globally". In any case you can set individual records to Ignore/Respect the PID with a selectorbox in the preview. In the preview display you can also select if individual records should be flatly ignored during import or if you want them created as new records instead of being updates. As a help for managing updates the preview display will inform you about the path where the existing element with that UID is found. Use this to verify that you get what you expect! <b>Forcing the UID:</b> If you intend to update a system and some elements from the import are not mappable to a UID already (ei. does not exist) you can choose in the preview display to force the UID during creation. This is an unorthodox thing to do since UIDs are normally created automatically by the database. The option makes most sense if you are trying to "synchronize" a copy of another system. The option may mess up certain database internals and the feature is therefore only available for admins.
ar: هناك بعض المتطلبات التي عليك استيفاؤها إذا كنت تريد أن تعمل عملية "التحديث". والشيء الرئيس هو أن السجلات التي تم تحديثها هي السجلات التي يكون فيها معرف SAME هو المستعمل في مِلَفّ التصدير. ومن ثم فإن عملية التحديث لا معنى لها إلا إذا كانت نظم التصدير والاستيراد مرتبطة بشكل ما وكان من الممكن توقع نفس أجهزة التحديث المستعملة في كلا الحالتين. وإلا فسيكون الأمر فوضى! عند تحديث هياكل الصفحات، ستحاول عملية الاستيراد تلقائياً إعادة ترتيب السجلات بحيث تظهر أيضاً في نفس التسلسل الهرمي والترتيب كما في مِلَفّ التصدير. يمكن تعطيل هذا عن طريق التحقق من الخِيار "تجاهل اختلافات PID عموماً". في أي حال يمكنك تعيين السجلات الفردية إلى تجاهل / الأخذ بالاعتبار PID مع خانة الانتقاء في المعاينة. في عرض المعاينة يمكنك أيضاً تحديد ما إذا كان يجب تجاهل السجلات الفردية بشكل واضح في أثناء الاستيراد أو إذا كنت تريد إنشاءها كسجلات جديدة بدلاً من أن تكون تحديثات. كمساعدة في إدارة التحديثات، سوف يخبرك عرض المعاينة عن المسار الذي يوجد فيه العنصر الموجود مع ذلك UID. استخدم هذا للتحقق من أنك تحصل على ما تتوقع! <b>إجبار UID:</b> إذا كنت ترغب في تحديث نظام وبعض العناصر من الاستيراد غير قابلة لربط UID مسبقاً (إذا كان غير موجود) يمكنك الاختيار في عرض المعاينة لإجبار UID في أثناء الإنشاء. هذا شيء غير تقليدي يجب القيام به لأن UIDs عادة ما يتم إنشاؤها تلقائياً بواسطة قاعدة البيانات. الخِيار الأكثر منطقية إذا كنت تحاول "المزامنة" نسخة من نظام آخر. وقد يؤدي هذا الخِيار إلى إفساد بعض الداخليين في قاعدة البيانات وبالتالي فإن هذه المِيزة متاحة للمشرفين فقط.
fr: Il y a certaines exigences que vous devez remplir si vous voulez que le processus de mise à jour fonctionne. L'essentiel est que les enregistrements mis à jour sont ceux avec le MÊME uid que l'uid dans le fichier d'exportation. Ainsi, une opération de mise à jour n'a de sens que si les systèmes d'exportation et d'importation sont en quelque sorte liés et que les mêmes UID peuvent être attendus dans les deux côtés. Sinon, ce sera un désordre ! Lorsque vous mettez à jour la structure de la page, l'opération d'importation tentera automatiquement de réorganiser les enregistrements afin qu'ils apparaissent également dans la même hiérarchie et l'ordre que dans le fichier d'exportation. Ceci peut être désactivé en cochant l'option "Ignorer les différences PID globalement". Dans tous les cas, vous pouvez définir des enregistrements individuels à Ignorer / Respecter le PID avec une boîte de sélection dans l'aperçu. Dans l'aperçu de l'affichage, vous pouvez également sélectionner si les enregistrements individuels doivent être totalement ignorés lors de l'importation ou si vous voulez qu'ils soient créés comme de nouveaux enregistrements au lieu d'être des mises à jour. En tant qu'aide pour la gestion des mises à jour, l'affichage de l'aperçu vous informera du chemin où l'élément existant avec cet UID est trouvé. Utilisez ceci pour vérifier que vous obtenez ce que vous attendez! <b>Forcer l'UID :</b> Si vous avez l'intention de mettre à jour un système et que certains éléments de l'importation ne sont pas associables à un UID déjà (ei. n'existe pas) vous pouvez choisir dans la prévisualisation pour forcer l'UID lors de la création. C'est une chose non orthodoxe à faire puisque les UIDs sont normalement créés automatiquement par la base de données. Cette option est tout à fait logique si vous essayez de « synchroniser » une copie d'un autre système. L'option peut gâcher certaines bases de données internes et la fonctionnalité n'est donc disponible que pour les administrateurs.
it: Ci sono alcuni requisiti che devono essere soddisfatti, se vuoi che il processo di aggiornamento funzioni correttamente. La cosa principale è che i record aggiornati sono quelli con lo STESSO l'UID di quello presente nel file da importare. Pertanto, un'operazione di aggiornamento ha senso solo se i sistemi di esportazione e importazione sono in qualche modo "paralleli" e gli stessi UID possono essere previsti in entrambi. Altrimenti il risultato no sarà quello atteso. Quando si aggiornano le strutture di pagina, l'operazione di importazione cercherà automaticamente di riorganizzare i record in modo che appaiano anche nella stessa gerarchia e ordine del file da importare. Questo può essere disabilitato selezionando l'opzione "Ignora globalmente le differenze di PID". In ogni caso è possibile impostare singoli record per ignorare/rispettare il PID con una checkbox nell'anteprima. Nell'anteprima è possibile stabilire se i singoli record devono essere completamente ignorati, durante l'importazione, o se si desidera che siano creati come nuovi record, invece di essere aggiornamenti. Come aiuto per la gestione degli aggiornamenti, la visualizzazione dell'anteprima ti informerà sul percorso in cui si trova l'elemento esistente con l'UID. Usa questo per verificare che stai ottenendo quello che desideri! <b>Forzare l'UID:</b> Se hai intenzione di aggiornare un sistema e alcuni elementi dall'importazione non sono mappabili a un UID (non esistente), è possibile scegliere, nell'anteprima, se forzare l'UID durante la creazione. Questa è una cosa non ortodossa da fare, poiché gli UID sono normalmente creati automaticamente dal database. L'opzione ha più senso se si sta cercando di "sincronizzare" una copia di un sistema. L'opzione può creare alcuni problemi del database; ecco perché la funzione è disponibile solo per gli amministratori.

# update.image_descr
source: In Update mode you can select various settings for each record. You will also be able to see a diff-view where the differences between the existing record and the one from the import is shown.
ar: وعند و ضع التحديث يمكنك إختيار تضبيطات متنوعة لكل سجل.ويمكنك أيضا رؤية عرض مختلف حيث يوجد إختلافات بين سجل الخروج والسجل المعرض أثناء التصدير.
fr: En mode Mise à jour, vous pouvez sélectionner différents paramètres pour chaque enregistrement. Vous serez également en mesure de voir un diff-view où les différences entre l'enregistrement existant et celui de l'importation sont affichées.
it: In modalità Aggiornamento, è possibile selezionare varie impostazioni per ogni record. Potrai anche vedere una panoramica delle differenze, dove vengono mostrate le differenze tra il record esistente e quello da importare.

# options.alttitle
source: Import options
ar: خصائص عملية التصدير
fr: Options d'importation
it: Opzioni di importazione

# options.description
source: Various options for import.
ar: خصائص عديدة لعملية التصدير
fr: Diverses options pour l'importation.
it: Varie opzioni per l'importazione.

# options.details
source: <b>Do not show differences in records</b> When a structure has been imported you will see a difference view of all records which tells you whether the written content matched the import data or if not, what changed. In many cases content <i>should</i> change (eg. relations and file references) so it is not an error if you see red and green values. Basically the difference view is a feature you can use for visual validation of the import success. It brings piece-of-mind to those who is enlightened to understand what it tells... :-) Green strings represent the actual written data while red represents the original value from the import file and black represents data that is the same.
ar: <b>لا تُظهر التغييرات في السجلات</b> عند استيراد هيكلية ما، سترى عرضاً مختلفاً لجميع السجلات يخبرك ما إذا كان المحتوى المكتوب يتطابق مع بيانات الاستيراد أم لا، وما الذي تغيّر. في كثير من الحالات يجب على <i>أن يتغيّر</i> المحتوى (على سبيل المثال: العلاقات ومراجع الملفات). هذا يعني عدم وجود أي خطأ في حال ظهرت قِيَم حمراء أو خضراء. في الواقع، يُعد عرض مقارنة السجلات مِيزة يمكنك استخدامها للتحقق البصري من نجاح الاستيراد. إنه يحفّز أولئك المُنتبهون "المُصحّحِون" لِفهم كُل ما يَتم عَمله... :-) تمثل السلاسل الخضراء البيانات المكتوبة فعلًا بينما يمثل اللون الأحمر القيمة الأصلية من مِلَفّ الاستيراد ويمثل الأسود البيانات نفسها.
fr: <b>Ne pas afficher les différences dans les enregistrements</b> Lorsqu'une structure a été importée, vous verrez une vue de différence de tous les enregistrements qui vous indique si le contenu écrit correspond aux données d'importation ou si ce n'est pas le cas, ce qui a changé. Dans de nombreux cas, le contenu <i>devrait</i> changer (par ex. relations et références de fichiers) donc ce n'est pas une erreur si vous voyez des valeurs rouges et vertes. Fondamentalement, la vue de la différence est une fonctionnalité que vous pouvez utiliser pour la validation visuelle du succès de l'importation. Il apporte une paix d'esprit à ceux qui sont éclairés pour comprendre ce qu'il dit. . :-) Les chaînes vertes représentent les données écrites réelles, tandis que le rouge représente la valeur originale du fichier d'importation et le noir représente les données qui sont les mêmes.
it: <b>Non mostrare le differenze nei record</b> Quando una struttura è stata importata, vedrai una lista delle differenze di tutti i record che ti dice se il contenuto scritto corrisponde ai dati di importazione o, in caso contrario, ciò che è cambiato. In molti casi il contenuto <i>dovrebbe</i> cambiare (es. relazioni e riferimenti a file) quindi non è un errore se vedi i valori rossi e verdi. Fondamentalmente la lista delle differenze è una caratteristica che è possibile utilizzare per la convalida visiva del buon esito dell'importazione. Tranquilli coloro che si sforzano di capirne il significato... :-) I valori in verde provengono dal file importato, quelli rossi sono nell'attuale database e quelli neri sono quelli identici in entrambe le versioni.

# action.alttitle
source: Import Action
ar: عملية التصدير.
fr: Importer une action
it: Azione

# action.description
source: Press "Preview" to see the content of the import file or update the preview display according to changed configurations. Press "Import"/"Update" if you want to perform the actual import. Before importing make sure you change any editable soft references that are shown in the preview data.
ar: إضغط على "عرض أولي"لترى متحويات ملف التصدير أو لتحديث عملية العرض الأولي.إضغط "تصدير/تحديث"لأداء عملية التصدير الفعلية. قبل أداء عملية التصدير تأكد من أنك قمت بتغير أي مراجع مرنة يمكن تحريرها والمعروضة في العرض الأولي للبيانات.
fr: Appuyez sur "Aperçu" pour voir le contenu du fichier d'importation ou mettre à jour l'affichage de l'aperçu en fonction des configurations modifiées. Appuyez sur "Importer"/"Mise à jour" si vous voulez effectuer l'importation. Avant d'importer, assurez-vous de modifier toutes les références soft modifiables qui sont affichées dans les données d'aperçu.
it: Premi "Anteprima" per visualizzare il contenuto del file di importazione o aggiornare la visualizzazione di anteprima in base alle configurazioni modificate. Premi "Importa"/"Aggiorna" se vuoi eseguire l'importazione. Prima di importare assicurati di modificare i riferimenti modificabili mostrati nei dati di anteprima.

# _action.image
source: EXT:impexp/Resources/Public/Images/cshimages/diffview.png
fr: EXT:impexp/Ressources/Public/Images/cshimages/diffview.png

# action.image_descr
source: Example of the result view after importing. As you can see the RTE attached images (soft references) has been written to new file names and the difference view tells you that the names changed in the bodytext content.
ar: مثال لعرض النتيجة بعد عملية التصدير.كما يمكن ان ترى أنه تم كتابة ملفات
fr: Exemple de résultat après l'importation. Comme vous pouvez le voir, les images RTE (references softs) ont été écrites avec de nouveaux noms de fichiers et la vue de différence vous indique que les noms ont changé dans le corps du texte.
it: Esempio di visualizzazione dei risultati dopo l'importazione. Come puoi vedere le immagini RTE allegate (riferimenti) sono state scritte su nuovi nomi file e la lista delle differenze ti dice quali sono i nomi cambiati nel contenuto del testo.

# enableLogging.alttitle
source: Enable System Logging
ar: إتاحة الدخول إلى النظام.
fr: Activer le journal système
it: Abilita il Log di Sistema

# enableLogging.description
source: If you set this the system backend log will be filled with entries for all the actions that the import actually performs. By default this is left out for the sake of clarity.
ar: عند إتاحة هذه الخاصية فإن سجل النظام الخاص بالواجهة الخلفية سيمتلئ بالمداخل اللآزمة لجميع العمليات التي تقوم بالفعل عملية التصدير بأداءها.وبصورة إفتراضية فإنه يتك إستثناء هذه الخاصية من الوضوح.
fr: Si vous activez ce paramètre, le journal système sera alimenté avec des entrées pour toutes les actions que l'import effectue. Par défaut, cette option est désactivée dans un souci de légèreté.
it: Se l'hai impostato, il Log di Sistema verrà valorizzato con le voci per tutte le azioni che l'importazione esegue effettivamente. Per impostazione predefinita, questo è escluso per motivi di chiarezza.

# upload.alttitle
source: Upload import file
ar: تحديث ملف التصدير.
fr: Envoyer un fichier d'importation
it: Carica il file di importazione

# upload.description
source: Select a file to import from your local computer and upload it here. If the upload completes successfully you can immediately see its content displayed in the preview display.
ar: حدد مِلَفّ لاستيراده من جهاز الحاسوب المحلي الخاص بك وتحميله هنا. إذا اكتمل التحميل بنجاح، يمكنك على الفور مشاهدة محتواه المعروض في العرض المسبق.
fr: Sélectionnez un fichier à importer depuis votre ordinateur et téléchargez-le ici. Si le téléchargement se termine avec succès, vous pouvez immédiatement voir son contenu affiché dans l'aperçu.
it: Seleziona un file da importare dal computer locale e caricalo qui. Se il caricamento è completato con successo è possibile vedere immediatamente il suo contenuto visualizzato nell'anteprima.

# upload.details
source: Notice that there are usually limits set by the server (PHP) to the size of uploaded files. If hit, upload fails and an error message is shown.
ar: لاحظ أن هناك عادة حدود يحددها الخادم (PHP) لحجم الملفات التي تم تحميلها. في حالة الضغط، فشل التحميل ويتم عرض رسالة خطأ.
fr: Notez qu'il y a généralement des limites définies par le serveur (PHP) pour la taille des fichiers téléchargés. Si la limite est atteinte, le téléchargement échoue et un message d'erreur s'affiche.
it: Nota che di solito ci sono limiti impostati dal server (PHP) alla dimensione dei file caricati. Se il caricamento fallisce, verrà mostrato un messaggio di errore.

# _import.seeAlso
source: xMOD_tx_impexp:export
ar: xMOD_tx_impexp:تصدير
