Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/linkvalidator/Resources/Private/Language/*.locallang.xlf
Languages: ar, de, it

# mod_linkvalidator
source: LinkValidator
ar: مُدقق الروابط
it: Validatore Collegamenti

# tasks.validate.name
source: LinkValidator
ar: مُدقق الروابط
it: Validatore Collegamenti

# tasks.validate.description
source: Search for broken links and store the result into the temporary table tx_linkvalidator_link in order to ease up the backend module.
ar: البحث عن الروابط الناقصة وتخزين النتيجة في الجدول المؤقت tx_linkvalidator_link من أجل تخفيف وحدة نهاية الواجهة الخلفية.
de: Sucht nach defekten Links und speichert das Ergebnis in der Datenbanktabelle tx_linkvalidator_link, um die Benutzung des Backendmoduls zu vereinfachen.
it: Cerca i collegamenti interrotti e salva il risultato nella tabella temporanea tx_linkvalidator_link al fine di alleggerire il modulo di backend.

# tasks.validate.page
source: Start page (uid)
ar: صفحة البداية (uid)
de: Startseite (uid)
it: Pagina di partenza (uid)

# tasks.validate.depth
source: Depth
ar: العمق
de: Tiefe
it: Profondità

# tasks.validate.languages
source: Languages to search for broken links (Leave empty for all languages).
ar: لُغات للبحث عن روابط ناقصة (اتركها فارغة لجميع اللغات).
de: Sprachen für die Suche nach defekten Links (Für alle Sprachen leer lassen).
it: Lingue da cercare per i collegamenti interrotti (lascia vuoto per tutte le lingue).

# tasks.validate.conf
source: Overwrite TSconfig
ar: الكتابة فوق TSconfig
de: TSconfig überschreiben
it: Sovrascrivi TSconfig

# tasks.validate.email
source: Send email report to
ar: إرسال تقرير بالبريد الإلكتروني إلى
de: E-Mail-Bericht senden an
it: Invia rapporto email a

# tasks.validate.emailOnBrokenLinkOnly
source: Send email on new broken links only
ar: إرسال بريد إلكتروني على الروابط الناقصة الجديدة فقط
de: E-Mail nur senden, wenn neue defekte Links gefunden wurden
it: Invia email solo per nuovi collegamenti interrotti

# tasks.validate.emailTemplateName
source: Email template name (without the extension)
ar: اسم قالب البريد الإلكتروني (دون الإضافة)
de: Name der E-Mail-Vorlage (ohne Dateierweiterung)
it: Nome modello email (senza estensione)

# tasks.validate.invalidEmail
source: Invalid email format!
ar: تنسيق بريد إلكتروني غير صالح!
de: Ungültiges Format der E-Mail-Adresse!
it: Formato email non valido!

# tasks.validate.invalidPage
source: Invalid page uid, please enter a valid page uid!
ar: Uid صفحة غير صالحة، الرجاء إدخال uid صفحة صالحة!
de: Ungültige Seiten-ID! Bitte geben Sie eine gültige ID ein.
it: UID di pagina non valido, inserisci un UID di pagina valido!

# tasks.validate.invalidDepth
source: There is no depth set, please set it to one of the offered values!
ar: لا يوجد عُمق مُحدد، يرجى ضبطها حسب إحدى القيم المعروضة!
de: Sie haben keine Tiefe angegeben! Bitte setzen Sie einen der angebotenen Werte.
it: La profondità non è definita, seleziona uno dei valori proposti!

# tasks.notice.useDefaultTemplate
source: The templateName was automatically set to the default because either the field in the task configuration is empty or no file is found for the given name. Please note that both a .html and .txt file must exist under the configured templatePath.
ar: تم تعيين اسم القالب تلقائياً إلى الافتراضي لأنه إما الحقل في المهمة تكوين فارغ أو أنه لم يتم العثور على ملف للاسم المحدد. يرجى ملاحظة أن كلا الـ .html و .txt ملف يجب أن يكونا موجودين داخل تكوين القالب.
de: Der templateName wurde automatisch auf die Standardeinstellung gesetzt, da entweder das Feld in der Aufgabe Konfiguration leer ist oder keine Datei für den angegebenen Namen gefunden wurde. Bitte beachten Sie, dass sowohl eine .html als auch .txt Datei unter dem konfigurierten templatePath existieren müssen.
it: Il nome modello (templateName) è stato impostato automaticamente a quello predefinito perché il campo nella configurazione attività è vuoto o nessun file è stato trovato per il nome dato. Si prega di notare che sia un file .html che .txt devono esistere nel percorso del modello (templatePath).

# tasks.error.emptyToEmail
source: There must be at least one recipient defined!
ar: الرجاء تحديد مُستلم واحد على الأقل!
de: Es muss mindestens ein Empfänger definiert sein!
it: Deve essere definito almeno un destinatario!

# tasks.error.invalidToEmail
source: Invalid format of one or more of the recipient email addresses!
ar: تنسيق غير صالح لواحد أو أكثر من عناوين البريد الإلكتروني للمستلم!
de: Ungültiges Format einer oder mehrerer Adressen der Empfänger der E-Mail!
it: Formato non valido per uno o più degli indirizzi email dei destinatari!

# tasks.error.invalidFromEmail
source: Invalid format of the email address in the from header
ar: تنسيق غير صالح لعنوان البريد الإلكتروني في الترويسة
de: Ungültiges Format der E-Mail-Adresse im From-Header
it: Formato non valido per l'indirizzo email nell'intestazione From

# tasks.error.invalidPageUid
source: The given page id %d is invalid!
ar: معرف الصفحة المعينة id %d غير صالح!
de: Die angegebene Seiten-ID %d ist ungültig!
it: L'id della pagina %d non è valido!

# tasks.email.title
source: TYPO3 LinkValidator report
ar: تقرير TYPO3 LinkValidator
de: Bericht des TYPO3 LinkValidator
it: Rapporto Validatore Collegamenti di TYPO3

# tasks.email.overview
source: Overview of broken links
ar: نَظْرَة عامة على الروابط الناقصة
de: Übersicht der defekten Links
it: Panoramica dei collegamenti interrotti

# tasks.email.overview.all
source: Total broken links: %s (last report: %s)
ar: مجموع الروابط الناقصة: %s (التقرير الأخير: %s)
de: Defekte Links insgesamt: %s (letzter Bericht: %s)
it: Link interrotti totali: %s (ultimo rapporto: %s)

# tasks.email.overview.internal
source: Internal links: %s (last report: %s)
ar: الروابط الداخلية: %s (التقرير الأخير: %s)
de: Interne Links: %s (letzter Bericht: %s)
it: Collegamenti interni: %s (ultimo rapporto: %s)

# tasks.email.overview.external
source: External links: %s (last report: %s)
ar: الروابط الخارجية: %s (التقرير الأخير: %s)
de: Externe Links: %s (letzter Bericht: %s)
it: Collegamenti esterni: %s (ultimo rapporto: %s)

# tasks.email.overview.file
source: File / Media links: %s (last report: %s)
ar: روابط الملف / الوسائط: %s (التقرير الأخير: %s)
de: Datei / Medien Links: %s (letzter Bericht: %s)
it: Collegamenti file / multimediali: %s (ultimo rapporto: %s)

# tasks.email.lisiting
source: Listing of broken links
ar: قائمة بالروابط الناقصة
de: Auflistung der defekten Links
it: Elenco dei collegamenti interrotti

# tasks.email.lisiting
source: If record type is "Page", the page id is the parent page.
ar: إذا كان نوع السجل هو "الصفحة"، id الصفحة هو الصفحة الأصلية.
de: Wenn der Datensatztyp "Seite" ist, ist die Seiten-Id die übergeordnete Seite.
it: Se il tipo di record è "Pagina", l'id della pagina è la pagina padre.

# tasks.email.lisiting
source: Hover over an element to see more information e.g. the record title.
ar: قم بالتمرير فوق العنصر لمشاهدة المزيد من المعلومات، على سبيل المثال عنوان السجل.
de: Fahren Sie mit der Maus über ein Element, um weitere Informationen, z.B. den Titel des Datensatzes, anzuzeigen.
it: Passa sopra un elemento per vedere maggiori informazioni, es. il titolo del record.

# tasks.email.explanation
source: Explanation: Record | Language | Page | Record type | Target | Link type
ar: توضيح: السجل | اللغة | الصفحة | نوع السجل | الهدف | نوع الرابط
de: Erklärung: Datensatz | Sprache | Seite | Datensatztyp | Ziel | Linktyp
it: Spiegazione: Record | Lingua | Pagina | Tipo di record | Destinazione | Tipo di collegamento

# tasks.email.brokenLinks.record
source: Record
ar: السجل
de: Datensatz

# tasks.email.brokenLinks.language
source: Language
ar: اللغة
de: Sprache
it: Lingua

# tasks.email.brokenLinks.page
source: Page
ar: الصفحة
de: Seite
it: Pagina

# tasks.email.brokenLinks.recordType
source: Record type
ar: نوع السجل
de: Datensatztyp
it: Tipo di record

# tasks.email.brokenLinks.target
source: Target
ar: الهدف
de: Ziel
it: Destinazione

# tasks.email.brokenLinks.type
source: Type
ar: النوع
de: Typ
it: Tipo

# tasks.email.brokenLinks.db
source: Internal
ar: داخلي
de: Intern
it: Interno

# tasks.email.brokenLinks.external
source: External
ar: خارجي
de: Extern
it: Esteno

# tasks.email.brokenLinks.file
source: File / Media
ar: ملف / وسائط
de: Datei / Medien
it: File / Multimedia
