Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/felogin/Resources/Private/Language/*.Database.xlf
Languages: ar, it

# tt_content.CType_pi1
source: Website User Login
ar: تسجيل دخول مُستخدم الموقع
it: Login utente

# tt_content.CType.felogin_login.title
source: Login Form
ar: نموذج تسجيل الدخول
it: Form di Login

# tt_content.CType.felogin_login.description
source: Login/logout form used to password protect pages allowing only authorised website users and groups access.
ar: نموذج تسجيل الدخول/الخروج المُستخدم، يُستخدم لحماية الصفحات بكلمة مرور، للسماح فقط لمستخدمي موقع الويب والمجموعات بالوصول لهذه الصفحات.
it: Form di login/logout usato per proteggere le pagine con password, consentendo l'accesso solo ad utenti e gruppi, del sito web, autorizzati.

# felogin_redirectPid
source: Redirect at Login to Page (felogin)
ar: سيتم إعادة التوجيه بعد تسجيل الدخول إلى الصفحة (felogin)
it: Al Login Reindirizza alla Pagina (felogin)

# felogin_forgotHash
source: Forgot hash
ar: نسيت تجزئة كلمة المرور
it: Hash dimenticato

# tt_content.pi_flexform.general_header
source: General Header
ar: ترويسة عامة
it: Intestazione Generale

# tt_content.pi_flexform.general_message
source: General Message
ar: رسائل عامة
it: Messaggio Generale

# tt_content.pi_flexform.redirect_header
source: Redirect Header
ar: إعادة توجيه الترويسة
it: Intestazione di Reindirizzamento

# tt_content.pi_flexform.redirect_message
source: Redirect Message
ar: إعادة توجيه الرسالة
it: Messaggio di Reindirizzamento

# tt_content.pi_flexform.welcome_header
source: Welcome Header
ar: ترويسة الترحيب
it: Intestazione di Benvenuto

# tt_content.pi_flexform.welcome_message
source: Welcome Message
ar: رسالة الترحيب
it: Messaggio di Benvenuto

# tt_content.pi_flexform.success_header
source: Login Success Header
ar: ترويسة نجاح تسجيل الدخول
it: Intestazione Login Riuscito

# tt_content.pi_flexform.success_message
source: Login Success Message
ar: رسالة نجاح تسجيل الدخول
it: Messaggio Login Riuscito

# tt_content.pi_flexform.error_header
source: Login Error Header
ar: ترويسة خطأ بتسجيل الدخول
it: Intestazione Errore Login

# tt_content.pi_flexform.error_message
source: Login Error Message
ar: رسالة خطأ تسجيل الدخول
it: Messaggio Errore Login

# tt_content.pi_flexform.status_header
source: Status Display Header
ar: ترويسة عرض الحالة
it: Intestazione Visualizzazione Stato

# tt_content.pi_flexform.status_message
source: Status Display Message
ar: رسالة عرض الحالة
it: Messaggio Visualizzazione Stato

# tt_content.pi_flexform.logout_header
source: Logout Header
ar: ترويسة تسجيل الخروج
it: Intestazione Logout

# tt_content.pi_flexform.logout_message
source: Logout Message
ar: رسالة تسجيل الخروج
it: Messaggio di Logout

# tt_content.pi_flexform.forgot_header
source: Forgot Password Header
ar: نسيت ترويسة كلمة المرور
it: Intestazione Password Dimenticata

# tt_content.pi_flexform.forgot_message
source: Forgot Password Message
ar: نسيت ترويسة كلمة المرور
it: Messaggio Password Dimenticata

# tt_content.pi_flexform.sheet_general
source: General
ar: عامّ
it: Generale

# tt_content.pi_flexform.sheet_redirect
source: Redirects
ar: إعادة توجيه
it: Reindirizzamenti

# tt_content.pi_flexform.sheet_messages
source: Messages
ar: الرسائل
it: Messaggi

# tt_content.pi_flexform.show_forgot_password
source: Display Password Recovery Link
ar: عرض رابط استعادة كلمة المرور
it: Mostra Opzione Recupero Password

# tt_content.pi_flexform.show_permalogin
source: Display Remember Login Option
ar: عرض خيار تذكر معلومات تسجيل الدخول
it: Mostra Opzione "Ricorda Login"

# tt_content.pi_flexform.show_logoutFormAfterLogin
source: Disable redirect after successful login, but display logout-form
ar: تعطيل إعادة التوجيه بعد نجاح تسجيل الدخول، ولكن عرض نموذج تسجيل الخروج
it: Mostra Form di Logout Dopo il Login

# tt_content.pi_flexform.groupSelectmode
source: FE group select mode:
ar: وضع اختيار مجموعة FE:
it: Modalit√† selezione gruppo FE:

# tt_content.pi_flexform.groupSelectmode_showAll
source: Show all
ar: مشاهدة الكل
it: Mostra tutto

# tt_content.pi_flexform.groupSelectmode_showSelected
source: Show selected
ar: عرض العناصر المُحددة
it: Mostra selezionato

# tt_content.pi_flexform.groupSelectmode_DontShowSelected
source: Don't show selected
ar: عدم عرض العناصر المُحددة
it: Non mostrare elementi selezionati

# tt_content.pi_flexform.groupSelectmode_FromTS
source: (from Typoscript)
ar: (من Typoscript)
it: (da TypoScript)

# tt_content.pi_flexform.groupSelection
source: FE group selection:
ar: تحديد مجموعة FE:
it: Seleziona gruppo FE:

# tt_content.pi_flexform.groupSelection_noGroup
source: no group
ar: لا توجد مجموعة
it: nessun gruppo

# tt_content.pi_flexform.field_manualOrder
source: Using fieldlists below:
ar: استخدام قوائم الحقول أدناه:
it: Usa i campi sottostanti:

# tt_content.pi_flexform.field_orderList
source: User Fields/list:
ar: حقول/قائمة المستخدم:
it: Campi Utente/lista:

# tt_content.pi_flexform.field_orderDetails
source: User Fields/details:
ar: حقول/تفاصيل المستخدم:
it: Campi Utente/dettagli:

# tt_content.pi_flexform.redirectMode
source: Redirect Mode
ar: وضع إعادة توجيه
it: Reindirizzamento (devi selezionare le opzioni, altrimenti il reindirizzamento non funzioner√†)

# tt_content.pi_flexform.redirectMode.I.0
source: Defined by Usergroup Record
ar: تم تعريفه بواسطة سجل مجموعة المستخدم
it: Definito dal Record del Gruppo Utenti

# tt_content.pi_flexform.redirectMode.I.1
source: Defined by User Record
ar: تم تعريفها بواسطة سجل المستخدم
it: Definito dal Record Utente

# tt_content.pi_flexform.redirectMode.I.2
source: After Login (TS or Flexform)
ar: بعد تسجيل الدخول (TS أو Flexform)
it: Dopo il Login (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.3
source: After Logout (TS or Flexform)
ar: بعد تسجيل الخروج (TS أو Flexform)
it: Dopo il Logout (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.4
source: After Login Error (TS or Flexform)
ar: بعد فشل تسجيل الدخول (TS أو Flexform)
it: Dopo Errore di Login (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.5
source: Defined by GET/POST Parameters
ar: تم تعريفها بواسطة مُعامِلات GET/POST
it: Definito da Parametri GET/POST

# tt_content.pi_flexform.redirectMode.I.6
source: Defined by Referrer
ar: تم تعريفها من قِبل الإحالة
it: Definito dal Referrer

# tt_content.pi_flexform.redirectMode.I.7
source: Defined by Domain Entries
ar: تم تعريفها حسب مُدخلات النِطاق
it: Definito dal Record "Dominio"

# tt_content.pi_flexform.redirectFirstMethod
source: Use First Supported Mode from Selection
ar: استخدام أول وضع مَدعُوم من التحديد
it: Usa la Prima Modalit√† dalla Selezione

# tt_content.pi_flexform.redirectDisable
source: Disable Redirect
ar: تعطيل إعادة التوجيه
it: Disabilita Reindirizzamento

# tt_content.pi_flexform.redirectPageLogin
source: After Successful Login Redirect to Page
ar: بعد تسجيل الدخول بنجاح، قم بإعادة التوجيه إلى الصفحة
it: Effettuato il Login Reindirizza alla Pagina

# tt_content.pi_flexform.redirectPageLoginError
source: After Failed Login Redirect to Page
ar: عند فشل تسجيل الدخول، قم بإعادة التوجيه إلى الصفحة
it: Dopo un Errore di Login Reindirizza alla Pagina

# tt_content.pi_flexform.redirectPageLogout
source: After Logout Redirect to Page
ar: بعد تسجيل الخروج، قم بإعادة التوجيه إلى الصفحة
it: Dopo il Logout Reindirizza alla Pagina

# tt_content.pi_flexform.template_file
source: Template File
ar: ملف القالب
it: File Template

# tt_content.pi_flexform.user_storage
source: User Storage Page
ar: مستخدم صفحة التخزين
it: Cartella Utenti
