Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/felogin/Resources/Private/Language/*.locallang.xlf
Languages: ar, it

# login_user_info
source: You are now logged in as '%s'
ar: تم تسجيل دخولك كـ %s
it: Ora sei loggato come '%s'

# welcome_header
source: User login
ar: تسجيل دخول المستخدم
it: Login utente

# welcome_message
source: Enter your username and password here in order to log in on the website
ar: أدخل اسم المستخدم وكلمة المرور هنا ليتم تسجيل دخولك على الموقع
it: Inserisci qui il tuo nome utente e la password per accedere al sito web

# logout_header
source: You have logged out.
ar: لقد قمت بتسجيل الخروج.
it: Hai effettuato il logout.

# logout_message
source: You just logged out from your user session on this website. You can login again or as another user by the form below.
ar: قمت للتو بتسجيل الخروج من جلسة المُستخدم الخاصة بك على هذا الموقع. يمكنك تسجيل الدخول مرة أخرى أو كمُستخدم آخر عن طريق النموذج أدناه.
it: La tua sessione su questo sito è terminata. Puoi effettuare un nuovo login utilizzando la form sottostante.

# error_header
source: Login failure
ar: فشل تسجيل الدخول
it: Errore di login

# error_message
source: An error occurred during login. Most likely you didn't enter the username or password correctly. Be certain that you enter them precisely as they are, including upper/lower case. Another possibility is that cookies might be disabled in your web browser.
ar: حدث خطأ أثناء تسجيل الدخول. على الأرجح، لم تقم بإدخال اسم المستخدم أو كلمة المرور بشكل صحيح. كُنْ مُتأكداً من أنك أدخلت المعلومات بشكل صحيح، بما في ذلك الأحرف الكبيرة/الصغيرة. هناك احتمال آخر هو أن ملفات تعريف الارتباط قد تم تعطيلها في متصفح الويب الخاص بك.
it: Errore durante il login. Probabilmente non hai inserito correttamente lo username o la password. Assicurati di averli digitati in modo corretto, anche per quanto riguarda le lettere maiuscole/minuscole. Assicurati altresì di aver abilitato i cookie nel tuo browser.

# success_header
source: Login successful
ar: تم تسجيل الدخول بنجاح
it: Login effettuato con successo

# success_message
source: You are now logged in as '###USER###'
ar: تم تسجيل دخولك الآن كـ '##USER####'
it: Hai effettuato il login come '###USER###'

# status_header
source: Current status
ar: الوضع الحالي
it: Stato corrente

# status_message
source: This is your current status
ar: هذا هو وضعك الحالي
it: Questo è il tuo stato corrente

# cookie_warning
source: Warning: There is a possibility that cookies are not enabled in your web browser! If your login disappears on your next click that is the case and you should enable cookies (or accept cookies from this website) immediately!
ar: تحذير: هناك إمكانية عدم تَمكين ملفات تعريف الارتباط في متصفح الويب الخاص بك! إذا اختفى تسجيل الدخول الخاص بك عند النقر على "التالي"، يجب عليك تمكين ملفات تعريف الارتباط (أو قبول ملفات تعريف الارتباط من هذا الموقع) على الفور! تحذير: هناك احتمال ألا يتم تَمكين ملفات تعريف الارتباط في متصفح الويب الخاص بك! إذا اختفى تسجيل الدخول الخاص بك عند النقرة التالية، يجب عليك تمكين ملفات تعريف الارتباط (أو قبول ملفات تعريف الارتباط من هذا الموقع) على الفور!
it: Attenzione: c'è la possibilità che i cookie non siano abilitati nel tuo browser web! Se il tuo login viene soppresso al tuo prossimo clic, dovresti abilitare immediatamente i cookie (o accettare i cookie da questo sito web)!

source: Username
ar: اسم المستخدم
it: Nome Utente

source: Password
ar: كلمة المرور

source: Login
ar: تسجيل الدخول

# permalogin
source: Stay logged in
ar: البقاء في تسجيل الدخول
it: Rimani connesso

source: Logout
ar: تسجيل الخروج
it: Esci

source: Send password
ar: أرسل كلمة المرور
it: Invia password

source: Reset Password
ar: إعادة تعيين كلمة المرور
it: Reimposta Password

# change_password_header
source: Change your password
ar: تغيير كلمة المرور الخاصة بك
it: Cambia la tua password

# change_password_description
source: Please enter your new password twice.
ar: الرجاء إدخال كلمة المرور الجديدة الخاصة بك مرتين.
it: Inserisci la tua nuova password due volte.

# password_requirement
source: Ensure that your new password matches the following requirements:
ar: تأكّد من أن كلمة المرور الجديدة تتطابق مع المتطلبات التالية:
it: Assicurati che la tua nuova password corrisponda ai seguenti requisiti:

# change_password_nolinkprefix_message
source: Error: there is no prefix for the link. Please set one of the following in your typoscript: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRefPrefix = /
ar: خطأ: لا توجد بادئة للرابط. الرجاء تعيين واحد مما يلي في الـ typoscript الخاصة بك: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRefPrefix = /
it: Errore: non c'è nessuna URL base per il collegamento. Imposta una delle seguenti opzioni nel template TypoScript: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRefPrefix = /

# change_password_notvalid_message
source: The link you clicked is not valid. Please repeat the forgot password procedure.
ar: الرابط الذي ضغطت عليه غير صالح. الرجاء تكرار عملية إعادة تعيين كلمة المرور.
it: Il collegamento che hai cliccato non è valido. Ripeti la procedura di password dimenticata.

# change_password_notequal_message
source: The passwords are not equal, please enter your new password twice. Password needs a minimum length of %s chars.
ar: كلمات المرور غير متطابقة، يرجى إدخال كلمة المرور الجديدة مرتين. كلمة المرور تحتاج إلى حد أدنى من %s الأحرف.
it: Le due password non sono uguali; per favore inserisci la password due volte. La password deve avere un minimo di %s caratteri.

# change_password_tooshort_message
source: The password length is too short. Please enter your new password twice. Password needs a minimum length of %s chars.
ar: كلمة المرور قصيرة جداً. الرجاء إدخال كلمة المرور الجديدة مرتين. كلمة المرور تحتاج إلى حد أدنى من %s الأحرف.
it: La password è troppo corta. Inserisci la password due volte e con lunghezza minima di %s caratteri.

# change_password_done_message
source: Your password has been saved. You can now login with your new password.
ar: تم حفظ كلمة المرور الخاصة بك. يمكنك الآن تسجيل الدخول باستخدام كلمة المرور الجديدة.
it: La tua password è stata salvata. Ora puoi effettuare il login con la nuova password.

# change_password
source: Change your password
ar: تغيير كلمة المرور الخاصة بك
it: Cambia la tua password

# newpassword_label1
source: Enter new password
ar: أدخل كلمة مرور جديدة
it: Inserire nuova password

# newpassword_label2
source: Repeat new password
ar: اعد كتابة كلمة المرور الجديدة
it: Ripetere la nuova password

source: Your email
ar: البريد الإلكتروني الخاص بك
it: Il tuo indirizzo email

# forgot_header
source: Forgot your password?
ar: هل نسيت كلمة المرور؟
it: Hai dimenticato la password?

# forgot_email_password
source: Your password Hi %s Your username is "%s" Your password is "%s"
ar: كلمة المُرور الخاصة بك مرحبا %s اسم المستخدم الخاص بك هو "%s" كلمة المرور الخاصة بك هي "%s"
it: La tua password Ciao %s Il tuo nome utente è "%s" La tua password è "%s"

# forgot_email_nopassword
source: Your password Hi %s We couldn't find a username for this email address and so cannot send the password to you. Probably you misspelled the email address (upper/lower case makes a difference) or maybe you even didn't register yet?
ar: كلمة المرور الخاصة بك مرحبا %s لم نتمكن من العثور على اسم المُستخدم التابع لعنوان البريد الإلكتروني هذا، وبالتالي لا يمكن إرسال كلمة المرور لك. ربما قد كتبت عنوان البريد الإلكتروني بشكل خاطئ، أو ربما لم تقم بالتسجيل حتى الآن؟
it: La tua password Ciao %s Non siamo riusciti a trovare un nome utente per questo indirizzo email e quindi non possiamo inviarti la password. Probabilmente non hai scritto correttamente l'indirizzo email (maiuscolo/minuscolo fa la differenza) o forse non ti sei ancora registrato?

# forgot_validate_reset_password
source: Your new password Dear %s, This email was sent in response to your request to reset your password. Please click on the link below. %s For security reasons, this link is only active until %s. If you do not visit the link before then, you will need to repeat the password reset steps.
ar: كلمة المرور الجديدة الخاصة بك عزيزي/عزيزتي %s تم إرسال هذا البريد الإلكتروني استجابةً لِطلَبك لإعادة تعيين كلمة المرور الخاصة بك. الرجاء النقر على الرابط أدناه. %s لأسباب أمنية، هذا الرابط نشط فقط حتى %s. إذا لم تقم بزيارة الرابط قبل ذلك، سوف تحتاج إلى إعادة تكرار خُطوات إعادة تعيين كلمة المرور.
it: La tua nuova password Gentile %s, Questa email è stata inviata in risposta alla tua richiesta di reimpostare la password. Clicca sul collegamento qui sotto. %s Per motivi di sicurezza, questo collegamento è attivo solo fino al %s. Se non visita il collegamento prima di allora sarà necessario ripetere la procedura di ripristino della password.

# forgot_message
source: Please enter the email address by which you registered your user account. Then press "Send password" and your password will immediately be emailed to you. Make sure to spell your email address correctly.
ar: الرجاء إدخال عنوان البريد الإلكتروني الذي قمت من خلاله بتسجيل حساب المستخدم الخاص بك. ثم اضغط على "إرسال كلمة المرور"، سيتم إرسال كلمة المرور الخاصة بك إلى بريدك الإلكتروني مُباشرةً. تأكد من كتابة عنوان بريدك الإلكتروني بشكل صحيح.
it: Inserisci l'indirizzo email con il quale ti sei registrato. Clicca sul pulsante "Invia password" e la password ti sarà inviata immediatamente. Attenzione a scrivere l'indirizzo correttamente.

# forgot_message_emailSent
source: Your password has now been sent to the email address %s
ar: تم الآن إرسال كلمة المرور الخاصة بك إلى عنوان البريد الإلكتروني %s
it: La tua password è stata inviata all'indirizzo email %s

# forgot_reset_message
source: Please enter your username or email address. Instructions for resetting the password will be immediately emailed to you.
ar: الرجاء إدخال اسم المستخدم أو عنوان البريد الإلكتروني الخاص بك. سيتم إرسال تعليمات إعادة تعيين كلمة المرور إليك مباشرة.
it: Inserisci il tuo nome utente o email. Ti saranno spedite immediatamente le istruzioni su come reimpostare la password.

# forgot_reset_message_emailSent
source: An email has been sent to the address stored in your account and contains a link to reset your password. If you do not receive an email, your account or email address was not found.
ar: تم إرسال بريد إلكتروني إلى العُنوان المُخزّن في حسابك، يحتوي البريد على رابط لإعادة تعيين كلمة المرور الخاصة بك. إذا لم تستلم رسالة البريد إلكتروني، فهذا يعني عدم العثور على حسابك أو عنوان البريد الإلكتروني الخاص بك.
it: Una email, contenente un collegamento per reimpostare la password, è stata inviata all'indirizzo corrispondente al tuo nome utente. Se non ricevi l'email significa che il tuo nome utente o l'indirizzo email non è stato trovato.

# forgot_reset_message_error
source: Your account or email address does not exist.
ar: حسابك أو عنوان بريدك الإلكتروني غير موجود.
it: Il tuo nome utente o il tuo indirizzo email non esiste.

# forgot_header_backToLogin
source: Return to login form
ar: العودة إلى نموذج تسجيل الدخول
it: Ritorna al login

# enter_your_data
source: Username or email address
ar: اسم المستخدم أو عنوان البريد الإلكتروني
it: Nome utente o indirizzo email

# password_recovery_mail_header
source: Your new password
ar: كلمة المرور الجديدة الخاصّة بك
it: La tua nuova password

source: Password recovery link
ar: رابط استرداد كلمة المرور
it: Collegamento recupero password

# password_recovery_link_expired
source: Your password recovery link is expired.
ar: انتهت صلاحية رابط استعادة كلمة المرور الخاصة بك.
it: Il collegamento di recupero della tua password è scaduto.

# empty_password_and_password_repeat
source: New password and new password repeat cannot be empty
ar: كلمة المرور الجديدة وتكرار كلمة المرور الجديدة لا يمكن أن تكونا فارغتين
it: Nuova password e ripeti nuova password non possono essere vuoti

# password_must_match_repeated
source: New Password must match repeated password.
ar: كلمة المرور الجديدة يجب أن تتطابق مع تأكيد كلمة المرور.
it: La nuova password deve corrispondere alla password ripetuta.

# forgot_validate_reset_password_html
source: <p>Dear %s,</p> <p>This email was sent in response to your request to reset your password. Please click on the link below.</p> <p>%s</p> <p>For security reasons, this link is only active until %s. If you do not visit the link before then, you will need to repeat the password reset steps.</p>
ar: <p>عزيزي/عزيزتي %s،</p> <p> تم إرسال هذا البريد الإلكتروني استِجَابِةً لِطلبك لإعادة تعيين كلمة المرور الخاصة بك. الرجاء النقر على الرابط أدناه .</p> <p>%s</p> <p> لأسباب أمنية، هذا الرابط صالح فقط حتى %s. إذا لم تقم بزيارة الرابط قبل ذلك، سوف تحتاج إلى إعادة تكرار خطوات إعادة تعيين كلمة المرور.</p>
it: <p>Gentile %s,</p> <p>Questa email è stata inviata in risposta alla tua richiesta di reimpostare la password. Clicca sul collegamento qui sotto.</p> <p>%s</p> <p>Per motivi di sicurezza, questo collegamento è attivo solo fino al %s. Se non visita il collegamento prima di allora sarà necessario ripetere la procedura di ripristino della password.</p>

# forgot_validate_reset_password
source: Dear %s, This email was sent in response to your request to reset your password. Please click on the link below. %s For security reasons, this link is only active until %s. If you do not visit the link before then, you will need to repeat the password reset steps.
ar: عزيزي/عزيزتي %s، تم إرسال هذا البريد الإلكتروني استِجابِةً لِطلبك لإعادة تعيين كلمة المرور الخاصة بك. الرجاء النقر على الرابط أدناه. %s لأسباب أمنية، هذا الرابط صالح فقط حتى %s. إذا لم تقم بزيارة الرابط قبل ذلك، سوف تحتاج إلى إعادة تكرار خطوات إعادة تعيين كلمة المرور.
it: Gentile %s, questa email è stata inviata in risposta alla richiesta di reimpostare la password. Clicca sul collegamento qui sotto. %s Per motivi di sicurezza, questo collegamento è attivo solo fino al %s. Se non visita il collegamento prima di allora sarà necessario ripetere la procedura di ripristino della password.
