Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/dashboard/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# title
source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord
it: Cruscotto

# widget.add
source: Add widget
ar: اضافة تطبيق مصغر
fr: Ajouter un widget
it: Aggiungi widget

# widget.addToDashboard
source: Add widget to "%s"
ar: إضافة عنصر واجهة المستخدم إلى "%s"
fr: Ajouter un widget à "%s"
it: Aggiungi il widget a "%s"

# widget.addToDashboard.searchLabel
source: Search for dashboard widgets
ar: البحث عن أدوات لوحة التحكم
fr: Chercher un widget de tableau de bord
it: Cerca i widget per la dashboard

# widget.addToDashboard.searchNotFound
source: Unfortunately no dashboard widget matches your query, please try a different one.
ar: لسوء الحظ، لا توجد أداة لوحة التحكم تطابق استعلامك، يرجى تجرِبة استعلام مختلف.
fr: Malheureusement, aucun widget de tableau de bord ne correspond à votre requête, veuillez modifier votre recherche.
it: Purtroppo nessun widget per la dashboard corrisponde alla tua ricerca, per favore provane una diversa.

# widget.add.button.close
source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# widget.add.button.ok
source: Add widget
ar: اضافة تطبيق مصغر
fr: Ajouter un widget
it: Aggiungi widget

# widget.remove.button.close
source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# widget.remove.button.ok
source: Remove
ar: إزالة
fr: Supprimer
it: Rimuovi

# widget.remove.confirm.title
source: Remove widget
ar: إزالة التطبيق المُصغّر
fr: Supprimer le widget
it: Rimuovi widget

# widget.remove.confirm.message
source: Are you sure you want to remove this widget?
ar: هل أنت متأكد من أنك تريد حذف هذا التطبيق المُصغّر؟
fr: Êtes-vous sûr de vouloir supprimer ce widget ?
it: Sei sicuro di voler rimuovere questo widget?

# widget.error
source: An error occurred while retrieving information for this widget. Please try again, and if the problem persists, contact your administrator.
ar: حدث خطأ أثناء استرداد المعلومات لهذا التطبيق المُصغّر. الرجاء المحاولة مرة أخرى، وإذا استمرت المشكلة، اتصل بالمسؤول.
fr: Une erreur s'est produite lors de la récupération des informations pour ce widget. Veuillez essayer à nouveau, et si le problème persiste, contactez votre administrateur.
it: Si è verificato un errore durante il recupero delle informazioni per questo widget. Si prega di riprovare e, se il problema persiste, contattare l'amministratore.

# dashboard.default
source: My dashboard
ar: لوحة التحكم الخاصّة بي
fr: Mon tableau de bord
it: Il mio cruscotto

# dashboard.default.description
source: Create a new dashboard with some general TYPO3 widgets on it
ar: إنشاء لوحة تحكم جديدة مع بعض أدوات TYPO3 العامة عليها
fr: Créer un nouveau tableau de bord avec quelques widgets TYPO3 généraux
it: Crea un nuovo cruscotto con alcuni widget TYPO3

# dashboard.empty
source: Empty dashboard
ar: لوحة تحكم فارغة
fr: Tableau de bord vide
it: Cruscotto vuoto

# dashboard.empty.description
source: Your dashboard will be created without any widget on it.
ar: سيتم إنشاء لوحة التحكم الخاصة بك دون أي تطبيقات مُصغّرة عليها.
fr: Votre tableau de bord sera créé sans widget.
it: Il tuo cruscotto verrà creato senza alcun widget.

# dashboard.add
source: Add dashboard
ar: إضافة لوحة تحكم
fr: Ajouter un tableau de bord
it: Aggiungi cruscotto

# dashboard.add.button.close
source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# dashboard.add.button.ok
source: Add Dashboard
ar: إضافة لوحة تحكم
fr: Ajouter un tableau de bord
it: Aggiungi Cruscotto

# dashboard.configure
source: Configure dashboard
ar: تكخصيص لوحة التحكم
fr: Configurer le tableau de bord
it: Configura cruscotto

# dashboard.configure.button.close
source: Close
ar: إغلاق
fr: Fermer
it: Chiudi

# dashboard.configure.button.ok
source: Save Dashboard
ar: حفظ لوحة التحكم
fr: Enregistrer le tableau de bord
it: Salva Cruscotto

# dashboard.delete
source: Delete dashboard
ar: حذف لوحة التحكم
fr: Supprimer le tableau de bord
it: Elimina cruscotto

# dashboard.delete.sure
source: Are you sure you want to delete this dashboard?
ar: هل أنت متأكد من أنك تريد حذف لوحة التحكم هذه؟
fr: Voulez-vous vraiment supprimer ce tableau de bord ?
it: Sei sicuro di voler eliminare questo cruscotto?

# dashboard.delete.ok
source: Yes, delete it
ar: نعم، إحذفه!
fr: Oui, le supprimer
it: Sì, elimina

# dashboard.delete.cancel
source: Cancel
ar: إلغاء
fr: Annuler
it: Annulla

# dashboard.title
source: Title of dashboard
ar: عنوان لوحة التحكم
fr: Titre du tableau de bord
it: Titolo del cruscotto

# widgets.documentation.gettingStarted.title
source: Getting Started with TYPO3
ar: البدء مع TYPO3
fr: Débuter avec TYPO3
it: Primi Passi con TYPO3

# widgets.documentation.gettingStarted.description
source: Add a shortcut to the TYPO3 Getting Started Tutorial.
ar: أضف اختصاراً إلى البرنامَج التعليمي الخاص بـ TYPO3.
fr: Ajouter un raccourci au guide de démarrage de TYPO3.
it: Aggiunge una scorciatoia a "Getting Started Tutorial" di TYPO3.

# widgets.documentation.gettingStarted.text
source: New to TYPO3? In our Getting Started Tutorial you will learn the basics how to use TYPO3.
ar: هل أنت جديد على TYPO3؟ في درسنا التعليمي الذي يبدأ سوف تتعلم أساسيات استخدام TYPO3.
fr: Nouveau sur TYPO3 ? Dans notre guide de démarrage, vous apprendrez les bases de l'utilisation de TYPO3.
it: Sei nuovo a TYPO3? Nel nostro "Getting Started Tutorial" imparerai le basi su come usare TYPO3.

# widgets.documentation.gettingStarted.content.label
source: Getting Started Tutorial
ar: بدء البرنامج التعليمي
fr: Guide de démarrage
it: Guida Introduttiva

# widgets.documentation.typoscriptReference.title
source: TypoScript Template Reference
ar: مرجع قالب TypoScript
fr: Référence du gabarit TypoScript
it: Guida di riferimento TypoScript - TSref

# widgets.documentation.typoscriptReference.description
source: Add a shortcut to the TYPO3 TypoScript Template Reference.
ar: إضافة اختصار إلى مرجع قالب TypoScript TypoScript.
fr: Ajouter un raccourci vers la référence du gabarit TypoScript.
it: Aggiunge una scorciatoia a "TypoScript Template Reference" di TYPO3 (TSref).

# widgets.documentation.typoscriptReference.text
source: This document is a reference, used to lookup TypoScript templating.
ar: هذا المستند هو مرجع، يستخدم للبحث عن قالب TypoScript.
fr: Ce document est une référence, utilisée pour l'élaboration de gabarits TypoScript.
it: La guida di riferimento per cercare le istruzioni TypoScript per la creazione di Template.

# widgets.documentation.typoscriptReference.content.label
source: TypoScript Template Reference
ar: مرجع قالب TypoScript
fr: Référence du gabarit TypoScript

# widgets.documentation.TSconfigReference.title
source: TSconfig Reference
ar: مرجع TSconfig
fr: Référence TSConfig
it: Guida di riferimento di TSconfig

# widgets.documentation.TSconfigReference.description
source: Add a shortcut to the TYPO3 TSconfig Reference.
ar: إضافة اختصار إلى مرجع TSconfig TYPO3.
fr: Ajouter un raccourci à la documentation de référence TSconfig de TYPO3.
it: Aggiunge una scorciatoia a "TSconfig Reference" di TYPO3.

# widgets.documentation.TSconfigReference.text
source: This document describes TSconfig and its options.
ar: تصف هذه الوثيقة TSconfig وخياراته.
fr: Ce document décrit le TSconfig et ses options.
it: Questo documento descrive TSconfig e tutte le sue opzioni.

# widgets.documentation.TSconfigReference.content.label
source: TSconfig Reference
ar: مرجع TSconfig
fr: Référence TSconfig

# widgets.t3news.title
source: TYPO3 news
ar: TYPO3 أخبار
it: Novità TYPO3

# widgets.t3news.description
source: Add a list of news items from the TYPO3 project
ar: إضافة قائمة إخبارية من مشروع TYPO3
fr: Ajouter une liste d'actualités du projet TYPO3
it: Aggiunge una lista di notizie dal progetto TYPO3

# widgets.t3news.moreItems
source: More TYPO3 news
ar: المزيد من أخبار TYPO3
fr: Plus d'actualités de TYPO3
it: Ulteriori novità TYPO3

# widgets.t3information.title
source: About TYPO3
ar: حول TYPO3
fr: À propos de TYPO3
it: Informazioni su TYPO3

# widgets.t3information.description
source: Some general information about TYPO3 and the version used
ar: بعض المعلومات العامة عن TYPO3 والنسخة المستخدمة
fr: Quelques informations générales sur TYPO3 et la version utilisée
it: Alcune informazioni generali su TYPO3 e la versione utilizzata

# widgets.t3information.text
source: TYPO3 CMS is an enterprise-class, Open Source Content Management System, used internationally to build and manage websites of all types, from small sites for non-profits to multilingual enterprise solutions for large corporations.<br /><br />For further information visit <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS is <b>freely available</b> under the <a href="https://typo3.org/project/licenses/" target="_blank" rel="noreferrer">TYPO3-license (GNU/GPL)</a>.<br /><br />You are using version %s - Copyright %s %s
ar: TYPO3 CMS هو نظام إدارة محتوى مفتوح المصدر، يستخدم حول العالم لبناء وإدارة مواقع الويب من جميع الأنواع، من المواقع الصغيرة للمؤسسات غير الربحية إلى حلول المؤسسات متعددة اللغات للشركات الكبيرة.<br /><br />لمزيد من المعلومات، تفضل بزيارة <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />CMS <b>مُتاح مجاناً</b> تحت شهادة <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank" rel="noreferrer">TYPO3-license (GNU/GPL)</a>.<br /><br />أنت تستخدم الإصدار %s - Copyright %s %s
fr: TYPO3 CMS est un système de gestion de contenu Open Source, utilisé internationalement pour construire et gérer des sites web de tous types, des petits sites à but non lucratif aux solutions multilingues complexes pour les grandes entreprises.<br /><br />Pour plus d'informations visitez <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />Le CMS TYPO3 est <b>librement disponible</b> sous la <a href="https://typo3.org/project/licenses/" target="_blank" rel="noreferrer">licence TYPO3 (GNU/GPL)</a>.<br /><br />Vous utilisez la version %s - Copyright %s %s
it: TYPO3 CMS è un Content Management System Open Source di classe enterprise, per la gestione dei contenuti, utilizzato a livello internazionale per costruire e gestire siti web di ogni tipo: da piccoli siti non-profit a soluzioni aziendali multilingue per grandi aziende.<br /><br />Per ulteriori informazioni visita <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS è <b>disponibile gratuitamente</b> sotto la <a href="https://typo3.org/project/licenses/" target="_blank" rel="noreferrer">TYPO3-license (GNU/GPL)</a>.<br /><br />Stai usando la versione %s - Copyright %s %s

# widgets.t3information.logo
source: TYPO3 CMS logo
ar: شعار TYPO3 CMS
fr: Logo TYPO3 CMS
it: Logo di TYPO3 CMS

# widgets.sysLogErrors.title
source: Number of errors in system log
ar: عدد الأخطاء في سجل النظام
fr: Nombre d'erreurs dans le journal système
it: Numero di errori nel log di sistema

# widgets.sysLogErrors.description
source: Shows the number of errors in the sys log of the last month, grouped by date
ar: يظهر عدد الأخطاء في سجل الأنظمة في الشهر الماضي، مُجمّعة حسب التاريخ
fr: Affiche le nombre d'erreurs dans le journal système lors du dernier mois, regroupé par date
it: Mostra il numero di errori nel log di sistema dell'ultimo mese, raggruppati per data

# widgets.sysLogErrors.buttonText
source: Show all errors in log
ar: عرض جميع الأخطاء في السجل
fr: Afficher toutes les erreurs du journal
it: Mostra tutti gli errori nel log di sistema

# widgets.sysLogErrors.chart.dataSet.0
source: Number of errors
ar: عدد الأخطاء
fr: Nombre d'erreurs
it: Numero di errori

# widgets.typeOfUsers.title
source: Type of backend users
ar: نوع مُستخدمي الواجهة الخلفية
fr: Type d'utilisateur backend
it: Tipi di Utenti di Backend

# widgets.typeOfUsers.description
source: Shows the amount of normal- and admin-users
ar: عرض كَمّيَّة المستخدمين العاديين والمشرفين
fr: Affiche le nombre d'utilisateurs normaux et administrateurs
it: Mostra la quantità di utenti ordinari e amministratori

# widgets.typeOfUsers.normalUsers
source: Normal users
ar: المستخدمون العاديون
fr: Utilisateurs normaux
it: Utenti ordinari

# widgets.typeOfUsers.adminUsers
source: Admin users
ar: المستخدمون المُشرفون
fr: Administrateurs
it: Utenti admin

# widgets.failedLogins.title
source: Failed backend logins
ar: فشل تسجيل الدخول في الواجهة الخلفية
fr: Échecs de connexions au backend
it: Autenticazioni al backend fallite

# widgets.failedLogins.subtitle
source: In last 24 hours
ar: في آخر 24 ساعة
fr: Dernières 24 heures
it: Nelle ultime 24 ore

# widgets.failedLogins.description
source: Information about the number of failed logins during the last 24 hours.
ar: معلومات عن عدد محاولات تسجيل الدخول الفاشلة خلال الساعات الـ 24 الأخيرة.
fr: Informations sur le nombre de connexions échouées au cours des dernières 24 heures.
it: Informazioni riguardo il numero di autenticazioni fallite nelle ultime 24 ore.

# widgets.t3securityAdvisories.title
source: TYPO3 security advisories
ar: استشارات الأمان TYPO3
fr: Alertes de sécurité TYPO3
it: Avvisi di sicurezza di TYPO3

# widgets.t3securityAdvisories.description
source: Add a list of security advisories from the TYPO3 project
ar: إضافة قائمة بالتحذيرات الأمنية من مشروع TYPO3
fr: Ajouter une liste des alertes de sécurité du projet TYPO3
it: Aggiunge una lista di avvisi di sicurezza dal progetto TYPO3

# widgets.t3securityAdvisories.moreItems
source: More TYPO3 security advisories
ar: المزيد من الإشعارات الأمنية من TYPO3
fr: Alertes de sécurité TYPO3
it: Ulteriori avvisi di sicurezza TYPO3

# widget_group.general
source: General
ar: عام
fr: Général
it: Generale

# widget_group.typo3
source: TYPO3 community
ar: مجتمع TYPO3
fr: Communauté TYPO3
it: Comunità di TYPO3

# widget_group.news
source: News
ar: الأخبَار
fr: Actualités
it: Notizie

# widget_group.documentation
source: Documentation
ar: إرشادات الإستخدام
it: Documentazione

# widget_group.system
source: System Information
ar: معلومات النظام
fr: Informations système
it: Informazioni di Sistema

# dashboard.empty.content.title
source: No widgets
ar: لا يوجد أدوات مُصغّرة
fr: Aucun Widget
it: Nessun widget

# dashboard.empty.content.description
source: There are no widgets on this dashboard yet. You can add widgets now by clicking on the button below.
ar: لا توجد أدوات مُصغّرة على لوحة التحكم هذه حتى الآن. يمكنك إضافة الأدوات الآن بالنقر على الزر أدناه.
fr: Il n'y a pas encore de widgets sur ce tableau de bord. Vous pouvez maintenant ajouter des widgets en cliquant sur le bouton ci-dessous.
it: Non ci sono ancora widget su questo cruscotto. Puoi aggiungere widget facendo clic sul pulsante qui sotto.

# dashboard.empty.content.button
source: Add a widget
ar: اضف تطبيق مُصفّر
fr: Ajouter un widget
it: Aggiungi un widget
