Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/scheduler/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

# msg.invalidTaskClass
source: <strong>The following tasks are broken.</strong> If your task doesn't have a registered class, you should consider reinstalling the extension that provided them or simply deleting the task. In case the error is "Cannot unserialize [class]", the announced class must be removed from your task class, as it is not allowed to be used due to security reasons. Please check also if any of the listed tasks have to be recreated manually (which can be necessary after an extension update due to breaking changes or missing migration scripts).
ar: <strong>المهام التالية تحتاج للإصلاح.</strong> إذا لم تحتوي مهمتك على فئة مسجلة، يُرجى النظر في إعادة تثبيت الإضافة التي يوفرها أو حذف المهمة ببساطة. في حالة الخطأ "لا يمكن فك تسلسل [class]"، يجب إزالة الفئة المُعلنة من فئة المهمة الخاصة بك، حيث لا يُسمح باستخدامها لأسباب أمان. يُرجى التحقق أيضًا مما إذا كانت أي من المهام المدرجة يجب إعادة إنشاؤها يدويًا (وهو قد يكون ضروريًا بعد تحديث الامتداد بسبب التغييرات الكبيرة أو نقص سيناريوهات الهجرة).
fr: <strong>Les tâches suivantes sont erronées.</strong> Si votre tâche n'a pas de classe enregistrée, vous devriez envisager de réinstaller l'extension qui les a fournies ou simplement de supprimer la tâche. Dans le cas où l'erreur est "Cannot unserialize [class]", la classe annoncée doit être retirée de votre classe de tâche, car elle n'est pas autorisée à être utilisée pour des raisons de sécurité. Veuillez vérifier également si l'une des tâches listées doit être recréée manuellement (ce qui peut être nécessaire après une mise à jour de l'extension en raison de modifications impactantes ou de scripts de migration manquants).
it: <strong>Le seguenti attività sono state interrotte.</strong> Se la tua attività non ha una classe registrata, dovresti considerare la reinstallazione dell'estensione che l'ha fornita o semplicemente l'eliminazione dell'attività. Nel caso in cui l'errore sia "Impossibile deserializzare [class]", la classe specificata deve essere rimossa, poiché non può essere utilizzata per motivi di sicurezza. Inoltre verificare se una qualsiasi delle attività elencate deve essere ricreata manualmente (può essere necessario dopo un aggiornamento di estensione, a causa di modifiche in corso, o di script di migrazione mancanti).

# msg.errorMessage
source: Error message
ar: رسالة الخطأ
fr: Message d'erreur
it: Messaggio di errore

# msg.invalidTaskClassEdit
source: The current class (%s) could not be found. Change it below or consider deleting this task altogether.
ar: الصنف الحالي (%s) غير موجود. قم بتغييره أدناه أو اعتبر حذف هذه المهمة تمامًا.
fr: La classe courante (%s) n'a pas été trouvée. Veuillez la changer ci-dessous ou supprimer la tâche.
it: La classe attuale (%s) non è stata trovata. Cambiala qui sotto oppure considera la possibilità di rimuovere del tutto questa attività.

# msg.invalidTaskClass.infobox.title
source: %s registered scheduler tasks can not be executed
ar: لا يمكن تنفيذ %s المهام المجدولة المسجلة
fr: %s tâches du planificateur enregistrées ne peuvent pas être exécutées
it: %s attività di scheduler registrate non possono essere eseguite

# msg.invalidTaskClass.infobox.message
source: <a href="#scheduler-task-group-missing">Please check the erroneous tasks!</a>
ar: <a href="#scheduler-task-group-missing">الرجاء التحقق من المهام الخاطئة!</a>
fr: <a href="#scheduler-task-group-missing">Veuillez vérifier les tâches erronées !</a>
it: <a href="#scheduler-task-group-missing">Si prega di controllare le attività errate!</a>

# msg.schedulerSetupCheck
source: This screen checks if the requisites for running the Scheduler as a cron job are fulfilled. It also displays information about the last run of the Scheduler.
ar: يقوم هذه الشاشة بالتحقق مما إذا تم استيفاء الشروط اللازمة لتشغيل المجدول كوظيفة cron. كما يعرض معلومات حول آخر تشغيل للمجدول.
fr: Cet écran vérifie si les pré-requis du planificateur sont remplis. Il montre également des informations concernant la dernière exécution du planificateur.
it: Questa schermata controlla se i requisiti per eseguire lo Scheduler, con un job-cron, sono soddisfatti. Mostra anche informazioni sull'ultima esecuzione dello Scheduler.

# msg.serverTime
source: Current server time is %s.
ar: وقت الخادم الحالي هو %s.
fr: L'heure courante du serveur est : %s
it: L'ora corrente del server è %s.

# msg.serverTimeHelp
source: All dates and times in the Scheduler are measured according to the server's time, as the Scheduler is run purely on the server-side.
ar: جميع التواريخ والأوقات في المُجدول تُقاس وفقًا لوقت الخادم، حيث يتم تشغيل المجدول بشكلٍ خالص على (Server-side).
fr: Toutes les dates et les heures du planificateur sont mesurées selon l'heure du serveur, étant donné que le planificateur est exécuté uniquement du côté serveur.
it: Tutte le date e gli orari nello Scheduler sono misurati in base all'ora del server, in quanto lo Scheduler è eseguito esclusivamente lato server.

# msg.stop
source: Are you sure you want to mark this task as not running? Note that this will not stop the actual script (if unsure please refer to the manual).
ar: هل أنت متأكد من أنك تريد وضع علامة على هذه المهمة على أنها ليست قيد التشغيل؟ لاحظ أن هذا لن يوقف البرنامَج النصي الفعلي (إذا لم تكن متأكدًا يرجى الرجوع إلى الدليل).
fr: Êtes-vous certain de vouloir marquer cette tâche comme n'étant pas en cours d'exécution ? Veuillez noter que cela ne va pas arrêter l'exécution réelle (veuillez vous référer au manuel si besoin).
it: Sei sicuro di voler contrassegnare questa attività come non in esecuzione? Nota che questo non fermerà lo script reale (se non sei sicuro fai riferimento al manuale).

# msg.stopError
source: The task could not be marked as non-running.
ar: لا يمكن وضع علامة على المهمة على أنها ليست قيد التشغيل.
fr: La tâche n'a pas pu être marquée comme n'étant pas en cours d'exécution.
it: L'attività non può essere contrassegnata come non in esecuzione.

# msg.stopSuccess
source: The task was successfully marked as non-running.
ar: تم وضع علامة نجاح للمهمة بصفة غير قائمة على التشغيل.
fr: La tâche a été marquée avec succès comme n'étant pas en cours d'exécution.
it: L'attività è stata contrassegnata, con successo, come non in esecuzione.

# msg.taskNotFound
source: The requested task (UID: %d) was not found.
ar: لم يتم العثور على المهمة المطلوبة (UID: %d).
fr: La tâche demandée (UID : %d) n'a pas été trouvée.
it: L'attività richiesta (UID: %d) non è stata trovata.

# msg.updateSuccess
source: The task was updated successfully.
ar: تم تحديث المهمة بنجاح.
fr: La tâche a été mise à jour avec succès.
it: L'attività è stata aggiornata con successo.

# msg.updateError
source: The task could not be updated.
ar: تعذّر تحديث المَهمّة.
fr: La tâche n'a pas pu être mise à jour.
it: Non è possibile aggiornare l'attività.

# msg.selectionOfNonExistingDatabaseTables
source: Some of the selected database tables do not exist. Please select only valid tables.
ar: بعض جداول قاعدة البيانات المُحددة غير موجودة. الرجاء تحديد جداول صالحة فقط.
fr: Certaines tables de la base de données sélectionnées n'existent pas. Veuillez sélectionner uniquement des tables valides.
it: Alcune delle tabelle del database selezionate non esistono. Seleziona solo tabelle valide.

# msg.noDatabaseTablesSelected
source: Please select at least one database table.
ar: الرجاء تحديد جدول قاعدة بيانات واحد على الأقل.
fr: Veuillez sélectionner au moins une table de la base de données.
it: Per favore seleziona almeno una tabella del database.

# msg.unregisteredCommand
source: Command with identifier "%s" has not been registered.
ar: الأمر المُعطى بالمُعرّف "%s" لم يتم تسجيله.
fr: La commande avec l'identifiant "%s" n'a pas été enregistrée.
it: Il comando con identificatore "%s" non è stato registrato.

# msg.errorParsingArguments
source: Error parsing current set of arguments: "%s".
ar: خطأ في تحليل مجموعة الوسائط الحالية: "%s".
fr: Erreur dans l'analyse du jeu d'arguments: "%s".
it: Errore nell'analizzare l'attuale insieme di argomenti: "%s".

# msg.errorParsingOptions
source: Error parsing current set of options: "%s".
ar: خطأ في تحليل مجموعة الخيارات الحالية: "%s".
fr: Erreur lors de l'analyse des options : "%s".
it: Errore nell'analizzare l'insieme di opzioni correnti: "%s".

# msg.mandatoryArgumentMissing
source: Argument "%s" is mandatory.
ar: المُعامل "%s" إلزامي.
fr: L'argument "%s" est obligatoire.
it: Argomento "%s" è obbligatorio.

# msg.taskEnabled
source: Task "%s" with uid "%s" has been enabled.
ar: تم تفعيل المهمة "%s" برقم الهوية "%s".
fr: La tâche "%s" avec l'uid "%s" a été activée.
it: L'attività "%s" con uid "%s" è stato abilitata.

# msg.taskDisabled
source: Task "%s" with uid "%s" has been disabled.
ar: تم تعطيل المهمة "%s" برقم الهوية "%s".
fr: La tâche "%s" avec l'uid "%s" a été désactivée.
it: L'attività "%s" con uid "%s" è stata disabilitata.

# msg.taskEnabledAndQueuedForExecution
source: Task "%s" with uid "%s" has been enabled and queued for execution at next scheduler CLI run.
ar: تم تفعيل المهمة "%s" بمُعرّف "%s" وتم وضعها في قائمة الانتظار للتنفيذ في أقرب جِلسة تشغيل لجدول المهام (scheduler) عبر واجهة السطر (CLI).
fr: La tâche "%s" avec l'uid "%s" a été activée et mise en file d'attente pour être exécutée lors du prochain lancement du planificateur via CLI.
it: L'attività "%s" con uid "%s" è stata abilitata e accodata per l'esecuzione alla prossima esecuzione dello scheduler.

# msg.taskQueuedForExecution
source: Task "%s" with uid "%s" has been queued for execution at next scheduler CLI run.
ar: تم إضافة المهمة "%s" ذات المُعرّف "%s" إلى قائمة الانتظار للتنفيذ في التشغيل التالي لجدول المهام الخاص بواجهة سطر الأوامر.
fr: La tâche "%s" avec l'uid "%s" a été mise en file d'attente pour être exécutée lors du prochain lancement du planificateur via CLI.
it: L'attività "%s" con uid "%s" è stata accodata per l'esecuzione alla prossima esecuzione dello scheduler.

# msg.group.deleted
source: Successfully deleted scheduler group.
ar: تم حذف مجموعة المُجَدْول بنجاح.
fr: Le groupe a été supprimé avec succès.
it: Gruppo scheduler eliminato con successo.

# msg.group.delete.failed
source: Failed to delete scheduler group.
ar: فشل في حذف مجموعة المُجَدْول.
fr: Impossible de supprimer le groupe.
it: Impossibile eliminare il gruppo scheduler.

source: None
ar: لا شَيْء
fr: Aucun
it: Nessuno

source: Status
ar: الحالة
fr: Statut
it: Stato

# status.progress
source: Progress
ar: مستوى التقدُّم
fr: Avancement
it: Avanzamento

# status.disabled
source: disabled
ar: مُعطّل
fr: désactivée
it: disabilitato

# status.disabledByGroup
source: disabled by group
ar: مُعطّل حسب المجموعة
fr: désactivé par le groupe
it: disabilitato per il gruppo

# status.failure
source: failure
ar: فشل
fr: échec
it: errore

# status.late
source: late
ar: متأخر
fr: en retard
it: in ritardo

# status.running
source: running
ar: قيد التشغيل
fr: en cours d'exécution
it: in esecuzione

# status.scheduled
source: scheduled
ar: مُجدوَل
fr: planifiée
it: pianificato

source: Task
ar: المهمة
fr: Tâche
it: Attività

# title
source: TYPO3 Scheduler administration module
ar: وحدة إدارة جدولة TYPO3
fr: Module d'administration du planificateur de TYPO3
it: Modulo di amministrazione dello Scheduler di TYPO3

# action.run_task
source: Run task
ar: تشغيل المهمة
fr: Exécuter la tâche
it: Esegui attività

# action.run_task_cron
source: Run task on next cron job
ar: تشغيل المَهمّة في الجولة الزمنية التالية للمهمة المُجدولة
fr: Exécuter la tâche lors de la prochaine tâche cron
it: Esegue l'attività nel prossimo job-cron

# cachingFrameworkGarbageCollection.name
source: Caching framework garbage collection
ar: جمع القمامة في إطار التخزين المؤقت
fr: Ramasse-miette du gestionnaire de cache
it: Garbage collection del framework di memorizzazione nella cache

# cachingFrameworkGarbageCollection.description
source: This task calls the garbage collection of configured caching framework caches which use one of the selected backends. This will free some space in cache backends which do not have an internal garbage collection. In case of the default database backend it is advisable to run this task once a day when the database is mostly idle.
ar: تقوم هذه المهمة بإجراء تنظيف لذاكرة التخزين المؤقت للنظام حسب الإعدادات المُكوَّنة، والتي تُستخدَم من قِبل أحد خِدْمَات الواجهة الخلفية المُحددة. سيؤدي ذلك إلى تحرير مساحة في ذاكرة التخزين المؤقت للخدمات التي لا تحتوي على نظام للتنظيف الداخلي. في حال استخدام خدمة قاعدة البيانات الافتراضية، فمن النصح تشغيل هذه المهمة مرة واحدة يوميًا عندما تكون قاعدة البيانات في حالة سكون بشكلٍ رئيس.
fr: Cette tâche appelle le ramasse-miettes des caches du gestionnaire de cache pour les backends sélectionnés. Cela libérera de l'espace dans les backends qui n'ont pas de système de ramasse-miettes intégré. Si le backend base de données est utilisé, il est conseillé d'exécuter cette tâche une fois par jour, quand la base de données est peu sollicitée.
it: Questa attività esegue il garbage collection su voci di cache del framework di memorizzazione nella cache, che utilizzano uno dei backend selezionati. Questo libererà spazio nei backend della cache che non hanno una garbage collection interna. Nel caso del backend del database è consigliabile eseguire questa attività una volta al giorno quando il database è per lo più inattivo.

# fileIndexing.name
source: [OBSOLETE] File Abstraction Layer: Indexing job
ar: [OBSOLETE] طبقة تجريد الملفات: وظيفة الفهرسة
fr: [OBSOLETE] File Abstraction Layer : tâche d'indexation
it: [OBSOLETO] File Abstraction Layer: processo di indicizzazione

# fileIndexing.description
source: Runs indexing tasks based on an indexing configuration and a storage/folder information.
ar: يقوم بتشغيل مهام الفَهرسة استنادًا إلى تكوين الفهرسة ومعلومات التخزين/المجلد.
fr: Exécute des tâches d'indexation basées sur une configuration d'indexation et une information de stockage/dossier.
it: Esegue l'indicizzazione basata su una configurazione di indicizzazione e l'indicazione di una Storage/cartella.

# fileStorageIndexing.name
source: File Abstraction Layer: Update storage index
ar: طبقة التجريد الملفات: تحديث فهرس التخزين
fr: File Abstraction Layer : Mise à jour de l'index du dossier de stockage
it: File Abstraction Layer: Aggiorna indice dello Storage

# fileStorageIndexing.description
source: Updates the Index/Cache Data of a Storage; only needed if changes to the storage are possible outside the backend (FTP, RemoteStorages).
ar: يُحدث بيانات الفِهْرِس/الذاكرة المؤقتة لمخزن، مطلوب فقط في حال كانت هناك تغييرات ممكنة للمخزن خارج لوحة التحكم (FTP، RemoteStorages).
fr: Met à jour l'index/le cache des données d'un dossier de stockage ; uniquement nécessaire si des modifications du dossier de stockage peuvent survenir en dehors du backend (FTP, dossiers de stockage distants).
it: Aggiorna i dati Indice/Cache di uno Storage. Necessario solo se sono presenti Storage al di fuori del backend (FTP, RemoteStorages).

# fileStorageExtraction.name
source: File Abstraction Layer: Extract metadata in storage
ar: طبقة تجريد الملف: استخراج البيانات الوصفية في التخزين
fr: File Abstraction Layer : Extraction des metadonnées du dossier de stockage
it: File Abstraction Layer: Estrae i metadati dallo Storage

# fileStorageExtraction.description
source: Extracts metadata for all files in storage which have been changed since last run.
ar: يستخرج بيانات التعريف لجميع الملفات الموجودة في التخزين والتي تم تغييرها منذ آخر تشغيل.
fr: Extrait les métadonnées de tous les fichiers stockés qui ont été modifiés depuis la dernière exécution.
it: Estrae i metadati per tutti i file nello storage che sono stati modificati dall'ultima esecuzione.

# tableGarbageCollection.name
source: Table garbage collection
ar: التطهير الآلي للجداول
fr: Ramasse-miette des tables
it: Tabella del Garbage Collection

# tableGarbageCollection.description
source: Task to delete old entries from specific tables like sys_log. Use $GLOBALS['TYPO3_CONF_VARS']['SC_OPTIONS']['scheduler']['tasks']['tx_scheduler_TableGarbageCollection']['options']['tables'] to configure tables. Refer to the manual for more details.
ar: مهمة حذف الإدخالات القديمة من الجداول المُحددة مثل sys_log. استخدم $GLOBALS['TYPO3_CONF_VARS']['SC_OPTIONS']['scheduler']['tasks']['tx_scheduler_TableGarbageCollection']['options']['tables'] لتكوين الجداول. يُرجى الاطلاع على الدليل لمزيد من التفاصيل.
fr: Tâche pour supprimer les anciennes entrées de tables spécifiques comme sys_log. Utilisez $GLOBALS['TYPO3_CONF_VARS']['SC_OPTIONS']['scheduler']['tasks']['tx_scheduler_TableGarbageCollection']['options']['tables'] pour configurer ces tables. Reportez-vous au manuel pour plus de détails.
it: Attività per eliminare le vecchie voci da tabelle specifiche come sys_log. Usa $GLOBALS['TYPO3_CONF_VARS']['SC_OPTIONS']['scheduler']['tasks']['tx_scheduler_TableGarbageCollection']['options']['tables'] per configurare le tabelle. Fai riferimento al manuale per maggiori dettagli.

# recyclerGarbageCollection.name
source: Fileadmin garbage collection
ar: مجموعة قمامة Fileadmin
fr: Ramasse-miette du fileadmin
it: Garbage Collection della cartella fileadmin/

# recyclerGarbageCollection.description
source: This task empties all "_recycler_" folders below fileadmin. This helps free some space in the file system.
ar: هذه المهمة فارغة جميع مجلدات "_recycler_" أسفل الملفات. هذا يساعد على تحرير بعض المساحة في نظام الملفات. هذه المهمة تُفرّغ جميع المجلدات التي تحتوي على الاسم "recycler" تحت المسار fileadmin. ويساعد ذلك في تحرير بعض المساحة في نظام الملفات.
fr: Cette tâche vide tous les dossiers "_recycler_" à l'intérieur du fileadmin. Cela permet de libérer de l'espace sur le système de fichiers.
it: Questa attività svuota tutte le cartelle "_recycler_" nella la cartella fileadmin/. Ciò aiuta a liberare spazio nel file system.

# executeSchedulableCommandTask.name
source: Execute console commands
ar: تنفيذ أوامر وحدة التحكم
fr: Exécuter les commandes de console
it: Esegui comandi da console

# executeSchedulableCommandTask.description
source: Allows regular console commands to be configured and executed through the scheduler framework.
ar: تسمح هذه الإضافة بتكوين وتنفيذ الأوامر النصية العادية عبر إطار الجدولة (الجدول الزمني).
fr: Autorise les commandes CommandController Extbase à être configurées et exécutées via le planificateur de tâche.
it: Consente ai comandi da console della console di essere configurati ed eseguiti attraverso il framework dello scheduler.

# optimizeDatabaseTable.name
source: Optimize MySQL database tables
ar: تحسين جداول قاعدة البيانات MySQL
fr: Optimiser les tables de la base de données MySQL
it: Ottimizza le tabelle del database MYSQL

# optimizeDatabaseTable.description
source: This task executes "OPTIMIZE TABLE" statements on the selected database tables. This helps to reduce storage space and improve I/O efficiency. Warning! Tables will be locked during the optimization process.
ar: تقوم هذه المهمة بتنفيذ عبارات "OPTIMIZE TABLE" على جداول قواعد البيانات المُحددة. يساعد ذلك في تقليل مساحة التخزين وتحسين كفاءة الإدخال/الإخراج. تحذير! سيتم قفل الجداول أثناء عملية الأمان.
fr: Cette tâche exécute des instructions "OPTIMIZE TABLE" sur les tables choisies de la base de données. Cela permet de réduire l'espace de stockage et d'améliorer l'efficacité des E/S. Attention ! Les tables seront verrouillées pendant le processus d'optimisation.
it: Questa attività esegue l'istruzione "OPTIMIZE TABLE" sulle tabelle del database selezionate. Questo aiuta a ridurre lo spazio di archiviazione e a migliorare l'efficienza di I/O. Attenzione: le tabelle saranno bloccate durante il processo di ottimizzazione!.

# ipAnonymization.name
source: Anonymize IP addresses in database tables
ar: عدم تتبع عناوين IP في جداول قاعدة البيانات
fr: Anonymiser les adresses IP dans les tables de base de données
it: Anonimizza gli indirizzi IP nelle tabelle del database

# ipAnonymization.description
source: This task anonymizes the IP addresses to enforce the privacy of the persisted data.
ar: تقوم هذه المهمة بتجهيز عناوين IP لإلغاء تعريفها لضمان خصوصية البيانات المُخزنة.
fr: Cette tâche anonymise les adresses IP pour assurer la confidentialité des données enregistrées.
it: Questa attività anonimizza gli indirizzi IP per far rispettare la privacy.

# label.ipAnonymization.table
source: Table to anonymize
ar: جدول لإخفاء الهوية
fr: Table à anonymiser
it: Tabella da anonimizzare

# label.ipAnonymization.additionalInformationTable
source: Table: %s after %s days
ar: الجدول: %s بعد %s أيام
fr: Table : %s après %s jours
it: Tabella: %s dopo %s giorni

# label.ipAnonymization.additionalInformationAllTables
source: All tables
ar: جميع الجداول
fr: Toutes les tables
it: Tutte le tabelle

# label.ipAnonymization.numberOfDays
source: Handle entries older than given number of days
ar: التعامل مع الإدخالات القديمة التي يزيد عمرها عن عدد الأيام المعطى
fr: Traiter les entrées plus anciennes que le nombre de jours donné
it: Gestisci voci più vecchie di un numero di giorni

# label.ipAnonymization.mask
source: Mask level
ar: مستوى القناع
fr: Niveau du masque
it: Livello di mascheramento

# label.ipAnonymization.mask.1
source: Last byte for IPv4 / Interface ID for IPv6
ar: آخر بايت لـ IPv4 / معرف الواجهة لـ IPv6
fr: Dernier octet pour IPv4 / Interface ID pour IPv6
it: Ultimo byte per IPv4 / ID interfaccia per IPv6

# label.ipAnonymization.mask.2
source: Last 2 bytes for IPv4 / Interface & SLA ID for IPv6
ar: آخر 2 بايت لـ IPv4 / الواجهة & SLA ID لـ IPv6
fr: Les 2 derniers octets pour IPv4 / Interface & ID SLA pour IPv6
it: Ultimi 2 byte per IPv4 / Interfaccia e ID SLA per IPv6

# command.example1
source: Every day-of-week from Monday through Friday at 09:00 and 15:00
ar: كل يوم من الأسبوع، من يوم الإثنين حتى يوم الجمعة الساعة 09:00 والساعة 15:00
fr: Chaque jour de la semaine du lundi au vendredi, à 09h00 et 15h00
it: Ogni giorno della settimana dal lunedì al venerdì alle 09:00 e alle 15:00

# command.example2
source: Every 2 hours
ar: كل ساعتين
fr: Toutes les 2 heures
it: Ogni 2 ore

# command.example3
source: Every 20 minutes
ar: كل 20 دقيقة
fr: Toutes les 20 minutes
it: Ogni 20 minuti

# command.example4
source: Every Tuesday at 07:00
ar: كل يوم ثلاثاء الساعة 07:00
fr: Tous les mardis à 07h00
it: Ogni martedì alle 07:00

# systemmessage.noLastRun
source: It seems the Scheduler has never yet run. Please check your <a href="%1$s">configuration</a>.
ar: يبدو أن المُجَدول لم يعمل بعد. يُرجى التحقق من <a href="%1$s">التكوين</a> الخاص بك.
fr: Il semble que le planificateur n'a jamais encore fonctionné. Veuillez vérifier votre <a href="%1$s">configuration</a>.
it: Sembra che lo Scheduler non sia mai stato eseguito. Controlla la tua <a href="%1$s">configurazione</a>.

# systeminformation.lastRunLabel
source: Last Scheduler run
ar: آخر تشغيل للمُجدول
fr: Dernière exécution du planificateur
it: Ultima esecuzione dello Scheduler

# systeminformation.lastRunValue
source: %1$s at %2$s, Duration %3$s, (started %4$s)
ar: %1$s في %2$s، المدة %3$s، (بدأت %4$s)
fr: %1$s à %2$s, Durée %3$s, (commencé %4$s)
it: %1$s a %2$s, Durata %3$s, (iniziato %4$s)

# group.notification.error.title
source: Error
ar: خطأ
fr: Erreur
it: Errore

# group.notification.error.message
source: Could not create group
ar: تعذّر إنشاء المجموعة
fr: Impossible de créer le groupe
it: Impossibile creare il gruppo

# scheduler.form.palettes.general
source: General
ar: عام
fr: Général
it: Generale

# scheduler.form.palettes.settings
source: Settings
ar: الإعدادات
fr: Paramètres
it: Impostazioni

# scheduler.form.palettes.timing
source: Timing
ar: التوقيت
fr: Minutage
it: Temporizzazione

# editableGroupName.input.field.label
source: Enter a group name
ar: أدخل اسماً للمجموعة
fr: Saisissez un nom de groupe
it: Inserisci un nome per il gruppo

# editableGroupName.button.edit.label
source: Edit group name
ar: تعديل اسم المجموعة
fr: Modifier le nom du groupe
it: Modifica il nome del gruppo
