Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/scheduler/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

# button.cancel
source: Cancel
ar: إلغاء
fr: Annuler
it: Annulla

# button.group.modalOk
source: Create group
ar: إنشاء مجموعة
fr: Créer un groupe
it: Crea gruppo

# function.scheduler
source: Scheduled tasks
ar: المهام المُجدوَلة
fr: Tâches planifiées
it: Attività pianificate

# function.check
source: Scheduler setup check
ar: فحص إعدادات المُجدوَلة
fr: Vérification de la configuration du planificateur
it: Verifica della configurazione dello scheduler

# function.info
source: Available scheduler commands & tasks
ar: أوامر المهام المُجدولة المُتاحة &
fr: Commandes & tâches du planificateur disponibles
it: Comandi disponibili per lo scheduler e attività

# function.edit
source: Edit scheduled task "%s"
ar: تعديل المهمة المُجدولة"%s"
fr: Modifier la tâche planifiée "%s"
it: Modifica attività pianificata "%s"

# function.add
source: New task
ar: مَهمّة جديدة
fr: Nouvelle tâche
it: Nuova attività

# function.group.add
source: New group
ar: مجموعة جديدة
fr: Nouveau groupe
it: Nuovo gruppo

# function.group.label
source: Group name
ar: اسم المجموعة
fr: Nom du groupe
it: Nome

# hdg.cliScript
source: CLI script
fr: Script CLI
it: Script CLI

# hdg.composerMode
source: System is running in Composer Mode
ar: النظام قيد التشغيل في وضع Composer
fr: Le système fonctionne en mode Composer
it: Il sistema è in esecuzione in Modalità Composer

# msg.composerMode
source: The system is running in composer mode, the path to the `typo3` executable could not be reliably determined. By default, the command to run in composer mode is `vendor/bin/typo3 scheduler:run`.
ar: يعمل النظام في وضع Composer، ولا يمكن تحديد المسار المؤدي إلى 'TYPO3` بطريقة موثوقة. بشكل افتراضي، لتشغيله الأمر في وضع Composer هو 'vendor/bin/typo3 scheduler:run`.
fr: Le système fonctionne en mode Composer, le chemin vers l'exécutable `typo3` n'a pas pu être déterminé de manière fiable. Par défaut, la commande à exécuter en mode composer est `vendor/bin/typo3 scheduler:run`.
it: Il sistema è in esecuzione in Modalità Composer, il percorso dell'eseguibile 'typo3' non può essere determinato in modo affidabile. Per default, il comando da eseguire in Modalità Composer è 'vendor/bin/typo3 scheduler:run'.

# hdg.lastRun
source: Last run
ar: آخر تشغيل
fr: Dernier lancement
it: Ultima esecuzione

# availableCommands.headline
source: Available commands
ar: الأوامـر المـتوفرة
fr: Commandes disponibles
it: Comandi disponibili

# availableCommands.description
source: List of all available commands in this TYPO3 installation.
ar: قائمة بجميع الأوامر المُتاحة في تثبيت TYPO3.
fr: Liste de toutes les commandes disponibles dans cette installation de TYPO3.
it: Lista di tutti i comandi disponibili in questa installazione TYPO3.

# availableCommands.noCommandsDefined
source: There are currently no commands available at all.
ar: لا توجد حالياً أيّة أوامر مُتاحة على الإطلاق.
fr: Il n'y a actuellement aucune commande disponible.
it: Al momento non ci sono attività disponibili.

# availableTasks.headline
source: Available tasks
ar: المَهام المُتوفرة
fr: Tâches disponibles
it: Attività disponibili

# availableTasks.description
source: List of all available tasks in this TYPO3 installation.
ar: قائمة بجميع المَهام المُتاحة في تثبيت TYPO3.
fr: Liste de toutes les tâches disponibles dans cette installation de TYPO3.
it: Lista di tutte le attività disponibili in questa installazione TYPO3.

# label.automatically
source: automatically
ar: تلقائياً
fr: automatiquement
it: automaticamente

# label.cachingFrameworkGarbageCollection.selectBackends
source: Backend types
ar: أنواع الواجهة الخلفية
fr: Type de backend
it: Tipi di backend

# label.recyclerGarbageCollection.numberOfDays
source: Number of days until removing files
ar: عدد الأيام المُتبقية حتى إزالة الملفات
fr: Nombre de jours avant la suppression des fichiers
it: Numero di giorni prima della rimozione dei file

# label.checkAll
source: Check/uncheck all
ar: تحديد/إلغاء تحديد الكل
fr: Cocher/décocher tout
it: Seleziona/deseleziona tutto

# label.class
source: Task
ar: المهمة
fr: Tâche
it: Attività

# label.defType
source: Definition type
ar: نوع التعريف
fr: Définition du type
it: Tipo di definizione

# label.defType.interval
source: Interval
ar: فترة
fr: Intervalle
it: Intervallo

# label.defType.cron
source: Cron command
fr: Commande Cron
it: Comando cron

# label.description
source: Description
ar: الوَصف
it: Descrizione

# label.end
source: End (HH:MM DD-MM-YYYY)
ar: النهاية (HH:MM DD-MM-YYYY)
fr: Fin (HH:MM DD-MM-YYYY)
it: Fine (HH:MM GG-MM-AAAA)

# label.executeSelected
source: Execute
ar: تنفيذ
fr: Exécuter
it: Esegui

# label.cronjobSelected
source: Execute on next cron job
ar: التنفيذ في وظيفة Cron التالية
fr: Exécuter avec la prochaine tâche cron
it: Esegui il prossimo job-cron

# label.extension
source: Extension
ar: الإضافة
it: Estensione

# label.frequency
source: Frequency
ar: التردّد
fr: Fréquence
it: Frequenza

# label.frequency.long
source: Frequency (seconds or cron command)
ar: التردد (ثوان أو أمر cron)
fr: Fréquence (en secondes ou syntaxe cron)
it: Frequenza (secondi o comando cron)

# label.lastExecution
source: Last Execution
ar: آخر إجراء
fr: Dernière exécution
it: Ultima esecuzione

# label.manual
source: Manual
ar: الدليل
fr: Manuel
it: Manuale

# label.manually
source: manually
ar: يدَويّاً
fr: Manuellement
it: manualmente

# label.name
source: Name
ar: الاسم
fr: Nom
it: Nome

# label.nextExecution
source: Next Execution
ar: الإجراء التالي
fr: Prochaine exécution
it: Prossima Esecuzione

# label.parallel
source: Parallel Execution
ar: الإجراء المُوازي
fr: Exécution parallèle
it: Esecuzione Parallela

# label.parallel.long
source: Allow Parallel Execution
ar: السماح بالإجراء المُوازي
fr: Autoriser les exécutions en parallèle
it: Consenti Esecuzione Parallela

# label.serverTime
source: Server time
ar: وقت الخادم
fr: Date du serveur
it: Ora del server

# label.sleepTime
source: Sleep time
ar: وقت السكون
fr: Durée du sommeil
it: Tempo di inattività

# label.start
source: Start (HH:MM DD-MM-YYYY)
ar: البدء (HH:MM DD-MM-YYYY)
fr: Début (HH:MM DD-MM-YYYY)
it: Inizio (HH:MM GG-MM-AAAA)

# label.fileStorageIndexing.storage
source: Storage to index
ar: التخزين للفهرسة
fr: Stockage à indexer
it: Memorizza nell'indice

# label.fileStorageExtraction.fileCount
source: Number of files per run
ar: عدد الملفات لكل تشغيل
fr: Nombre de fichiers par exécution
it: Numero di file per esecuzione

# label.fileStorageExtraction.registeredExtractors
source: Registered extractors
ar: المُستَخرجَات المُسجلة
fr: Extracteurs enregistrés
it: Estrattori registrati

# label.fileStorageExtraction.registeredExtractors.extractor
source: %1$s with priority %2$d
ar: %1$s مع الأولوية %2$d
fr: %1$s avec une priorité de %2$d
it: %1$s con priorità %2$d

# label.fileStorageExtraction.registeredExtractors.with_extractors
source: Following extractors have been registered and will be used when running this task
ar: تم تسجيل المُستخرجات التالية وسيتم استخدامها عند تشغيل هذه المهمة
fr: Les extracteurs suivants ont été enregistrés et seront utilisés lors de l'exécution de cette tâche
it: I seguenti estrattori sono stati registrati e saranno utilizzati durante l'esecuzione di questa attività

# label.fileStorageExtraction.registeredExtractors.without_extractors
source: There currently is no extractor registered. This task will have no effect!
ar: لا يوجد حاليًا أي مُستَخرَج مُسجل. لن يكون لهذه المهمة أي تأثير!
fr: Il n'y a actuellement aucun extracteur enregistré. Cette tâche n'aura aucun effet !
it: Al momento non c'è nessun estrattore registrato. Questa attività non avrà effetto!

# label.tableGarbageCollection.allTables
source: Clean all available tables
ar: تنظيف جميع الجداول المتاحة
fr: Nettoyer toutes les tables disponibles
it: Svuota tutte le tabelle

# label.tableGarbageCollection.table
source: Table to clean up
ar: جدول للتنظيف
fr: Table à nettoyer
it: Tabella da svuotare

# label.tableGarbageCollection.additionalInformationTable
source: Table: %s
ar: الجدول: %s
it: Tabella: %s

# label.tableGarbageCollection.additionalInformationAllTables
source: All tables
ar: جميع الجداول
fr: Toutes les tables
it: Tutte le tabelle

# label.tableGarbageCollection.numberOfDays
source: Delete entries older than given number of days
ar: حذف الإدخالات القديمة التي يزيد عمرها عن عدد الأيام المعطى
fr: Supprimer les entrées plus anciennes que le nombre de jours donné
it: Elimina voci più vecchie di un dato numero di giorni

# label.optimizeDatabaseTables.selectTables
source: Database tables
ar: جداول قاعدة البيانات
fr: Tables de la base de données
it: Tabelle del database

# label.status
source: Status
ar: الحالة
fr: Statut
it: Stato

# label.type
source: Type
ar: النوع
it: Tipo

# label.type.recurring
source: Recurring
ar: مُتكرّر
fr: Récurrent
it: Ricorrente

# label.type.single
source: Single
ar: فردي
fr: Unique
it: Singola

# label.group
source: Task group
ar: مجموعة المهمة
fr: Groupe de tâches
it: Gruppo di attività

# label.group.taskCount
source: Amount of tasks in this scheduler task group
ar: عدد المهام في مجموعة مهام المجدول
fr: Nombre de tâches dans ce groupe de tâches planifiées
it: Numero di attività in questo gruppo di attività dello scheduler

# label.group.taskUnusedCount
source: Amount of unused task groups
ar: كمية مجموعات المهام غير المستخدمة
fr: Nombre de groupes de tâches inutilisés
it: Quantità di gruppi di attività inutilizzati

# label.noGroup
source: Not assigned to any task group
ar: غير مُسند إلى أي مجموعة مهمة
fr: Assignée à aucun groupe de tâches
it: Non assegnato a nessun gruppo di attività

# label.noGroup.taskCount
source: Amount of tasks that are not assigned to any scheduler task group
ar: عدد المَهام التي لم يتم تعيينها لأي مجموعة مهام مجدولة
fr: Nombre de tâches qui ne sont affectées à aucun groupe de tâches planifiées
it: Numero di attività che non sono assegnate a nessun gruppo di attività dello scheduler

# label.group.isDisabled
source: disabled
ar: مُعطّل
fr: désactivé
it: disabilitato

# label.noGroup
source: Unused task groups
ar: مجموعات المهام غير المُستخدمة
fr: Groupes de tâches inutilisés
it: Gruppi di attività inutilizzati

# label.noGroup
source: Group
ar: المجموعة
fr: Groupe
it: Gruppo

# label.noGroup
source: Enable group
ar: تفعيل المجموعة
fr: Activer le groupe
it: Abilita gruppo

# label.noGroup
source: Disable group
ar: تعطيل المجموعة
fr: Désactiver le groupe
it: Disabilita gruppo

# label.noGroup
source: Edit group
ar: تعديل المجموعة
fr: Modifier le groupe
it: Modifica gruppo

# label.errorClass
source: Broken tasks
ar: المهام العاطلة
fr: Tâches erronées
it: Attività interrotte

# label.errorClass.taskCount
source: Amount of broken tasks
ar: عدد المَهام العاطلة
fr: Nombre de tâches erronées
it: Numero di attività interrotte

# label.schedulableCommandName
source: Schedulable Command. Save and reopen to define command arguments
ar: الأمر القابل للجَدوَلة. حفظ وإعادة فتح لتعريف وسيطات الأمر
fr: Commande planifiable. Enregistrez et rouvrez pour définir les arguments de la commande
it: Comando Pianificabile. Salva e riapri per definire gli argomenti del comando

# label.saveAndCreateNewTask
source: Save and create new task
ar: حفظ وإنشاء مهمة جديدة
fr: Enregistrer et créer une nouvelle tâche
it: Salva e crea una nuova attività

# label.addOptionToCommand
source: Add option
ar: إضافة خيار
fr: Nouvelle option
it: Aggiungi opzione

# msg.addSuccess
source: The task was added successfully.
ar: تمت إضافة المهمة بنجاح.
fr: La tâche a été ajoutée avec succès.
it: L'attività è stata aggiunta con successo.

# msg.cliScript
source: The script to execute the Scheduler from the command line is: <strong>"%s scheduler:run"</strong>.
ar: البرنامج النص الذي يُستخدم لتشغيل الجدولة الزمنية من سطر الأوامر هو: <strong>"%s scheduler:run"</strong>.
fr: Le script pour exécuter le planificateur en ligne de commande est : <strong>"%s scheduler:run"</strong>.
it: Lo script per eseguire lo Scheduler dalla riga di comando è: <strong>"%s scheduler:run"</strong>.

# msg.cliScriptExecutable
source: The webserver user is allowed execute this script.
ar: يسمح لمستخدم خادم الويب بتنفيذ هذا البرنامج النصي.
fr: L'utilisateur du serveur web est autorisé à exécuter ce script.
it: L'utente del server web è autorizzato a eseguire questo script.

# msg.cliScriptNotExecutable
source: The webserver user is not allowed to execute this script.
ar: لا يسمح لمستخدم خادم الويب بتنفيذ هذا البرنامج النصي.
fr: L'utilisateur du serveur web n'est pas autorisé à exécuter ce script.
it: L'utente del server web non è autorizzato a eseguire questo script.

# msg.delete
source: Are you sure you want to delete this task?
ar: هل أنت متأكد من أنك تريد حذف هذه المَهمة؟
fr: Êtes-vous certain de vouloir supprimer cette tâche ?
it: Sei sicuro di voler eliminare questa attività?

# msg.deleteError
source: The task could not be deleted.
ar: لا يُمكن حذف المَهمة.
fr: La tâche n'a pas pu être supprimée.
it: L'attività non può essere eliminata.

# msg.deleteSuccess
source: The task was successfully deleted.
ar: تم حذف المهمة بنجاح.
fr: La tâche a été supprimée avec succès.
it: L'attività è stata eliminata con successo.

# msg.endDateSmallerThanStartDate
source: The end date is before the start date.
ar: تاريخ الانتهاء قبل تاريخ البدء.
fr: La date de fin est avant la date de début.
it: La data di fine è prima della data di inizio.

# msg.executed
source: Task "%s" with uid "%s" has been executed.
ar: المهمة "%s" مع معرف "%s" قد تم تنفيذها.
fr: La tâche "%s" avec l'uid "%s" a été exécutée.
it: L'attività "%s" con uid "%s" è stata eseguita.

# msg.frequencyError
source: Invalid frequency. Please enter either a number of seconds or a valid cron command. The cron parser said: %1$s [code: %2$d].
ar: تردد غير صالح. يرجى إدخال عدد من الثواني أو أمر cron صالح. قال مُحلل cron: %1$s [code: %2$d].
fr: Fréquence invalide. Veuillez entrer soit un nombre de secondes soit une commande cron valide. L'analyseur cron a dit: %1$s [code: %2$d].
it: Frequenza non valida. Inserisci un numero di secondi oppure un comando cron valido. Notifica cron: %1$s [codice: %2$d].

# msg.incompleteLastRun
source: The information about the last execution of the Scheduler is incomplete.
ar: المعلومات حول آخر تنفيذ لجدول المهام غير المُكتملة.
fr: L'information à propos de la dernière exécution du planificateur est incomplète.
it: Le informazioni riguardo l'ultima esecuzione dello Scheduler sono incomplete.

# msg.invalidFrequency
source: Invalid frequency. Please enter either a number of seconds or a valid cron command.
ar: تردد غير صالح. يرجى إدخال عدد من الثواني أو أمر cron صالح.
fr: Fréquence invalide. Veuillez entrer un nombre de secondes ou une commande cron valide.
it: Frequenza non valida. Per favore inserisci un numero di secondi o un comando cron valido.

# msg.invalidSleepTime
source: Please enter a sleep time greater or equal to 0 (zero).
ar: الرجاء إدخال وقت سُكون أكبر أو يساوي 0 (صفر).
fr: Veuillez entrer une durée de sommeil supérieure ou égale à 0 (zéro).
it: Inserisci un periodo di inattività maggiore o uguale a 0 (zero).

# msg.lastRun
source: The Scheduler was last started (%1$s) on %2$s at %3$s and ended on %4$s at %5$s.
ar: آخر مرة بدأ فيها المجدول (%1$s) على %2$s في %3$s وانتهى على %4$s في %5$s.
fr: Le planificateur a été démarré pour la dernière fois (%1$s) le %2$s à %3$s et s'est terminé le %4$s à %5$s.
it: Lo Scheduler è stato lanciato l'ultima volta (%1$s) il %2$s alle %3$s ed è stato fermato il %4$s alle %5$s.

# msg.canNotDeleteRunningTask
source: A running task may not be deleted.
ar: قد لا يتم حذف مَهمة قيد التشغيل.
fr: Une tâche en cours d'exécution ne peut pas être supprimée.
it: Un'attività in esecuzione non può essere eliminata.

# msg.maynotEditRunningTask
source: A running task may not be edited.
ar: قد لا يتم تعديل مَهمة قيد التشغيل.
fr: Une tâche en cours d'exécution ne peut pas être éditée.
it: Un'attività in esecuzione non può essere modificata.

# msg.maynotStopNonRunningTask
source: The task is not running. There are no executions to unmark.
ar: المهمة ليست قيد التشغيل. لا توجد عمليات تنفيذ لإلغاء تحديدها.
fr: La tâche n'est pas en cours d'exécution. Il n'y a aucune exécution à marquer.
it: L'attività non è in esecuzione. Non ci sono esecuzioni da disabilitare.

# msg.noEmail
source: Please enter an email address.
ar: الرجاء إدخال عنوان بريد إلكتروني.
fr: Veuillez entrer une adresse e-mail.
it: Per favore inserisci un indirizzo email.

# msg.noFrequency
source: No frequency was defined, either as an interval or as a cron command.
ar: ولم يتم تعريف أي تردد، سواء كفترة زمنية أو كأمر cron.
fr: La fréquence n'a pas été définie, ni en nombre de secondes, ni comme commande cron.
it: Non è stata definita una frequenza, né come intervallo né come comando cron.

# msg.noLastRun
source: The Scheduler has never yet run or the information about the last run has been lost.
ar: لم يتم تشغيل المُجَدول بعد أو تم فقدان معلومات آخر تشغيل.
fr: Le planificateur n'a jamais été exécuté ou l'information concernant la dernière exécution a été perdue.
it: Lo scheduler non è ancora stato eseguito oppure le informazioni sull'ultima esecuzione non sono disponibili.

# msg.noTasksDefined
source: There are currently no task classes available at all. To be able to create new tasks, you must either enable the samples provided by the Scheduler or install some other extension that relies on the Scheduler.
ar: لا توجد حالياً فئات مَهام مُتاحة على الإطلاق. لكي تتمكن من إنشاء مَهام جديدة، يجب عليك إما تفعيل النماذج العينية المُقدمة من المجدول أو تثبيت بعض الإضافات الأخرى التي تعتمد على المجدول.
fr: Il n'y a actuellement aucune classe de tâches disponible. Pour pouvoir créer une nouvelle tâche, vous devez soit activer les tâches d'exemples fournies avec le planificateur ou installer des extensions qui utilisent le planificateur.
it: Al momento non ci sono classi di attività disponibili. Per poter creare nuove attività, è necessario, perlomeno, abilitare gli esempi forniti dall'estensione dello Scheduler o installare qualche altra estensione che si basa sullo Scheduler.

# msg.noTaskClassFound
source: The selected task class could not be found. You should probably contact the task's developers.
ar: تعذر العثور على فئة المَهام المحددة. ربما يجب عليك الاتصال بمُطَوِري المهمة.
fr: La classe de la tâche sélectionnée n'a pas été trouvée. Veuillez contacter les développeurs de l'extension ayant ajouté cette tâche.
it: Impossibile trovare la classe di attività selezionata. Probabilmente dovresti contattare gli sviluppatori dell'attività.

# msg.invalidTaskType
source: The selected task type must be either "single execution" or "recurring execution".
ar: نوع المهمة المُحدد يجب أن يكون إما "إجراء واحد" أو "إجراء متكرر".
fr: Le type de tâche sélectionné doit être soit "une seule exécution" soit "une exécution récurrente".
it: Il Tipo di attività selezionato deve essere "singola" o "ricorrente".

# msg.noTasks
source: No tasks defined yet.
ar: لا توجد مهام مُحددة حتى الآن.
fr: Aucune tâche n'est définie.
it: Non è stata ancora definita alcuna attività.

# msg.notExecuted
source: Task "%s" with uid "%s" has not been executed.
ar: المهمة "%s" مع معرف "%s" لم يتم تنفيذها.
fr: La tâche "%s" avec l'uid "%s" n'a pas été exécutée.
it: L'attività "%s" con uid "%s" non è stata eseguita.

# msg.executionFailed
source: Execution of task "%1$s" failed with the following message: %2$s
ar: فشل تنفيذ المهمة "%1$s" في الرسالة التالية: %2$s
fr: L'exécution de la tâche "%1$s" a échoué avec le message suivant : %2$s
it: L'esecuzione dell'attività "%1$s" è fallita con il seguente messaggio: %2$s

# msg.schedulingFailed
source: Scheduling of task "%1$s" failed with the following message: %2$s
ar: فشل جدولة المهمة "%1$s" في الرسالة التالية: %2$s
fr: La planification de la tâche "%1$s" a échoué avec le message suivant : %2$s
it: La pianificazione dell'attività "%1$s" è fallita con il seguente messaggio: %2$s

# msg.toggleDisableFailed
source: Toggling disabled state of task "%1$s" failed with the following message: %2$s
ar: فشل تبديل حالة تعطيل المهمة "%1$s" مع الرسالة التالية: %2$s
fr: La désactivation de la tâche "%1$s" a échoué avec le message suivant : %2$s
it: La riabilitazione dell'attività "%1$s" è fallita con il seguente messaggio: %2$s

# msg.stopTaskFailed
source: Stopping task "%1$s" failed with the following message: %2$s
ar: فشل إيقاف المهمة "%1$s" مع الرسالة التالية: %2$s
fr: L'arrêt de la tâche "%1$s" a échoué avec le message suivant : %2$s
it: L'arresto dell'attività "%1$s" è fallito con il seguente messaggio: %2$s

# msg.executionFailureDefault
source: The execution failed, but the error message could not be retrieved (it was probably too large). Sorry.
ar: فشل التنفيذ، ولكن تعذر استرداد رسالة الخطأ (ربما كانت كبيرة جداً). عُذراً.
fr: L'exécution a échoué, mais le message d'erreur ne peut pas être récupéré (il était probablement trop grand). Désolé.
it: L'esecuzione non è riuscita, ma il messaggio di errore non può essere recuperato (probabilmente era troppo grande). Mi dispiace.

# msg.executionFailureReport
source: Execution failed: %1$d, %2$s
ar: فشل التنفيذ: %1$d, %2$s
fr: L'exécution a échoué : %1$d, %2$s
it: Esecuzione fallita: %1$d, %2$s

# msg.noStartDate
source: Please define a start date.
ar: الرجاء تحديد تاريخ البدء.
fr: Veuillez définir une date de lancement.
it: Per favore definisci la data d'inizio.

# msg.invalidStartDate
source: Start date is invalid.
ar: تاريخ البدء غير صالح.
fr: La date de lancement est invalide
it: La data d'inizio non è valida.

# msg.invalidEndDate
source: End date is invalid.
ar: تاريخ النهاية غير صالح.
fr: La date d'arrêt est invalide
it: La data di fine non è valida.

# msg.invalidNumberOfDays
source: Number of days is invalid.
ar: عدد الأيام غير صالح.
fr: Nombre de jours invalide
it: Il numero di giorni non è valido.

# msg.selectionOfNonExistingCacheBackends
source: Some of the selected cache backends do not exist. Please select valid backends only.
ar: بعض خوادم التخزين المؤقت المحددة غير موجودة. يُرجى اختيار خوادم صالحة فقط.
fr: Certains des caches backend sélectionnés n’existent pas. Sélectionnez un backend valide.
it: Alcuni backend della cache selezionati non esistono. Seleziona solo backend validi.

# msg.noCacheBackendSelected
source: Please select at least one cache backend.
ar: الرجاء تحديد ذاكرة تخزين مؤقتة واحدة على الأقل للواجهة الخلفية.
fr: Sélectionner au moins un cache backend.
it: Seleziona almeno un backend della cache.
