Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/scheduler/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

# label.email
source: Email
ar: البريد الإلكتروني
