Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/scheduler/Resources/Private/Language/*.locallang_csh_scheduler.xlf
Languages: ar, fr, it

# .alttitle
source: Scheduler
ar: المُجدوَل
fr: Planificateur

# .description
source: The Scheduler provides an interface to register and manage recurring or one-time tasks.
ar: مُجَدول المهام يوفر واجهة لتسجيل وإدارة المهام المتكررة أو لمرة واحدة.
fr: Le planificateur fournit une interface permettant d'enregistrer et de gérer les tâches récurrentes ou uniques.
it: Lo Scheduler fornisce un'interfaccia per registrare e gestire le attività ricorrenti o una eseguite un volta sola.

# .syntax
source: The Scheduler uses a single cron job to handle all registered tasks. It is thus very convenient as only one cron job needs to be set up and all task frequencies can be managed from the BE module.
ar: الجدولة الزمنية يستخدم وظيفة cron واحدة للتعامل مع جميع المهام المسجلة. وبذلك، فإنه يوفر سهولة كبيرة حيث يكفي إعداد وظيفة cron واحدة فقط، ويمكن إدارة ترددات جميع المهام من وحدة التحكم في الواجهة الخلفية.
fr: Le planificateur utilise un job cron unique qui gère toutes les tâches enregistrée. Il est donc très pratique car une seule tâche cron doit être mise en place et toutes les fréquences d’exécutions peuvent être gérées à partir du module backend.
it: Lo Scheduler utilizza un singolo job-cron per gestire tutte le attività registrate. È quindi molto conveniente in quanto è necessario impostare un solo job-cron e tutte le frequenze di esecuzione delle attività possono essere gestite dal modulo di backend.

# task_class.alttitle
source: Class of the task
ar: فئة المهمة
fr: Classe de la tâche
it: Classe dell'attività

# task_class.description
source: Choose a class from the list of available tasks
ar: اختر فئة من قائمة المهام المُتاحة
fr: Choisissez une classe à partir de la liste des tâches disponibles
it: Scegli una classe dalla lista delle attività disponibili

# task_class.details
source: Some tasks are provided by the TYPO3 Core itself. Others come from extensions. See the manual to learn how to create your own tasks and register them with the Scheduler.
ar: يتم توفير بعض المهام بواسطة TYPO3 Core نفسها. يأتي البعض الآخر من الإضافات. راجع الدليل لمعرفة كيفية إنشاء المَهام الخاصة بك وتسجيلها في المُجدول.
fr: Les tâches sont fournies par diverses extensions. Si vous souhaitez créer vos propres tâches et les enregistrer auprès du planificateur, veuillez lire le manuel.
it: Alcune attività sono fornite direttamente da TYPO3. Altre provengono da estensioni. Vedi il manuale per imparare a creare le tue attività e registrarle con lo Scheduler.

# task_disable.alttitle
source: Disable task
ar: تعطيل المهمة
fr: Désactive la tâche
it: Disabilita attività

# task_disable.description
source: Check this box to disable the automatic, scheduled execution of this task. It can still be launched manually from the BE module.
ar: حدد هذا المربع لتعطيل التنفيذ التلقائي المُجَدوَل لهذه المهمة. لا يزال من الممكن إطلاقه يدويًا من وحدة BE.
fr: Cochez cette case pour désactiver l'exécution automatique et planifiée de la tâche. Elle pourra toutefois être lancée manuellement par le module d'administration.
it: Spunta per disabilitare l'esecuzione automatica e pianificata di questa attività. Può ancora essere eseguita manualmente dal modulo di backend.

# task_type.alttitle
source: Type of task
ar: نوع المهمة
fr: Type de la tâche
it: Tipo di attività

# task_type.description
source: Choose whether the task must happen a single time or will be repeated
ar: اختر ما إذا كان يجب أن تحدث المهمة مرة واحدة أو أنه سيتم تكرارها
fr: Veuillez choisir si la tâche doit être exécutée une seule fois ou si elle doit être répétée
it: Scegli se l'attività deve avvenire una sola volta o essere ripetuta

# task_start.alttitle
source: Start of task
ar: بداية المهمة
fr: Début de la tâche
it: Inizio dell'attività

# task_start.description
source: Enter a start date and time for the task
ar: أدخل تاريخ ووقت بدء المهمة
fr: Entrez la date et heure de début de la tâche
it: Inserisci data e ora d'inizio dell'attività

# task_start.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone.
ar: يجب إدخال التاريخ بتنسيق قياسي مثل HH: mm dd-mm-YYYY أو YYYY-mm-dd HH: mm. يمكن أيضًا استخدام الكلمات الرئيسية العادية، مثل "الآن" أو "غدًا". يجب أن يتوافق التاريخ والوقت مع المنطقة الزمنية للخادم.
fr: La date doit être saisie dans un forma standard, tel que HH:mm jj-mm-aaaa ou aaaa-mm-jj HH:mm. Des mots-clés tels que "now" ou "tomorrow" peuvent également être utilisés.
it: La data deve essere inserita in un formato standard come HH:mm gg-mm-YYYY o YYYY-mm-gg HH:mm. Si possono usare anche termini come "now" o "tomorrow". Data e ora devono corrispondere al fuso orario del server.

# task_end.alttitle
source: End of task
ar: نهاية المهمة
fr: Fin de la tâche
it: Fine dell'attività

# task_end.description
source: Enter an end date and time for the task, can be blank
ar: أدخل تاريخ ووقت انتهاء المهمة، يمكن أن يبقى فارغاً
fr: Entrez la date et heure de fin de la tâche (peut être vide)
it: Inserisci data e ora di fine attività; può essere vuoto

# task_end.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone. Can be left blank, if task is not supposed to end at any point.
ar: يجب إدخال التاريخ بتنسيق قياسي مثل HH: mm dd-mm-YYYY أو YYYY-mm-dd HH: mm. يمكن أيضًا استخدام الكلمات الرئيسية العادية، مثل "الآن" أو "غدًا". يجب أن يتوافق التاريخ والوقت مع المنطقة الزمنية للخادم. يمكن تركه فارغًا، إذا لم يكن من المفترض أن تنتهي المهمة في أي وقت.
fr: La date doit être entrée dans un format standard comme HH:mm jj-MM-AAAA ou AAAA-MM-JJ HH:mm. Les mots-clés naturels peuvent également être utilisés, comme «maintenant» ou «demain». La date et l'heure doivent correspondre au fuseau horaire du serveur. Peut être laissé vide, si la tâche n'est pas censé se terminer.
it: La data deve essere inserita in un formato standard come HH:mm gg-mm-YYYY o YYYY-mm-gg HH:mm. Si possono usare anche termini come "now" o "tomorrow". Data e ora devono corrispondere al fuso orario del server. Può essere lasciato vuoto, se il compito non dovrebbe terminare in alcun punto.

# task_frequency.alttitle
source: Frequency of task
ar: تكرار المهمة
fr: Fréquence de la tâche
it: Frequenza dell'attività

# task_frequency.description
source: Enter a frequency, either in seconds or using a cron-like syntax (minutes, hours, day of month, months and day of week)
ar: أدخل ترددًا، إما بالثواني أو باستخدام صيغة تشبه cron (دقائق، ساعات، يوم من الشهر، شهور، ويوم من الأسبوع)
fr: Entrez la fréquence, en secondes ou en syntaxe de type cron (minutes, heures, jours du mois, mois et jour de la semaine)
it: Inserisci una frequenza in secondi o usando una sintassi cron (minuti, ore, giorno del mese, mesi e giorno della settimana)

# task_frequency.details
source: The frequency of the task can be simply entered as a number of seconds. Alternatively it is possible to use the same syntax as for cron jobs. This is simply a list of five numbers or the wildcard "*", separated by blanks. The five numbers are (in order) minutes, hours, day of month, months and day of week. Examples: */5 * * * * means every 5 minutes 30 22 * * * means every day at 22:30 The Scheduler supports the full cron syntax.
ar: يمكن إدخال تكرار المهمة ببساطة على هيئة عدد من الثواني. بدلاً من ذلك، من الممكن استخدام نفس الصيغة المُستخدمة في وظائف cron. هذه قائمة من خمسة أرقام أو حرف البدل "*"، مفصولة بفراغات. الأرقام الخمسة (بالترتيب) هي الدقائق والساعات واليوم من الشهر والشهور واليوم من الأسبوع. أمثلة: * / 5 * * * * تعني كل 5 دقائق 30 22 * * * يعني كل يوم الساعة 22:30 يدعم المُجدْول بناء جملة cron الكامل.
fr: La fréquence de la tâche peut être simplement un nombre de seconde. Il est aussi possible d'utiliser la syntaxe utilisée par les jobs cron. C'est une liste de cinq nombres, ou le joker "*", séparés par des espaces. Les cinq nombres sont, dans l'ordre, les minutes, les heures, le jour du mois, le mois et le jour de la semaine. Par exemple : */5 * * * * signifie : toutes les 5 minutes. 30 22 * * * signifie tous les jours à 22h30
it: La frequenza dell'attività può essere semplicemente inserita come un numero di secondi. In alternativa, è possibile utilizzare la stessa sintassi utilizzata per i job-cron. Questo è semplicemente un elenco di cinque interi o il carattere jolly "*", separati da spazi vuoti. I cinque numeri sono, rispettivamente, minuti, ore, giorno del mese, mesi e giorno della settimana. Esempi: */5 * * * * significa ogni 5 minuti 30 22 * * * significa ogni giorno alle 22:30 Lo Scheduler supporta pienamente la sintassi cron.

# task_frequency.seeAlso
source: Wikipedia reference|http://en.wikipedia.org/wiki/Cron
fr: Référence Wikipédia|http://fr.wikipedia.org/wiki/Cron
it: Riferimento Wikipedia | http://en.wikipedia.org/wiki/Cron

# task_multiple.alttitle
source: Multiple executions
ar: إجراءات مُتعددة
fr: Exécutions multiples
it: Esecuzioni multiple

# task_multiple.description
source: Choose whether a task can be running several times simultaneously or not
ar: اختر ما إذا كانت المهمة يمكن تشغيلها عدة مرات مُتزامنة أم لا
fr: Veuillez déterminer si la tâche pourra être exécutée plusieurs fois en parallèle ou non.
it: Scegli se un'attività può essere in esecuzione più volte contemporaneamente oppure no

# task_email.alttitle
source: Email address
ar: عنوان البريد الإلكتروني
fr: Adresse mail
it: Indirizzo email

# task_email.description
source: Enter a recipient for the mails sent by the test task
ar: أدخل مُستلماً لرسائل البريد المُرسلة عن طريق مهمة تجريبية
fr: Veuillez saisir le destinataire des mails encoyés par la tâche test
it: Inserisci un destinatario per le email inviate dall'attività di test

# task_description.alttitle
source: Task description
ar: وَصف المهمة
fr: Description de la tâche
it: Descrizione attività

# task_description.description
source: Enter a description for this task
ar: أدخل وصفاً لهذه المهمة
fr: Entrer une description pour cette tâche
it: Inserisci una descrizione per questa attività

# task_group.alttitle
source: Task group
ar: مجموعة المهمة
fr: Groupe de tâches
it: Gruppo di attività

# task_group.description
source: In case of a high number of different tasks, it may be useful to visually group similar tasks.
ar: في حالة وجود عدد كبير من المهام المُختلفة، قد يكون من المفيد تجميع المهام المتشابهة بصريًا.
fr: Dans le cas d'un nombre élevé de tâches différentes, il peut être utile de grouper visuellement des tâches similaires.
it: In caso di numero elevato di attività diverse, può essere utile raggruppare visivamente attività simili.

# task_sleepTime.alttitle
source: Sleep time
ar: وقت السُكون
fr: Durée du sommeil
it: Pausa

# task_sleepTime.description
source: Enter a number of seconds during which the task will just sleep.
ar: أدخل عدد الثواني التي ستدخل فيها المهمة في حالة السُكون.
fr: Entrez le nombre de secondes pendant lesquelles la tâche sera en sommeil.
it: Inserisci un numero di secondi durante i quali l'attività verrà sospesa.

# task_cachingFrameworkGarbageCollection_selectedBackends.alttitle
source: Select backends
ar: حدد الواجهات الخلفية
fr: Sélectionner un backend
it: Seleziona i backend

# task_cachingFrameworkGarbageCollection_selectedBackends.description
source: If a cache uses one of the selected backends, the garbage collection will be called for this cache.
ar: إذا كانت ذاكرة التخزين المؤقت تستخدم إحدى الواجهات الخلفية المُحددة، فسيتم استدعاء المجموعة المهملة لذاكرة التخزين المؤقت هذه.
fr: Si un cache utilise l'un de ces backends, le ramasse-miette sera appelé.
it: Se una cache utilizza uno dei backend selezionati, la garbage collection verrà eseguita per questa cache.

# task_tableGarbageCollection_numberOfDays.alttitle
source: Number of days
ar: عدد الأيام
fr: Nombre de jours
it: Numero di giorni

# task_tableGarbageCollection_numberOfDays.description
source: Delete rows from selected table that are older than given number of days.
ar: حذف الصفوف من الجدول المُحدد أقدم من عدد الأيام المُحددة.
fr: Supprimer les lignes de la table sélectionnée qui sont plus âgées que le nombre de jours donné.
it: Elimina le righe dalla tabella selezionata che sono più vecchie del numero di giorni dato.

# task_tableGarbageCollection_table.alttitle
source: Select table
ar: حدد الجدول
fr: Sélectionner une table
it: Seleziona tabella

# task_tableGarbageCollection_table.description
source: Select one of the registered tables to be cleaned up with this task.
ar: حدد إحدى الجداول المُسجلة لتنظيفها بواسطة هذه المهمة.
fr: Sélectionnez l'une des tables enregistrées pour être nettoyés avec cette tâche.
it: Selezionare una delle tabelle registrate da pulire con questa attività.

# task_tableGarbageCollection_allTables.alttitle
source: Clean up all tables
ar: تنظيف جميع الجداول
fr: Nettoyez toutes les tables
it: Pulisci tutte le tabelle

# task_tableGarbageCollection_allTables.description
source: If selected, all configured tables are cleaned. The selection below is ignored.
ar: إذا تم تحديده، فسيتم تنظيف جميع الجداول التي تم تكوينها. تم تجاهل التحديد أدناه.
fr: Si elle sont sélectionnées, toutes les tables configurées sont nettoyées. La liste ci-dessous est ignorée.
it: Se selezionato, tutte le tabelle configurate vengono pulite. La selezione qui sotto viene ignorata.

# task_recyclerGarbageCollection_numberOfDays.alttitle
source: Number of days
ar: عدد الأيام
fr: Nombre de jours
it: Numero di giorni

# task_recyclerGarbageCollection_numberOfDays.description
source: Delete files in _recycler_ folders that are older than the given number of days.
ar: احذف الملفات الموجودة في مجلدات _recycler_ الأقدم من عدد الأيام المحدد.
fr: Supprimer les fichiers dans les dossiers _recycler_ plus anciens que le nombre de jours donné.
it: Elimina i file nelle cartelle _recycler_ che sono più vecchi del numero di giorni dato.
