Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/reactions/Resources/Private/Language/*.locallang_db.xlf
Languages: ar, it

source: Reactions
ar: التفاعلات
it: Reazioni

# sys_reaction
source: System Reactions
ar: نظام التفاعلات
it: Reazione

# sys_reaction.name
source: Name
ar: الاسم
it: Nome

# sys_reaction.name.description
source: Meaningful name of the reaction
ar: اسم ذو معنى لِرد الفعل
it: Nome significativo della reazione

# sys_reaction.identifier
source: Identifier
ar: المُعَرِّف
it: Identificativo

# sys_reaction.identifier.description
source: This is your unique reaction identifier within the TYPO3 URL
ar: هذا هو مُعرّف رد الفعل الفريد الخاص بك داخل TYPO3 URL
it: Questo è l'identificativo unico della reazione, presente nell'URL in ingresso.

# sys_reaction.secret
source: Secret
ar: سري
it: Chiave segreta

# sys_reaction.secret.description
source: The secret is required to call the reaction from the outside. The secret can be re-created anytime, but will only be visible once (until the record got saved).
ar: السر مطلوب لاستدعاء رد الفعل من الخارج. يمكن إعادة إنشاء السر في أي وقت، ولكن سيكون مرئياً مرة واحدة فقط (حتى يتم حفظ السجل).
it: La chiave segreta è necessaria per chiamare la reazione dall'esterno. La chiave segreta può essere ricreata in qualsiasi momento, ma sarà visibile solo una volta (fino a quando il record non sarà salvato).

# sys_reaction.secret.passwordGenerator
source: Generate secret token
ar: إنشاء رمز سري
it: Genera una chiave segreta

# sys_reaction.reaction_type
source: Reaction Type
ar: نوع رد الفعل
it: Azione

# sys_reactions.reaction_type.description
source: Select the reaction type to be configured.
ar: حدد نوع التفاعل المُراد تكوينه.
it: Seleziona l'azione da configurare.

# sys_reaction.reaction_type.select
source: Select a reaction
ar: حدد رد فعل
it: Seleziona una azione

# sys_reaction.reaction_type.create_record
source: Create database record
ar: إنشاء سجل قاعدة البيانات
it: Crea record

# sys_reaction.impersonate_user
source: Impersonate User
ar: انتحال شخصية المستخدم
it: Utente Esecutore

# sys_reaction.impersonate_user.description
source: Select the user with the appropriate access rights that is allowed to add a record of this type. If in doubt, use the CLI user.
ar: حدد المستخدم مع حقوق الوصول المناسبة التي يُسمح لها بإضافة سجل من هذا النوع. إذا كان هذا في موضع شك، استخدم مستخدم CLI.
it: Selezionare un utente con i diritti di accesso appropriati per aggiungere un record di questo tipo. In caso di dubbio, utilizzare l'utente CLI.

# sys_reaction.table_name
source: Table
ar: جدول
it: Tabella

# sys_reaction.table_name.description
source: Select one tables to display the corresponding fields.
ar: حدد جدولاً واحداً لعرض الحقول المقابلة.
it: Selezionare una tabella per visualizzare i campi corrispondenti.

# sys_reaction.table_name.select
source: Select a table
ar: حدد جدول
it: Seleziona una tabella

# sys_reaction.storage_pid
source: Storage PID
ar: مكان تخزين PID
it: Pagina di Archiviazione

# sys_reaction.storage_pid.description
source: Select the page on which a new record is created on.
ar: حدد الصفحة التي يتم على أساسها إنشاء سجل جديد.
it: Selezionare la pagina su cui verrà creato il nuovo record.

# sys_reaction.fields
source: Fields
ar: الحقول
it: Campi

# sys_reaction.fields.description
source: The available fields depend on the selected table. The usage of placeholders like ${foo.bar} is possible.
ar: الحقول المتاحة تعتمد على الجدول المحدد. استخدام العناصر النائبة مثل ${foo.bar} ممكن.
it: I campi disponibili dipendono dalla tabella selezionata. È possibile utilizzare segnaposto come ${foo.bar}.

# palette.config
source: Configuration
ar: التكوين
it: Configurazione

# palette.config.description
source: General configuration of the reaction.
ar: الإعدادات العامة للتفاعل.
it: Configurazione generale.

# palette.additional
source: Additional configuration
ar: التكوين الإضافي
it: Dettagli azione

# palette.additional.description
source: Specific configuration for the selected reaction type
ar: تكوين محدد لنوع التفاعل المحدد
it: Configurazione specifica per il tipo di azione

# fieldMapElement.noFields
source: The selected table '%s' does not define any valid fields to be configured.
ar: الجدول المحدد ''%s' لا يحدد أي حقول صالحة لتكوينها.
it: La tabella selezionata '%s' non definisce alcun campo valido da configurare.
