Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/backend/Resources/Private/Language/Modules/*.about.xlf
Languages: ar, it

# mlang_labels_tablabel
source: About TYPO3 CMS
ar: حول TYPO3 CMS
it: Informazioni su TYPO3 CMS

# mlang_labels_tabdescr
source: Displays the basic facts about the TYPO3 application, version and licensing terms.
ar: عرض المعلومات الأساسية عن تطبيق TYPO3 وعن إصداره وشروط ترخيصه.
it: Visualizza le informazioni di base sull'applicazione TYPO3, la versione e le condizioni di licenza.

# mlang_tabs_tab
source: About TYPO3 CMS
ar: حول TYPO3 CMS
it: Informazioni su TYPO3 CMS

# title
source: About TYPO3 CMS
ar: حول TYPO3 CMS
it: Informazioni su TYPO3 CMS

# typo3_logo
source: TYPO3 CMS logo
ar: شعار TYPO3 CMS
it: Logo di TYPO3 CMS

# information
source: TYPO3 Information
ar: معلومات TYPO3
it: Informazioni su TYPO3

# welcome
source: TYPO3 CMS - Professional Web Content Management System
ar: TYPO3 CMS - نظام إدارة المحتوى الاحترافي
it: TYPO3 CMS - Sistema professionale di gestione dei contenuti web

# minor
source: TYPO3 CMS is an enterprise-class, Open Source Content Management System, used internationally to build and manage websites of all types, from small sites for non-profits to multilingual enterprise solutions for large corporations.<br /><br />For further information visit <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS is <b>freely available</b> under the <a href="https://typo3.org/project/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />You are using %s %s
ar: نظام TYPO3 CMS هو نظام إدارة محتوى مفتوح المصدر، يُستخدم دُولياً لِبناء وإدارة مواقع الإنترنت بجميع أنواعها، من المواقع الصغيرة التي لا تستهدف الربح إلى حلول متعددة اللغات للشركات الكبيرة.<br /><br />لمزيد من المعلومات قم بزيارة <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />نظام إدارة المحتوى TYPO3 هو <b>متاح مجاناً</b> بموجب <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">رخصة TYPO3-(GNU/GPL)</a><br /><br />أنت تستخدم %s %s
it: TYPO3 CMS è un Content Management System Open Source di classe enterprise, per la gestione dei contenuti, utilizzato a livello internazionale per costruire e gestire siti web di ogni tipo: da piccoli siti per non-profit a soluzioni multilingue per grandi aziende.<br /><br />Per ulteriori informazioni visita <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS è <b>disponibile gratuitamente</b> sotto la <a href="https://typo3.org/project/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />Stai usando %s %s

# cms_description
source: TYPO3 CMS is an enterprise-class, Open Source Content Management System, used internationally to build and manage websites of all types, from small sites for non-profits to multilingual enterprise solutions for large corporations.<br /><br />For further information visit <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS is <b>freely available</b> under the <a href="https://typo3.org/project/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />You are using version %s - Copyright %s %s
ar: نظام TYPO3 CMS هو نظام إدارة محتوى مفتوح المصدر، يُستخدم دُوليّاُ لبناء وإدارة مواقع الإنترنت بجميع أنواعها، من المواقع الصغيرة التي لا تستهدف الربح إلى حلول متعددة اللغات للشركات الكبيرة.<br /><br />لمزيد من المعلومات يرجى زيارة <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3. rg</a><br /><br />TYPO3 CMS <b>متاح مجانا</b> بموجب <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a><br /><br />أنت تستخدم الإصدار %s - حقوق النشر %s %s
it: TYPO3 CMS è un Content Management System Open Source di classe enterprise, per la gestione dei contenuti, utilizzato a livello internazionale per costruire e gestire siti web di ogni tipo: da piccoli siti per non-profit a soluzioni multilingue per grandi aziende.<br /><br />Per ulteriori informazioni visita <a href="https://typo3.org/typo3-cms/" target="_blank" rel="noreferrer">typo3.org</a>.<br /><br />TYPO3 CMS è <b>disponibile gratuitamente</b> sotto la <a href="https://typo3.org/project/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />Stai usando la versione %s - Copyright %s %s

source: Community Credits
ar: ائتمانات المجتمع
it: Crediti della Comunità

# information_detail
source: Visit <a href="https://typo3.org/community/" target="_blank" rel="noreferrer">typo3.org/community/</a> if you want to know why TYPO3 rocks.
ar: قُم بزيارة <a href="https://typo3.org/community/" target="_blank" rel="noreferrer">typo3.org/community/</a> إذا كنت ترغب بمعرفة سبب اختيار TYPO3
it: Visita <a href="https://typo3.org/community/" target="_blank" rel="noreferrer">typo3.org/community/</a> se vuoi sapere perché TYPO3 spacca.

# coredevs
source: Core Team
ar: الفريق الأساسي
it: Team principale

# coredevs_detail
source: Visit <a href="https://typo3.org/teams-committees/core-development/" target="_blank" rel="noreferrer">typo3.org/teams-committees/core-development/</a> for the complete member list.<br /><br />The Git Repository and the ChangeLog can be found <a href="https://forge.typo3.org/projects/typo3cms-core/" target="_blank">here</a>.
ar: قُم بزيارة <a href="https://typo3.org/teams-committees/core-development/" target="_blank" rel="noreferrer">typo3.org/teams-committees/core-development/</a> لرؤية قائمة جميع الأعضاء.<br /><br />يمكنك العثور على Git وعلى سجل التغييرات <a href="https://forge.typo3.org/projects/typo3cms-core/" target="_blank">هنا</a>.
it: Visita <a href="https://typo3.org/teams-committees/core-development/" target="_blank" rel="noreferrer">typo3.org/teams-committees/core-development/</a> per l'elenco completo dei membri.<br /><br />Il repository Git e il ChangeLog si trovano <a href="https://forge.typo3.org/projects/typo3cms-core/" target="_blank">qui</a>.

source: Extension Authors
ar: مُنْشِئُووا الإضافة
it: Autori dell'estensione

# extension_list_info
source: This is a list of the people who contributed to the extensions you're using in your installation.
ar: هذه قائمة بالأشخاص الذين ساهموا في الإضافات التي تستخدمها في التثبيت الخاص بك.
it: Questo è un elenco delle persone che hanno contribuito alle estensioni che stai usando nella tua installazione.

source: Extension
ar: الإضافة
it: Estensione

# extension_author
source: Author
ar: المُؤلّف
it: Autore

# donation.sectionHeadline
source: TYPO3 Donation and community
ar: TYPO3 التبرع والمجتمع
it: Donazioni e comunità TYPO3

# donation_header
source: TYPO3 Donation
ar: تبرع TYPO3
it: Donazione TYPO3

# donation_message
source: It would be great if you could donate. TYPO3 CMS is Open Source and relies heavily on donations from its users and supporters.<br/><br/><b>Thank you</b> for making this great Content Management System even better with your support!
ar: سيكون من الرائع أن تتمكن من التبرع. TYPO3 CMS هو نظام مفتوح المصدر ويعتمد بشدة على التبرعات من مستخدميه وداعميه.<br/><br/><b>شكراً لك</b> على جعل نظام إدارة المحتوى هذا أفضل بدعمك له!
it: Sarebbe fantastico se potessi fare una donazione. TYPO3 CMS è Open Source e si basa molto sulle donazioni dei suoi utenti e sostenitori.<br/><br/><b>Grazie</b> per aver reso grande questo Content Management System e ancora migliore con il tuo supporto!

# donation_button
source: Donate now
ar: تبرع الآن
it: Dona ora

source: External Libraries
ar: المكتبات الخارجية
it: Librerie Esterne

# external_thanks
source: TYPO3 CMS core uses and thanks these external Open Source projects:
ar: يستخدم ويشكر نظام TYPO3 CMS الأساسي هذه المشاريع الخارجية المفتوحة المصدر:
it: TYPO3 CMS core utilizza e ringrazia questi progetti Open Source esterni:

# external_libraries.table.column.name
source: Project name
ar: اسم المشروع
it: Nome del progetto

# external_libraries.table.column.website
source: Website
ar: الموقع الالكتروني
it: Sito Web

# introtext
source: Web Content Management System
ar: نظام إدارة محتوى الويب

# modules.headline
source: Modules
ar: الوَحَدات
it: Moduli

# modules.introtext
source: This is a brief description of the available modules.
ar: هذا وَصف مُختصر للوِحدات المُتاحة.
it: Questa è una breve descrizione dei moduli disponibili.

# endText
source: Features may vary depending on your website and permissions
ar: قد تختلف الميزات تبعاً لموقع الويب الخاص بك والأذونات
it: Le funzionalità possono variare a seconda del tuo sito web e dei permessi

# userInfo
source: You're logged in as user
ar: لقد قمت بتسجيل الدخول كـمُستخدم
it: Hai effettuato l'accesso come utente

# link.openModule
source: Open module
ar: فتح الوُحدة
it: Apri modulo

# link.openModuleWithTitle
source: Open %1s module
ar: فتح الوُحدة %1s
it: Apri il modulo %1s
