Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/filelist/Resources/Private/Language/*.locallang_mod_file_list.xlf
Languages: ar

# clipBoard
source: Show clipboard
ar: عرض محتويات الحافظة

# clip_paste
source: Paste in clipboard content
ar: لصق محتويات الحافظة

# clip_pasteInto
source: Paste into: Clipboard content is inserted into this folder
ar: لصق إلى: محتوى الحافظة يتم إدراجه في هذا المجلد

# editMarked
source: Edit Metadata
ar: تعديل البيانات الوَصفية

# editColumns
source: Edit specific Metadata
ar: تعديل بيانات التعريف المُحدّدة "Metadata"

# clip_selectMarked
source: Transfer to clipboard
ar: الإرسال إلى الحافظة

# clip_deleteMarked
source: Remove from clipboard
ar: إزالة من الحافظة

# clip_deleteMarkedWarning
source: Are you sure you want to delete all marked files from this folder?
ar: هل أنت واثق أنك تريد حذف جميع الملفات من هذا المجلد؟

# c_name
source: Name
ar: الاسم

# c_size
source: Size
ar: الحجم

# c_record_type
source: Type
ar: النوع

# c_rw
source: RW
ar: الصف

source: files
ar: ملفات

# temp
source: Temporary files
ar: الملفات المؤقتة

source: Recycler
ar: إعادة التدوير

# mlang_labels_tablabel
source: Listing of files in the directory
ar: لائحة الملفات المتواجدة في الدليل

# mlang_labels_tabdescr
source: This is the file administration system in TYPO3. It allows you to access the file mounts of your login. Through this module you can upload, copy, move an delete files on the server.
ar: هذا النظام هو نظام إدارة الملفات في تيبو3. يتيح لك هذا النظام الدخول إلى نقاط تحميل ملفاتك. ومن خلال هذه الوحدة يمكنك تحميل ونسخ ونقل وحذف الملفات على الملقم.

# mlang_tabs_tab
source: Filelist
ar: لائحة الملفات

# storageNotBrowsableTitle
source: Access denied.
ar: غير مسموح لك بالدخول.

# storageNotBrowsableMessage
source: You are trying to access a folder in a storage that is not browsable.
ar: أنت تحاول الوصول إلى مجلد في وحدة تخزين غير قابل للتصفح.

# missingFolderPermissionsTitle
source: Missing folder permissions
ar: أُذُونات المجلد مفقودة

# missingFolderPermissionsMessage
source: You have no access to the folder "%s".
ar: ليس لديك حق الوصول إلى المجلد "%s".

# localStorageOfflineTitle
source: Base folder for local storage missing or not allowed
ar: المُجلّد الأساسي للتخزين المَحلّي مفقود أو غير مَسموح به

# localStorageOfflineMessage
source: Verify that the base folder for the storage "%s" exists and is allowed to be accessed.
ar: تحقق من أن المُجلّد الأساسي للتخزين "%s" موجود ويُمكن الوصول إليه.

# folderNotFoundTitle
source: Folder not found.
ar: المجلد غير موجود.

# folderNotFoundMessage
source: The folder "%s" cannot be accessed. Trying to use parent folder(s).
ar: لا يمكن الوصول إلى المجلد "%s". حاول استخدام المجلدات الأصلية.

source: Translate metadata
ar: تَرْجَمَة البيانات الوَصفية

# createMetadataForLanguage
source: Create metadata of this file for %s
ar: إنشاء بيانات وَصفية لهذا المِلَفّ لـ %s

# editMetadataForLanguage
source: Edit metadata of this file for %s
ar: تعديل البيانات الوَصفية لهذا المِلَفّ لـ %s

# paramError
source: Parameter Error
ar: خطأ في المتغير

# targetNoDir
source: Target was not a directory!
ar: الهدف لم يكن دليلاً!

source: Reload Metadata
ar: إعادة تحميل البيانات الوَصفية
