Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/recycler/Resources/Private/Language/*.locallang.xlf
Languages: ar, fr, it

# title
source: Recycler
ar: سلة المحذوفات
fr: Corbeille
it: Cestino

# description
source: The recycler allows you to select any deleted data and undelete it. You can undelete recursive if the parent of the element is deleted too.
ar: تسمح لك سلة المحذوفات بتحديد أيّة بيانات محذوفة وإلغاء حذفها. يمكنك أيضاً إلغاء حذف التكرار إذا تم حذف الأصل للعنصر.
fr: La corbeille vous permet de sélectionner des données supprimées et les restaurer. Vous pouvez restaurer récursivement si le parent des éléments a aussi été supprimé.
it: Il cestino ti permette di selezionare qualsiasi record eliminato e di ripristinarlo. Puoi ripristinare ricorsivamente se anche il padre è stato eliminato.

# label_allrecordtypes
source: All Record Types
ar: كل أنواع السجل
fr: Tous les types d'enregistrement.
it: Tutti i tipi di record

# filter.search
source: Search term
ar: مصطلح البحث
fr: Mot(s)-clé(s) recherché(s)
it: Cerca termine

# filter.depth
source: Depth
ar: العمق
fr: Profondeur
it: Profondità

# button.cancel
source: Cancel
ar: إلغاء
fr: Annuler
it: Annulla

# button.delete
source: Delete
ar: حذف
fr: Supprimer
it: Elimina

# button.deleteselected
source: Delete {0} records
ar: حذف {0} سجلات
fr: Supprimer {0} enregistrements
it: Elimina {0} record

# button.undo
source: Recover
ar: استعادة
fr: Restaurer
it: Ripristina

# button.expand
source: Expand record
ar: توسيع السجل
fr: Etendre l'enregistrement
it: Espandi record

# button.dropdown.multiselect
source: Open context menu for multiselect options
ar: فتح قائمة السياق لخيارات التحديد المُتعددة
fr: Ouvrir le menu contextuel pour les options de sélection multiple
it: Apri menù contestuale per le opzioni di selezione multipla

# button.undoselected
source: Recover {0} records
ar: استعادة {0} سجلات
fr: Restaurer {0} enregistrements
it: Ripristina {0} record

# button.reload
source: Reload
ar: إعادة التحميل
fr: Recharger
it: Ricarica

# modal.delete.header
source: Confirm deletion
ar: تأكيد الحذف
fr: Confirmer la suppression
it: Conferma eliminazione

# modal.undo.header
source: Recover records
ar: استعادة السجلات
fr: Enregistrements restaurés
it: Ripristina i record

# modal.undo.recursive
source: Recover content and subpages recursively
ar: استعادة المحتوى والصفحات الفرعية بشكل متكرر
fr: Restaurer les contenus et les sous-pages récursivement
it: Ripristina ricorsivamente contenuti e sottopagine

# modal.deletecontent.text
source: Do you really want to delete the record "{0}" {1} permanently? You cannot revert this action!
ar: هل تريد حقاً حذف السجل"{0}" {1} نهائيّاً؟ لا يمكنك التراجع عن هذا الإجراء!
fr: Voulez-vous vraiment supprimer définitivement les enregistrements "{0}" {1} ? Aucun retour possible!
it: Vuoi veramente eliminare il record "{0}" {1} in modo permanente? Non potrai tornare indietro!

# modal.massdelete.text
source: Do you really want to delete all selected records and potential subpages? You cannot revert this action!
ar: هل تريد حقاً حذف جميع السجلات المُحددة والصفحات الفرعية المُحتملة؟ لا يمكنك التراجع عن هذا الإجراء!
fr: Voulez-vous vraiment supprimer tous les enregistrements sélectionnés et sous-pages potentielles? Aucun retour possible!
it: Vuoi veramente eliminare tutti i record selezionati e le eventuali sottopagine? Non potrai tornare indietro!

# modal.deletepage.text
source: Do you really want to delete the page "{0}" {1} and all of its contents (records and pages) permanently? You cannot revert this action!
ar: هل تريد حقاً حذف الصفحة "{0}" {1} وجميع محتوياتها (السجلات والصفحات) بشكل دائم؟ لا يمكنك الرجوع عن هذا الإجراء!
fr: Voulez-vous vraiment supprimer définitivement la page "{0}" {1} et tous ses contenus (enregistrements et pages)? Aucun retour possible!
it: Vuoi veramente eliminare la pagina "{0}" {1} e tutti i suoi contenuti (record e pagine) in modo permanente? Non potrai annullare questa azione!

# modal.undocontent.text
source: Do you really want to recover the record "{0}" {1}?
ar: هل تريد حقاً استعادة السجل "{0}" {1}؟
fr: Voulez-vous vraiment restaurer l'enregistrement "{0}" {1}?
it: Vuoi veramente ripristinare il record "{0}" {1}?

# modal.undopage.text
source: Do you really want to recover the page "{0}" {1}, its contents and optionally all of its subpages?
ar: هل تريد حقاً استعادة الصفحة "{0}" {1}، ومحتوياتها وجميع صفحاتها الفرعية بشكل اختياري؟
fr: Voulez-vous vraiment restaurer la page "{0}" {1}, ses contenus et potentiellement toutes les sous-pages?
it: Vuoi davvero recuperare la pagina "{0}" {1}, il suo contenuto e, opzionalmente, tutte le sue sottopagine?

# modal.undo.parentpages
source: All parent pages have been restored to ensure a valid rootline!
ar: تم استعادة جميع الصفحات الرئيسية لضمان وجود خط جذر صالح!
fr: Les pages parentes ont été restaurés pour s'assurer d'avoir une arborescence fonctionnelle !
it: Tutte le pagine padre sono state ripristinate per garantire una rootline valida!

# modal.massundo.text
source: Do you really want to recover all selected records and optionally potential subpages?
ar: هل تريد حقاً استعادة جميع السجلات المُحدّدة والصفحات الفرعية المُحتملة بشكل اختياري؟
fr: Voulez-vous vraiment restaurer tous les enregistrements sélectionnés ainsi que les sous-pages potentielles?
it: Vuoi davvero recuperare tutti i record selezionati e, opzionalmente, le eventuali sottopagine?

# flashmessage.delete.norecordsselected
source: No records set to delete.
ar: لم يتم تعيين سجلات للحذف.
fr: Aucun enregistrement définit à supprimer
it: Nessun record da eliminare.

# flashmessage.delete.success.singular
source: One record was deleted.
ar: تم حذف سجل واحد.
fr: Un enregistrement a été supprimé.
it: È stato eliminato un record.

# flashmessage.delete.success.plural
source: %d records were deleted.
ar: تم حذف %d سجلات.
fr: %d enregistrements ont été supprimés.
it: Sono stati eliminati %d record.

# flashmessage.delete.failure.singular
source: Could not delete one record.
ar: تعذر حذف سجل واحد.
fr: Impossible de supprimer un enregistrement.
it: Impossibile eliminare un record.

# flashmessage.delete.failure.plural
source: Could not delete %d records.
ar: تعذر حذف %d سجلات.
fr: Impossible de supprimer %d enregistrements.
it: Impossibile eliminare %d record.

# flashmessage.undo.norecordsselected
source: No records set to recover.
ar: لم يتم تعيين سجلات لاستعادتها.
fr: Aucun enregistrement à restaurer.
it: Nessun record da ripristinare.

# flashmessage.undo.success.singular
source: One record was recovered.
ar: تم استعادة سجل واحد.
fr: Un enregistrement a été restauré.
it: È stato ripristinato un record.

# flashmessage.undo.success.plural
source: %d records were recovered.
ar: تم استعادة %d سجلات.
fr: % enregistrements ont été restaurés.
it: Sono stati ripristinati %d record.

# flashmessage.undo.failure.singular
source: Could not recover one record.
ar: تعذر استعادة سجل واحد.
fr: L'enregistrement ne peut pas être restauré.
it: Impossibile ripristinare un record.

# flashmessage.undo.failure.plural
source: Could not recover %d records.
ar: تعذر استعادة %d سجلات.
fr: % enregistrements ne peuvent pas être restaurés.
it: Impossibile ripristinare %d record.

# table.caption.recently_deleted_records
source: Recently deleted records
ar: السجلات المَحذُوفة مُؤخراً
fr: Enregistrements récemment supprimés
it: Record eliminati di recente

# table.header.pageTitle
source: Page title
fr: Titre de la page
it: Titolo della pagina

# table.header.pid
source: Page ID
fr: ID de la page
it: ID pagina

# table.header.record
source: Record
ar: السجل
fr: Enregistrement

# table.header.tstamp
source: Last edit
ar: آخر تعديل
fr: Dernière édition
it: Ultima modifica

# table.header.crdate
source: Created at
fr: Créé(e) le
it: Creata il

# table.header.createdBy
source: Created by
fr: Créé(e) par
it: Creata da

# table.header.deletedBy
source: Deleted by
ar: تم الحذف بواسطة
fr: Supprimé par
it: Eliminato da

# table.header.path
source: Path
ar: المسار
fr: Chemin
it: Percorso

# record.userDeleted
source: [Deleted user] (id=%s)
fr: [Utilisateur supprimé] (id=%s)
it: [Utente eliminato] (id=%s)

# filter.type
source: Type
ar: النوع
it: Tipo
