Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/install/Resources/Private/Language/Report/*.locallang.xlf
Languages: it

# environment.status.title
source: System environment check
it: Verifica dell'ambiente di sistema

# environment.status.value
source: %1$s Test(s)
it: %1$s Test

# environment.status.message.error
source: The system environment check returned errors. Those errors will affect the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
it: La verifica dell'ambiente di sistema ha restituito degli errori. Tali errori compromettono la funzionalità e la stabilità della tua installazione del CMS TYPO3. Per favore esegui una verifica con lo strumento "Ambiente" per ulteriori dettagli.

# environment.status.message.warning
source: The system environment check returned warnings. Those warnings might have a negative effect on the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
it: Il controllo dell'ambiente di sistema ha restituito avvertimenti. Questi avvertimenti potrebbero avere un effetto negativo sulla funzionalità e stabilità dell'istanza CMS di TYPO3. Si prega di controllare lo strumento "Ambiente" per tutti i dettagli.

# environment.status.message.notice
source: The system environment check returned notices. Those should not affect the functionality and stability of your TYPO3 CMS instance. Please check the install tool "System environment" for all details.
it: Il controllo dell'ambiente di sistema ha restituito le notifiche. Questi non dovrebbero influenzare la funzionalità e la stabilità dell'istanza CMS di TYPO3. Si prega di controllare lo strumento "Ambiente" per tutti i dettagli.

# status_writable
source: Writable
it: Scrivibile

# status_missingDirectory
source: Required directory missing
it: La cartella richiesta è mancante

# status_nonExistingDirectory
source: Directory not existing
it: La cartella non esiste

# status_recommendedWritableDirectory
source: Directory should be writable
it: La cartella dovrebbe essere scrivibile

# status_requiredWritableDirectory
source: Directory not writable
it: La cartella non è scrivibile

# status_directoryDoesNotExist
source: %s does not exist.
it: %s non esiste.

# status_directoryDoesNotExistCouldNotCreate
source: %s does not exist and could not be created.
it: %s non esiste e non è stato possibile crearla.

# status_directoryShouldAlsoBeWritable
source: Also note that it should be writable, if it did exist.
it: Nota anche che dovrebbe essere scrivibile, se esistesse.

# status_directoryShouldBeWritable
source: %s should be writable.
it: %s dovrebbe essere scrivibile.

# status_directoryMustBeWritable
source: %s must be writable.
it: %s deve essere scrivibile.

# status_remainingUpdates
source: Remaining updates
it: Aggiornamenti rimanenti

# status_remoteFetchException
source: Could not fetch version matrix of TYPO3. Maybe this instance is blocked by a firewall?
it: Non è possibile recuperare la matrice delle versioni di TYPO3. Forse questa istanza è bloccata da un firewall?

# status_isDevelopmentVersion
source: This version of TYPO3 seems to be a development version. Thus no update information exists.
it: Questa versione di TYPO3 sembra essere una versione in sviluppo. Non esistono ulteriori informazioni.

# status_patchLevelNotFoundInReleaseMatrix
source: It seems that this TYPO3 version has never been released. Thus no update information exists.
it: Sembra che questa versione di TYPO3 non sia mai stata rilasciata. Di conseguenza non esistono informazioni sull'aggiornamento.

# status_newVersionSecurityRelevant
source: There is a new version of TYPO3 available, updating is security relevant. Please update to version %s.
it: C'è una nuova versione di TYPO3 disponibile, l'aggiornamento è rilevante per la sicurezza. Si prega di aggiornare alla versione %s.

# status_newVersion
source: There is a new version of TYPO3 available. You can update to version %s.
it: È disponibile una nuova versione di TYPO3. Puoi eseguire l'aggiornamento alla versione %s.

# status_elts_information
source: The currently installed TYPO3 version %s doesn't receive any community-driven updates anymore, consider subscribing to Extended Long Term Support (ELTS) releases. Get more information at %s.
it: La versione %s di TYPO3 attualmente installata non riceve più alcun aggiornamento. Considera l'iscrizione alle versioni Extended Long Term Support (ELTS). Ottieni ulteriori informazioni a %s.

# status_elts_download
source: Please visit %s to download the release in your ELTS area.
it: Visita %s per scaricare il rilascio nella tua area ELTS.

# status_elts_subscribe
source: The currently installed TYPO3 version %s doesn't receive any community-driven updates anymore, consider subscribing to Extended Long Term Support (ELTS) releases. Get more information at %s.
it: La versione %s di TYPO3 attualmente installata non riceve più alcun aggiornamento. Considera l'iscrizione alle versioni Extended Long Term Support (ELTS). Ottieni ulteriori informazioni a %s.

# status_versionOutdated
source: The TYPO3 version you're using is not supported anymore. You should update to a supported version.
it: La versione di TYPO3 che stai utilizzando non è più supportata. Dovresti aggiornare a una versione supportata.

# status_noAutomaticCheck
source: Automatic update checking failed, please check for updates manually.
it: Il controllo automatico degli aggiornamenti è fallito, esegui un controllo manuale degli aggiornamenti.

# status_uptodate
source: Your TYPO3 version is up-to-date.
it: La tua versione di TYPO3 è aggiornata.

# status_enabledPermanently
source: Enabled permanently
it: Abilitato permanentemente

# status_enabledTemporarily
source: Enabled temporarily
it: Abilitato temporaneamente

# status_installEnabledTemporarily
source: The Install Tool is temporarily enabled. Delete the file "%s" when you have finished setting up TYPO3. If not used the Install Tool will be disabled automatically in %s minutes.
it: L'Install Tool è temporaneamente abilitato. Elimina il file "%s" quando hai finito di impostare TYPO3. Se non utilizzato, l'Install Tool sarà disabilitato automaticamente in %s minuti.
