Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/info/Resources/Private/Language/*.locallang_csh_webinfo.xlf
Languages: fr, it

# func_0.alttitle
source: Basic Settings
fr: Réglages de base
it: Impostazioni Base

# func_0.description
source: Displays a selection of fields from page records which are regarded as foundational settings for pages. That includes aliases, start- and stop times, access restriction information etc.
fr: Affiche les champs considérés comme des paramètres fondamentaux des enregistrements de type page. Cela inclus les alias d'url, les dates de début et de fin, les droits d'accès, etc.
it: Visualizza una serie di campi dai record di pagina, che sono considerati come impostazioni fondamentali per le pagine. Ciò include segmento, date di pubblicazione/scadenza, restrizioni di accesso, ecc.

# func_0.details
source: The Basic Settings view resembles the Cache and Age view quite a lot. They are different only by the selection of fields they show. <b>Batch editing page fields</b> You will find multiple edit-icons around the interface. All edit icons in head lines will bring you to an editing dialog where you can change exactly that field for all listed tables! Very useful for batch-editing of say all "Start" times. If you click the edit icon at the ID numbers of pages you will get straight to the regular editing of a whole page record.
fr: La vue "Réglages de base" ressemble beaucoup à la vue "Cache et âge". Ils diffèrent uniquement au niveau des champs affichés. <b>Edition groupé des champs de page</b> Vous trouverez plusieurs icônes d'édition dans l'interface. Chaque icône d'édition dans la ligne d'en-tête vous amenera à une fenêtre d'édition où vous pourrez modifier ce champ pour tous les enregistrements listés! Très utile pour l'édition groupé des dates de début d'affichage. Si vous cliquez sur l'icône d'édition au niveau de l'ID de la page, vous arriverez directement à la fenêtre normal d'édition, avec l'ensemble des champs d'une page.
it: La visualizzazione delle Impostazioni Base assomiglia molto alla visualizzazione della Cache e dell'Età. Sono diverse solo dalla selezione dei campi mostrati. <b>Modifica di più campi/record contemporaneamente</b> Sono disponibili diverse e differenti icone per la modifica. Tutte le icone di modifica, in testa, ti porteranno ad una form-modifica con cui modificare un campo specifico per tutte le tabelle elencate! Molto utile per modifiche massive, come ad esempio la data nel campo "Data di Pubblicazione". Se fai clic sull'icona di modifica all'ID di pagina, accederai alla form-modifica completa del record di pagina.

# func_0.image_descr
source: The Basic Settings view offers a very convenient overview of page urls, start times and access restriction settings in the tree branch. If you click an edit-icon in the header you will be able to edit that field for all listed pages.
fr: La vue "Réglages de base" propose une vue d'ensemble très pratique des alias d'url, des dates de début et des droits d'accès pour les pages dans la branche choisie de l'arborescence. Si vous cliquez sur un icône d'édition dans l'en-tête, vous pourrez éditer ce champ pour toutes les pages affichées.
it: Le Impostazioni Base, della visualizzazione, offrono una panoramica molto comoda dei segmenti URL di pagina, delle date di pubblicazione e dei diritti di accesso nel ramo dell'Albero delle Pagine. Se clicchi sull'icona di modifica nell'intestazione, potrai modificare quel campo per tutte le pagine elencate.

# func_1.alttitle
source: Record Overview
fr: Aperçu des enregistrements
it: Panoramica record

# func_1.description
source: Record overview gives you an indispensable overview of the distribution of records in the page tree. Each database table in the system is represented with a column and for each page you can see the number of records from that table located on the page.
fr: L'aperçu des enregistrements fournit une indispensable vue d'ensemble des enregistrements dans l'arborescence. Chaque table de la base de données est représentée par une colonne et pour chaque page est affiché le nombre d'enregistrements de cette table se trouvant sur la page.
it: La panoramica del record ti offre una visione indispensabile della distribuzione dei record nell'Albero delle Pagine. Ogni tabella, del database nel sistema, è rappresentata con una colonna e per ogni pagina è possibile vedere il numero di record da quella tabella sulla pagina.

# func_1.details
source: <b>Notice:</b> Be careful with the level-setting. A high level-setting may cause the module to respond very slowly if there are many pages and many records in the database as well! <b>Tree stop?</b> Notice the red "+" next to a page in the page tree? This is due to a setting for that page record which means that the page tree will not expand for this page. Typically this is set for protection when there are a large amount of subpages underneath (hundreds of pages typically). If you click the icon/title the overview will jump to make this page the new root of the overview.
fr: <b>Attention :</b> Soyez prudent avec le réglage de niveau. Un réglage de niveau élevé peut faire en sorte que le module réponde très lentement s'il y a beaucoup de pages et d'enregistrements dans la base de données ! <b>Masquer les sous-pages dans l'arborescence ?</b> Remarquez le "+" rouge à côté d'une page dans l'arborescence des pages ? Cela est activé grâce à un paramètre pour cette page, ce qui signifie que l'arborescence des sous-pages ne sera pas affichée pour cette page. Généralement, cela est une protection quand il y a un grand nombre de sous-pages en dessous (des centaines de pages). Si vous cliquez sur l'icône/titre, la vue changera pour faire de cette page la nouvelle racine de l'aperçu.
it: <b>Nota:</b> fai attenzione con l'impostazione del livello. Un'impostazione di livello elevato può comportare un rallentamento nella risposta del modulo se ci sono molte pagine e molti record! <b>Blocco ramo dell'albero</b> Nota il "+" rosso accanto a una pagina nell'albero della pagina. Ciò è dovuto a un'impostazione per quella pagina, che significa che l'albero delle pagine non si espanderà per questa pagina. Questa è una protezione qualora ci sia una grande quantità di sottopagine (centinaia di pagine). Se fai clic sull'icona/titolo, la panoramica cambierà radicalmente per rendere questa pagina la nuova radice nella panoramica e avere un numero di elementi più contenuto da visualizzare.

# _func_1.image
source: EXT:frontend/Resources/Public/Images/cshimages/pagetree_overview_6.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/pagetree_overview_6.png

# func_1.image_descr
source: You can easily see the distribution of Content Elements on a page. You can also see where Template Records - and basically any record! - are located in the page tree!
fr: Vous pouvez facilement voir la distribution des éléments de contenu sur une page. Vous pouvez également voir où se trouvent les enregistrements de gabarits - et en fait tous les enregistrements ! - dans l'arborescence des pages !
it: Puoi vedere facilmente la distribuzione degli Elementi di Contenuto in una pagina. Puoi anche vedere dove sono posizionati i record di tipo Template, ma in pratica qualsiasi tipo di record, nell'Albero delle Pagine!

# func_2.alttitle
source: Cache and Age
fr: Cache et âge
it: Cache ed Età

# func_2.description
source: Displays a selection of fields from page records related to page caching and time settings.
fr: Affiche une sélection de champs à partir des enregistrements de page liés à la mise en cache de la page et aux paramètres d'heure.
it: Visualizza una selezione di campi, dai record di pagina, relativi alla memorizzazione della pagina nella cache e relativi tempi di aggiornamento.

# func_2.image_descr
source: The "Cache and Age" view. Here you see the "TSconfig" column. The overview exposes that these two pages include some Page TSconfig code!
fr: La vue "Cache et Age". Ici vous voyez la colonne "TSconfig". L'aperçu montre que ces deux pages incluent du code Page TSconfig !
it: Cache ed Età. Qui vedi la colonna "TSconfig". La panoramica mostra che queste due pagine includono del codice TSconfig di Pagina!

# lang.details
source: The overview uses colors to signal the availability and fall back situation for a given page. Here is a description for each color code: <b>Green background:</b> Page is translated and viewable in this language. For translations it means that an active page overlay record is present. <b>Red background:</b> Page <em>cannot</em> be viewed in this language and you will see an error message if you try. Menus should automatically filter out links to pages with this translation. <b>Gray background (not available for default language):</b> Page will fall back to the specified fallback mode for content. Depends on configuration. (sys_language_mode = content_fallback is recommended for most flexible fallback, sys_language_mode = strict will prevent this and issue an error instead!) <b>The pages "Localization settings:"</b> It is the "Localization settings" of the page record that determines the modes above. In the column of the default language each of these settings are represented by a "N" (Hide page if no translation for current language exists) or a "D" (Hide default language of page). As you can see the page "Startpage" has the N flag set and therefore any access to the german version of that page will be blocked with an error message because there is no translation in german. By default "german access" to a non-translated page will just show the english content. There is also a page with the D flag ("[Dummy]"). The D flag means that the page is only available in one of the translations, in this case Danish. So any attempt to access the page in the default language or german will show an error message. So, when the "Localization settings" checkboxes for a page are used, you will get an error message when you try to request a page which has been blocked. This is a feature. The trick is not to create links to those pages. Menus generated from HMENU objects will always take "sys_language" into account and display only pages which can be accessed for that language. But combined with the "localization settings" of pages which may block page access this becomes a problem with pages which are <em>not</em> translated (has gray background); You might get menu items which links to non-accessible pages. The problem basically is that "&L=xx" is different from internal "sys_language". You would like to avoid that and to do so you should configure "sys_language_mode" to "content_fallback". If you do that sys_language will <em>always</em> follow what "&L=" instructs it to and your menus will be right. At the same time you will get the default content displayed if no translation exists (because content selection falls back). Finally, the number found in each column tells you how many content elements are found in the specified language.
fr: L'aperçu utilise des couleurs pour identifier la disponibilité et l'état du repli pour une page donnée. Voici la description de chaque couleur : <b>Fond vert :</b> la page est traduite et visible dans cette langue. Pour les traductions, cela veut dire qu'une traduction de page active existe. <b>Fond rouge :</b> la page <em>ne peut pas</em> être vue dans cette langue et qu'un message d'erreur sera affiché si vous essayez. Les menus ne contiendront pas de liens vers les pages avec cette traduction. <b>Fond gris (indisponible dans la langue par défaut) :</b> la page sera affichée en se repliant vers le mode de repli spécifié pour le contenu. Cela dépend de la configuration. (sys_language_mode = content_fallback étant recommandé pour une meilleure flexibilité, sys_language_mode = strict empêchera ce cas mais provoquera une erreur à l'affichage !) <b>Les "Paramètres de traduction:" des pages</b> Ce sont les "Paramètres de traduction" de la page qui déterminent le comportement décrit ci-dessus. Dans la colonne de la langue par défaut, chacun de ces paramètres est représenté par un "N" (masquer la page si aucune traduction pour la langue courante n'existe) ou un "D" (masquer la page dans la langue par défaut). Comme vous pouvez le voir la page "Startpage" a un "N", ce qui fait que tout accès à cette page dans la version allemande sera bloqué avec un message d'erreur, parce qu'il n'y a pas de traduction allemande. Par défaut un accès "allemand" à une page non traduite affichera seulement le contenu anglais. Il y a aussi une page avec un "D" ("[Dummy]"). Le "D" signifie que la page est seulement disponible dans une des traductions, ici en danois. Donc tout accès à cette page dans la langue par défaut ou en allemand affichera un message d'erreur. Donc, quand les "Paramètres de traduction" sont utilisés pour une page, vous verrez un message d'erreur si vous tentez d'afficher une page qui a été bloquée. C'est le comportement souhaité. La solution consiste donc à ne pas faire de lien vers cette page. Les menus générés avec HMENU prendront toujours en compte le "sys_language" et n'afficheront que les pages qui peuvent être visibles pour cette langue. Mais associé avec les "paramètres de traduction" des pages, qui peuvent bloquer l'accès, cela devient un problème pour les pages qui sont <em>non</em> traduites (avec un fond gris) ; vous pourrez alors avoir des liens de menus vers des pages non accessibles. Le problème est simplement que "&L=xx" est différent du "sys_language" interne. Vous pouvez vouloir éviter ce cas et devez donc configurer "sys_language_mode" sur "content_fallback". En faisant ça sys_language suivra <em>toujours</em> ce que dicte "&L=" et vos menus seront corrects. Dans le même temps vous verrez s'afficher le contenu de la langue par défaut si aucune traduction n'existe (conformément au mode "content_fallback"). Enfin, le nombre indiqué sur chaque colonne vous indique combien d'éléments de contenu sont trouvés dans la langue spécifiée.
it: La panoramica utilizza i colori per segnalare la disponibilità e la situazione di fallback per una determinata pagina. Ecco una descrizione per ogni colore. <b>Sfondo verde:</b> la pagina è tradotta e disponibile in questa lingua. Per le traduzioni significa che è presente un record di lingua attivo per la pagina. <b>Sfondo rosso:</b> la pagina <em>non può</em> essere visualizzata in questa lingua e, se provi ad accederci, vedrai un messaggio di errore. I menù (di FE) filtrano automaticamente i collegamenti alle pagine in questa situazione. <b>Sfondo grigio (lingua predefinita non disponibile):</b> la pagina tornerà alla modalità di fallback specificata per il contenuto. Dipende dalla configurazione. (sys_language_mode = content_fallback è consigliato per il fallback più flessibile, sys_language_mode = strict lo impedirà e genererà un errore!) <b>"Impostazioni di Localizzazione" delle pagine</b> Sono le "Impostazioni di Localizzazione" del record di pagina che determinano le modalità di cui sopra. Nella colonna della lingua predefinita, ciascuna di queste impostazioni, è marcata da una "N" (Nascondi pagina se non esiste una traduzione per la lingua corrente) o da una "D" (Nascondi lingua predefinita della pagina). Come puoi vedere la pagina "Startpage" è marcata con una "N" e quindi qualsiasi accesso alla versione tedesca, a quella pagina, verrà bloccato con un messaggio di errore, perché non c'è traduzione in tedesco. Per impostazione predefinita, l'"accesso tedesco" a una pagina non tradotta mostrerà solo il contenuto in inglese. C'è anche una pagina, "Dummy", marcata con D, che significa che la pagina è disponibile solo in una delle traduzioni, in questo caso danese. Quindi qualsiasi tentativo di accedere alla pagina nella lingua predefinita o in tedesco mostrerà un messaggio di errore. Quindi, quando vengono utilizzate le checkbox "Impostazioni di Localizzazione" per una pagina, riceverai un messaggio di errore quando tenterai di accede a una pagina che è stata bloccata. Questa è una caratteristica opzionale, non è un problema. Il trucco è non creare collegamenti a quelle pagine. I menù generati dagli oggetti HMENU terranno sempre in considerazione "sys_language" e visualizzeranno solo le pagine a cui è possibile accedere per quella lingua. Ma combinato con le "Impostazioni di Localizzazione" delle pagine, che possono bloccare l'accesso, questo diventa un problema con le pagine che <em>non</em> sono state tradotte (quelle con sfondo grigio). In questo caso potresti avere voci di menù che rimandano a pagine non accessibili. Il problema fondamentalmente è che "&L=xx" è diverso dal "sys_language" interno. Per evitarlo dovresti configurare "sys_language_mode" su "content_fallback". Questo obbligherà sys_language a rispettare <em>sempre</em> il valore di "&L=" e i tuoi menù saranno corretti. Allo stesso tempo otterrai il contenuto predefinito visualizzato, se non esiste alcuna traduzione. Infine, il numero trovato in ogni colonna ti dice quanti Elementi di Contenuto ci sono sulla pagina nella lingua specificata.

# lang.image_descr
source: Localization overview in the Web>Info module. Use the buttons to edit, view and create new page translation headers. Use the regular page module to put localized content on the pages. The "Localization settings" that affect availability of pages in the various languages.
fr: Aperçu de la localisation dans le module Web>Info. Utilisez les boutons pour éditer, afficher et créer de nouvelles traduction de page. Utilisez le module de page habituel pour créer du contenu localisé sur les pages. Les "Paramètres de localisation" qui affectent la disponibilité des pages dans les différentes langues.
it: Panoramica di localizzazione nel modulo Web>Info. Usa i bottoni per modificare, visualizzare e creare nuove traduzioni della pagina. Usa il modulo Pagina per inserire contenuti localizzati nelle pagine. Le "Impostazioni di Localizzazione" influiscono sulla disponibilità delle pagine nelle varie lingue.

# lang.alttitle
source: Localization overview
fr: Aperçu de la localisation
it: Panoramica della localizzazione

# lang.description
source: Gives an overview of which pages in the page tree are translated to the system languages installed.
fr: Donne un aperçu des pages dans l'arborescence des pages qui sont traduites dans les langues système installées.
it: Fornisce una panoramica di quali pagine, nell'Albero delle Pagine, sono tradotte nelle lingue di sistema installate.
