Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/info/Resources/Private/Language/*.locallang_webinfo.xlf
Languages: ar

# page_title
source: Pagetree overview
ar: نظرة عامة على شجرة الصفحة

# page_sysnote
source: Internal notes
ar: مُلاحظات داخلية

source: Page information
ar: معلومات الصفحة

# pages_0
source: Basic settings
ar: الإعدادات الأساسيّة

# pages_2
source: Cache and Age
ar: ذاكرة التخزين المؤقت والمدة الزمنية

# pages_1
source: Record overview
ar: نَظْرَة عامّة على السجل

# pages_layouts
source: Layouts
ar: التصميمات

source: Actual backend layout
ar: تصميم الواجهة الخلفية الفعلي

# stat_type_0
source: Page hits
ar: عدد زيارات الصفحة

# stat_type_1
source: Total hits
ar: إجمالي عدد الزيارات

# stat_type_2
source: Hits in main sections
ar: الزيارات في الأقسام الرئيسية

# stat_period
source: Statistics in the period %s back to %s
ar: الإحصائيات في الفترة %s عودةً إلى %s

# pI_crUser
source: Created by
ar: أُنشِئ بواسطة

# pI_crDate
source: Created date
ar: تاريخ الإنشاء

# pI_lastChange
source: Last change
ar: آخر تعديل

# pI_lastChangeContent
source: Last change, content
ar: آخر تعديل، المحتوى

# hits_title
source: Hit Statistics
ar: إحصائيات الزيارات

# lang_renderl10n_viewPage
source: View page
ar: عرض الصفحة

# lang_title
source: Localization overview
ar: نَظْرَة عامّة على الترجمة

# lang_renderl10n_editDefaultLanguagePage
source: Edit default language page properties
ar: تعديل خصائص صفحة اللغة الافتراضية

# lang_renderl10n_editLangOverlays
source: Edit all language overlay records
ar: تعديل جميع سجلات تراكب اللغة

# lang_renderl10n_editPageProperties
source: Edit all page properties
ar: تعديل كل خصائص الصفحة

# lang_renderl10n_editPage
source: Edit page
ar: تعديل الصفحة

# lang_renderl10n_editPageLang
source: Edit page translation
ar: تعديل تَرْجَمَة الصفحة

# lang_renderl10n_badThingThereAre
source: ERROR: there are two or more page overlay records for this language! Only one is allowed!
ar: خطأ: هناك اثنين أو أكثر من سجلات تراكب الصفحة لهذه اللغة! مسموح بواحدة فقط!

# lang_renderl10n_editLanguageOverlayRecord
source: Edit language overlay record
ar: تعديل سجلات تراكب اللغة

# lang_renderl10n_page
source: Page
ar: الصفحة

# lang_renderl10n_default
source: Default
ar: افتراضي

# lang_getlangsta_createNewTranslationHeaders
source: Create new translation headers
ar: إنشاء ترويسات جديدة للترجمة

# lang_renderl10n_CEcount
source: Content Element Count
ar: عدد عناصر المحتوى

# moduleFunctions.depth
source: Depth
ar: العمق

# moduleFunctions.type
source: Type
ar: النوع

# moduleFunctions.lang
source: Language
ar: اللغة

# error.noAccess.title
source: No access
ar: ممنوع الدخول

# error.noAccess.message
source: You don't have access to this module.
ar: ليس لديك حق الوصول إلى هذه الوُحدة.

# info.noContent.message
source: There are no page information available.
ar: لا توجد معلومات مُتاحة عن الصفحة.

# info.noPageSelected.message
source: Please select a page in the page tree.
ar: الرجاء تحديد صفحة في شجرة الصفحة.
