Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.fileMessages.xlf
Languages: ar, it

source: Cannot copy folder "%s" into target folder "%s", because there is already a folder or file with that name in the target folder!
ar: لا يمكن نسخ المجلد "%s" إلى المجلد المُستهدف "%s"، لأنه يوجد بالفعل مجلد أو ملف بهذا الاسم في المجلد المستهدف!
it: Impossibile copiare la cartella "%s" nella cartella di destinazione "%s", perché c'è già una cartella o un file con quel nome nella cartella di destinazione!

source: Cannot move folder "%s" into target folder "%s", because the target folder is already within the folder to be moved!
ar: لا يمكن نقل المجلد "%s" إلى المجلد المُستهدف "%s"، لأن المجلد المُستهدف موجود بالفعل داخل المجلد المراد نقله!
it: Impossibile spostare la cartella "%s" nella cartella di destinazione "%s", perché la cartella di destinazione è all'interno della cartella da spostare!

# FileUtility.CouldNotAccessAllNecessaryResources
source: Could not access all necessary resources. Source file or destination maybe was not within your mountpoints? T="%s", D="%s"
ar: تعذر الوصول إلى جميع الموارد الضرورية. الملف المصدر أو الوُجهة ربما لم تكن داخل نقاط الجبال الخاصة بك؟ T="%s", D="%s"
it: Impossibile accedere a tutte le risorse necessarie. Forse la sorgente e/o la destinazione non è da te accessibile? S="%s", D="%s"

# FileUtility.CouldNotDeleteDirectory
source: Could not delete directory! Is directory "%s" empty? (You are not allowed to delete directories recursively).
ar: لا يمكن حذف الدليل! هل الدليل "%s" فارغ؟ (لا يسمح لك بحذف الدلائل بشكل متكرر).
it: Impossibile eliminare la cartella! La cartella "%s" è vuota? (Non sei autorizzato a eliminare cartelle in modo ricorsivo).

# FileUtility.CouldNotDeleteDirectory1
source: Could not delete directory "%s"! There might be a problem with write permissions.
ar: لا يمكن حذف الدليل "%s"! قد تكون هناك مشكلة في أذُونات الكتابة.
it: Impossibile eliminare la cartella "%s"! Ci potrebbe essere un problema con i permessi di scrittura.

# FileUtility.CouldNotDeleteFile
source: Could not delete file "%s". There might be a problem with write permissions.
ar: لا يمكن حذف الدليل "%s"! قد تكون هناك مشكلة في أذُونات الكتابة.
it: Impossibile eliminare il file "%s". Ci potrebbe essere un problema con i permessi di scrittura.

# FileUtility.DestinationExistedAlready
source: Destination "%s" already exists!
ar: الوُجهة "%s" موجودة مُسبقاً!
it: La destinazione "%s" esiste già!

# FileUtility.DestinationPathWasNotWithinYourMountpoints
source: Destination path "%s" was not within your mountpoints!
ar: مسار الوُجهة "%s" لم يكن داخل نقطة الوصول الخاصة بك!
it: Il percorso di destinazione "%s" non è da te accessibile!

# FileUtility.DestinationWasNotADirectory
source: Destination "%s" was not a directory.
ar: الوُجهة "%s" لم تكن دليلاً.
it: La destinazione "%s" non è una cartella.

# FileUtility.DirectoryCopiedTo
source: Directory "%s" copied to "%s".
ar: الدليل "%s" تم نسخه إلى "%s".
it: La cartella "%s" è stata copiata in "%s".

# FileUtility.DirectoryCreatedIn
source: Directory "%s" created in "%s".
ar: دليل "%s" تم إنشاؤه في "%s".
it: La cartella "%s" è stata creata in "%s".

# FileUtility.DirectoryMovedTo
source: Directory "%s" moved to "%s".
ar: الدليل "%s" تم نقله إلى "%s".
it: La cartella "%s" è stata spostata in "%s".

# FileUtility.DirectoryNotCreated
source: Directory "%s" not created. There might be a problem with write permissions in "%s"?
ar: الدليل "%s" لم يتم إنشاؤه. قد تكون هناك مشكلة في أذُونات الكتابة في "%s"؟
it: La cartella "%s" non è stata creata. Ci potrebbe essere un problema con i permessi di scrittura in "%s"?

# FileUtility.DirectoryRenamedFromTo
source: Directory renamed from "%s" to "%s".
ar: تمت إعادة تسمية الدليل من "%s" إلى "%s".
it: La cartella "%s" è stata rinominata in "%s".

# FileUtility.DirectoryRenamedFromToCharReplaced
source: Directory renamed from "%s" to "%s". Characters in the new directory name have been replaced.
ar: تمت إعادة تسمية الدليل من "%s" إلى "%s". تم استبدال الأحرف في اسم الدليل الجديد.
it: Cartella rinominata da "%s" a "%s". I caratteri nel nuovo nome della cartella sono stati sostituiti.

# FileUtility.DirectoryRenamedSameName
source: Directory "%s" was not renamed. (Same name as before)
ar: لم يتم تغيير اسم الدليل "%s" (الاسم نفسه كما كان من قبل)
it: La cartella "%s" non è stata rinominata (i nomi coincidono)

# FileUtility.DirectoryWasNotCopiedTo
source: Directory "%s" WAS NOT copied to "%s"! There might be a problem with write permissions
ar: الدليل "%s" لم يتم نسخ "%s"! قد تكون هناك مشكلة في أذُونات الكتابة
it: La cartella "%s" NON È STATA copiata in "%s"! Ci potrebbe essere un problema con i permessi di scrittura

# FileUtility.DirectoryWasNotMovedTo
source: Directory "%s" WAS NOT moved to "%s"! There might be a problem with write permissions
ar: الدليل "%s" لم يتم نقله إلى "%s"! قد تكون هناك مشكلة في أذُونات الكتابة
it: La cartella "%s" NON È STATA spostata in "%s"! Ci potrebbe essere un problema con i permessi di scrittura

# FileUtility.DirectoryWasNotRenamed
source: Directory "%s" was not renamed! There might be a problem with write permissions in "%s"?
ar: الدليل "%s" لم يتم إنشاؤه. قد تكون هناك مشكلة في أذُونات الكتابة في "%s"؟
it: La cartella "%s" non è stata rinominata! Ci potrebbe essere un problema con i permessi di scrittura in "%s"?

# FileUtility.ExtensionOfFileNameIsNotAllowedIn
source: Extension of file name "%s" is not allowed in "%s"!
ar: الإضافة الخاصة باسم الملف "%s" غير مسموح بها في "%s"!
it: L'estensione del nome file "%s" non è consentita in "%s"!

# FileUtility.ExtensionOfFileNameOrWasNotAllowed
source: Extension of file name "%s" or "%s" was not allowed!
ar: الإضافة الخاصة باسم الملف "%s" أو "%s" غير مسموح به!
it: L'estensione del nome file "%s" o "%s" non è consentita!

# FileUtility.ExtensionOfFileWasNotAllowed
source: Extension of file "%s" was not allowed!
ar: الإضافة الخاصة بالملف "%s" غير مسموح به!
it: L'estensione del nome file "%s" non è consentita!

# FileUtility.FileAlreadyExistsInFolder
source: File "%s" already exists in folder "%s"!
ar: الملف "%s" موجود بالفعل في المجلد "%s"!
it: Il file "%s" esiste già nella cartella "%s"!

# FileUtility.FileCopiedTo
source: File "%s" copied to "%s".
ar: الملف "%s" تم نسخه إلى "%s".
it: Il file "%s" è stato copiato in "%s"!

# FileUtility.FileCreated
source: File created: "%s".
ar: تم إنشاء الملف: "%s".
it: File creato: "%s".

# FileUtility.FileNameSanitized
source: The file name "%s" is invalid, the file was automatically renamed to "%s".
ar: اسم الملف "%s" غير صالح، تم تغيير اسم الملف تلقائياً إلى "%s".
it: Il nome file "%s" non è valido, il file è stato rinominato automaticamente in "%s".

# FileUtility.FileExistedAlreadyIn
source: File existed already in "%s"!
ar: الملف موجود بالفعل في"%s"!
it: Il file esisteva già in "%s"!

# FileUtility.FileExtensionIsNotATextfileFormat
source: File extension "%s" is not a textfile format! (%s).
ar: ملف الإضافة "%s" ليس تنسيق ملف نصي! (%s).
it: L'estensione del file "%s" non è un formato di file di testo! (%s).

# FileUtility.FileExtensionIsNotzip
source: File extension is not "zip".
ar: ملف الإضافة ليس "zip".
it: L'estensione del file non è "zip".

# FileUtility.FileMovedTo
source: File "%s" moved to "%s".
ar: الملف "%s" نقل إلى "%s".
it: Il file "%s" è stato spostato in "%s".

# FileUtility.FileNameWasNotAllowed
source: File name "%s" was not allowed!
ar: اسم الملف "%s" غير مسموح به!
it: Il nome file "%s" non è consentito!

# FileUtility.FileOrDestinationWasNotWithinYourMountpoints
source: File "%s" or destination "%s" was not within your mountpoints!
ar: الملف "%s" أو الوُجهة "%s" لم يكن داخل نقاط التبليغ الخاصة بك!
it: Il file "%s" o la destinazione "%s" non è a te accessibile!

# FileUtility.FileOrDirectoryExistedAlready
source: File or directory "%s" already exists!
ar: الملف أو الدليل "%s" موجود مسبقاً!
it: Il file o la cartella "%s" esiste già!

# FileUtility.FileRenamedFromTo
source: File renamed from "%s" to "%s".
ar: تمت إعادة تسمية الملف من "%s" إلى "%s".
it: Il file "%s" è stato rinominato in "%s".

# FileUtility.FileRenamedSameName
source: File "%s" was not renamed. (Same name as before)
ar: لم يتم تغيير اسم الملف "%s" (الاسم نفسه كما كان من قبل)
it: Il file "%s" non è stato rinominato. (Stesso nome come prima)

# FileUtility.FileSavedTo
source: File saved to "%s".
ar: تم حفظ الملف في "%s".
it: File salvato in "%s".

# FileUtility.FileWasNotCopiedTo
source: File "%s" WAS NOT copied to "%s"! There might be a problem with write permissions.
ar: الملف "%s" لم يتم نسخه إلى "%s"! قد تكون هناك مشكلة في أذُونات الكتابة.
it: Il file "%s" NON È STATO copiato in "%s"! Ci potrebbe essere un problema con i permessi di scrittura.

# FileUtility.FileWasNotCreated
source: File "%s" was not created! There might be a problem with write permissions in "%s"?
ar: الملف "%s" لم يتم إنشاؤه. قد تكون هناك مشكلة في أذُونات الكتابة في "%s"؟
it: Il file "%s" non è stato creato! Ci potrebbe essere un problema con i permessi di scrittura in "%s"?

# FileUtility.FileWasNotRenamed
source: File "%s" was not renamed! There might be a problem with write permissions in "%s"?
ar: لم يتم إعادة تسمية الملف "%s" ! قد تكون هناك مشكلة في أُذونات الكتابة في "%s"؟
it: Il file "%s" non è stato rinominato! Ci potrebbe essere un problema con i permessi di scrittura in "%s"?

# FileUtility.FileWasNotSaved
source: File "%s" was not saved! There might be a problem with write permissions.
ar: الملف "%s" لم يتم حفظه. قد تكون هناك مشكلة في أذُونات الكتابة في "%s"؟
it: Il file "%s" non è stato salvato! Ci potrebbe essere un problema con i permessi di scrittura.

# FileUtility.FileWasNotSaved2
source: File "%s" was not saved! File extension rejected!
ar: لم يتم حفظ الملف "%s"! تم رفض ملف الإضافة!
it: Il file "%s" non è stato salvato! L'estensione del file è stata rifiutata!

# FileUtility.NoFileWasUploaded
source: No file was uploaded!
ar: لم يتم تحميل أي ملف!
it: Nessun file caricato!

# FileUtility.NoFileWasUploadedForReplacing
source: No file was uploaded for replacing!
ar: لم يتم تحميل أي ملف ليتم اسبداله!
it: Nessun file caricato per la sostituzione!

# FileUtility.NoNameForNewFolderGiven
source: No name for new folder given!
ar: لا يوجد اسم للمجلد الجديد المُعطى!
it: Nessun nome fornito per la nuova cartella!

# FileUtility.NoUniqueFilenameAvailableIn
source: No unique filename available in "%s"!
ar: لا يوجد اسم فريد للملف في "%s"!
it: Nessun nome file unico disponibile in "%s"!

# FileUtility.ReplacingFileTo
source: Replacing file "%s" to "%s".
ar: استبدال الملف"%s" إلى "%s".
it: Sostituzione file "%s" con "%s".

# FileUtility.TargetAlreadyExists
source: Target "%s" already exists!
ar: الهدف "%s" موجود مُسبقاً!
it: La destinazione "%s" esiste già!

# FileUtility.TargetWasNotAFile
source: Target "%s" was not a file!
ar: الهدف %s" لم يكن ملفاً!
it: La destinazione "%s" non è un file!

# FileUtility.TargetWasNotWithinYourMountpoints
source: Target was not within your mountpoints! T="%s".
ar: الهدف لم يكن مع نقاط الوصول الخاصة بك! T="%s".
it: La destinazione non è da te accessibile! D="%s".

# FileUtility.TheFileDidNotExist
source: The file "%s" did not exist!
ar: الملف '%s' لم يكن موجوداً!
it: Il file "%s" non esiste!

# FileUtility.TheFunctionToCopyAFileBetweenStoragesIsNotYetImplemented
source: The function to copy a file between storages is not yet implemented.
ar: لم يتم تنفيذ وظيفة نسخ ملف بين أماكن التخزين بعد.
it: La funzione per copiare un file tra storage non è ancora stata implementata.

# FileUtility.TheFunctionToCopyAFolderBetweenStoragesIsNotYetImplemented
source: The function to copy a folder between storages is not yet implemented.
ar: لم يتم تنفيذ وظيفة نسخ المجلّد بين أماكن التخزين بعد.
it: La funzione per copiare una cartella tra storage non è ancora stata implementata

# FileUtility.TheFunctionToMoveAFileBetweenStoragesIsNotYetImplemented
source: The function to move a file between storages is not yet implemented.
ar: لم يتم تنفيذ وظيفة نقل ملف بين أماكن التخزين بعد.
it: La funzione per spostare un file tra storage non è stata ancora implementata

# FileUtility.TheFunctionToMoveAFolderBetweenStoragesIsNotYetImplemented
source: The function to move a folder between storages is not yet implemented.
ar: لم يتم تنفيذ وظيفة نقل المجلّد بين أماكن التخزين بعد.
it: La funzione per spostare una cartella tra storage non è stata ancora implementata.

# FileUtility.TheUploadHasFailedNoUploadedFileFound
source: The upload has failed, no uploaded file found!
ar: فشل في التحميل، لم يتم العثور على الملف المُراد تحميله!
it: Il caricamento non ha funzionato, nessun file caricato è stato trovato!

# FileUtility.TheUploadedFileExceedsTheSize-limit
source: The uploaded file "%s" exceeds the size-limit
ar: الملف الذي تم تحميله "%s" يتجاوز الحد الأقصى للحجم
it: Il file caricato "%s" eccede le dimensioni consentite

# FileUtility.UnzippingFileIn
source: Unzipping file "%s" in "%s".
ar: فك ضغط الملف "%s" في "%s".
it: Decompressione del file "%s" in "%s".

# FileUtility.UploadedFileCouldNotBeMoved
source: Uploaded file could not be moved! There might be a problem with write permissions in "%s"?
ar: تعذر نقل الملف الذي تم تحميله! قد تكون هناك مشكلة في الأُذونات في "%s"؟
it: Il file caricato non può essere spostato! Potrebbe esserci un problema con i permessi di scrittura in "%s"?

# FileUtility.UploadingFileTo
source: Uploading file "%s" to "%s".
ar: يتم تحميل الملف "%s" إلى "%s".
it: Caricamento del file "%s" in "%s".

# FileUtility.YouAreNotAllowedToAccessTheDirectory
source: You are not allowed to access the directory.
ar: غير مسموح لك بالوصول إلى هذا الدليل.
it: Non sei autorizzato ad accedere alla cartella.

# FileUtility.YouAreNotAllowedToAccessTheFile
source: You are not allowed to access the file.
ar: غير مسموح لك بالوصول إلى هذا الملف.
it: Non sei autorizzato ad accedere al file.

# FileUtility.YouAreNotAllowedToCopyDirectories
source: You are not allowed to copy directories.
ar: غير مسموح لك بنسخ هذا الدليل.
it: Non sei autorizzato a copiare cartelle.

# FileUtility.YouAreNotAllowedToCopyFiles
source: You are not allowed to copy files.
ar: غير مسموح لك بنسخ هذا الملف.
it: Non sei autorizzato a copiare file.

# FileUtility.InvalidFolderName
source: Invalid folder name "%s"!
ar: اسم المُجلد غير صالح "%s"!
it: Nome cartella "%s" non valido!

# FileUtility.YouAreNotAllowedToCreateDirectories
source: You are not allowed to create directories!
ar: غير مسموح لك بإنشاء أي دليل أو مرجع!
it: Non sei autorizzato a creare cartelle!

# FileUtility.YouAreNotAllowedToCreateFiles
source: You are not allowed to create files!
ar: غير مسموح لك بإنشاء الملفات!
it: Non sei autorizzato a creare file!

# FileUtility.YouAreNotAllowedToEditFiles
source: You are not allowed to edit files!
ar: غير مسموح لك بتعديل الملفات!
it: Non sei autorizzato a modificare file!

# FileUtility.YouAreNotAllowedToMoveDirectories
source: You are not allowed to move directories.
ar: غير مسموح لك بنقل أي دليل أو مرجع.
it: Non sei autorizzato a spostare cartelle.

# FileUtility.YouAreNotAllowedToMoveFiles
source: You are not allowed to move files.
ar: غير مسموح لك بنقل الملفات.
it: Non sei autorizzato a spostare file.

# FileUtility.YouAreNotAllowedToOverride
source: You are not allowed to override "%s"!
ar: غير مسموح لك بتجاوز "%s"!
it: Non sei autorizzato a sovrascrivere "%s"!

# FileUtility.YouAreNotAllowedToRenameDirectories
source: You are not allowed to rename directories!
ar: غير مسموح لك بإعادة تسمية أي الدليل!
it: Non sei autorizzato a rinominare cartelle!

# FileUtility.YouAreNotAllowedToRenameFiles
source: You are not allowed to rename files!
ar: غير مسموح لك بإعادة تسمية الملفات!
it: Non sei autorizzato a rinominare file!

# FileUtility.YouAreNotAllowedToUnzipFiles
source: You are not allowed to unzip files.
ar: غير مسموح لك بفك ضغط الملفات.
it: Non è consentito decomprimere file.

# FileUtility.YouAreNotAllowedToUploadFiles
source: You are not allowed to upload files!
ar: غير مسموح لك بتحميل الملفات!
it: Non sei autorizzato a caricare file.

# FileUtility.YouDontHaveFullAccessToTheDestinationDirectory
source: You don't have full access to the destination directory "%s"!
ar: ليس لديك حق الوصول الكامل إلى الدليل المُستهدف "%s"!
it: Non hai accesso completo alla cartella di destinazione "%s"!
