Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# pagetree.image_descr
source: An example of a Page Tree in TYPO3. The page tree is available under any of the Web sub-modules in the menu. Clicking the icon of a page displays a context sensitive menu with options for that particular page. Clicking the title of a page in the page tree will load the right frame with the current submodule. The page id is passed to the module so it displays content related to the page you clicked. Holding the mouse pointer over a page icon for a few seconds will display tool-tip information telling you details about the state of the page. Here a page is access restricted and you will be told which group the access is set for by the tool-tip.
ar: مثال على شجرة الصفحة في TYPO3. شجرة الصفحة متاحة تحت أي من الوحدات الفرعية للويب في القائمة. يؤدي النقر فوق رمز الصفحة إلى عرض قائمة مع خيارات لتلك الصفحة المعينة. سيؤدي النقر فوق عنوان الصفحة في شجرة الصفحة إلى تحميل الإطار الأيمن بالوحدة الفرعية الحالية. يتم تمرير مُعرّف الصفحة إلى الوحدة النمطية بحيث يعرض المحتوى المرتبط بالصفحة التي نقرت عليها. سيؤدي الاستمرار في الضغط بمؤشر الفأرة فوق رمز الصفحة لبضع ثوانٍ إلى عرض معلومات تلميح أداة تخبرك بتفاصيل حول حالة الصفحة. هنا يتم تقييد الوصول إلى الصفحة وسيتم إخبارك بالمجموعة التي تم تعيين الوصول لها بواسطة تلميح الأداة.
fr: Un exemple d'arborescence dans TYPO3. L'arborescence est disponible pour tous les sous-modules du module Web. Cliquer l'icône d'une page affiche un menu contextuel avec des options pour cette page en particulier. Cliquer le titre d'une page dans l'arborescence chargera le cadre de droite avec le sous-module courant. L'id de la page est passé au module donc il affiche le contenu relatif à la page cliquée. Maintenir le pointeur de la souris au-dessus de l'icône d'une page pendant quelques secondes affichera une bulle d'information vous donnant des détails sur l'état de la page. Ici une page à accès restreint et on vous dit pour quel groupe l'accès est spécifié dans la bulle.
it: Un esempio di un Albero delle Pagine in TYPO3. L'albero delle pagine è disponibile per ogni voce del menù Web. Il clic sull'icona di una pagina, mostra un menù contestuale con opzioni per quella particolare pagina. Il clic sul titolo di una pagina, nell'albero delle pagine, caricherà il contenuto relativo alla voce corrente. L'id della pagina viene passato al modulo, così che possa essere mostrato il contenuto relativo alla pagina cliccata. Posizionando il puntatore del mouse sull'icona di una pagina, per qualche secondo, mostrerà un tooltip con dettagli sullo stato della pagina: id della pagina, accesso limitato a gruppi di utenti o date di pubblicazione.

# filetree.alttitle
source: The Folder Tree
ar: شجرة المُجلّد
fr: L'arborescence des dossiers
it: L'Albero delle Cartelle

# filetree.description
source: Shows the directory structure of a mounted path on the webserver. You can browse the folder tree like you are used to browse the file system on your own computer.
ar: يظهر هيكل الدليل لمسار مُثبت على خادم الويب. يمكنك تصفح شجرة المُجلّد كما تستخدم لتصفح نظام الملفات على جهاز الكمبيوتر الخاص بك.
fr: Cela montre la structure de répertoire d'un point de montage du serveur. Vous pouvez parcourir le dossier d'arborescence comme vous le faites habituellement avec le système de fichier sur votre ordinateur.
it: Mostra la struttura della cartella di un percorso montato sul server web. Tu puoi navigare nell'albero come se tu stessi usando un file system sul tuo computer.

# filetree.details
source: The Folder Tree is available for any sub-module of the File main module in TYPO3. The File module is like a little web-based FTP-client inside of TYPO3 which allows you to upload, rename, copy, move, delete and edit files inside TYPO3. Most users of TYPO3 doesn't need access to the File module and sub-modules in order to upload images on web-pages. They can do this directly when editing Content Elements. But the File module is useful for maintaining collections of files on the server, for example an image archive or files for download. <b>Navigating the Folder Tree</b> You can expand and contract the folder tree by the +/- icons. Clicking a folder icon will display a pop-up menu with options related to that particular folder. Options include copy/cut/paste, rename, upload etc. Clicking the folder title will load the currently active sub-module in the right frame of the backend. The sub-module will typically show files and folders inside the folder you clicked. <b>Granting access to the Folder Tree</b> The administrator needs to allow backend users to access the File modules and in addition make a file mount available to them before they can use the Folder Tree.
ar: شجرة المجلد متاحة لأي وحدة فرعية من وحدة الملفات الرئيسية في TYPO3. تشبه وحدة الملفات برنامَج FTP صغير على الويب داخل TYPO3 والذي يسمح لك بتحميل الملفات وإعادة تسميتها ونسخها ونقلها وحذفها وتحريرها داخل TYPO3. لا يحتاج معظم مستخدمي TYPO3 الوصول إلى وحدة الملفات والوحدات الفرعية من أجل تحميل الصور على صفحات الويب. يمكنهم القيام بذلك مباشرة عند تحرير عناصر المحتوى. لكن الوحدة النمطية File مفيدة في الاحتفاظ بمجموعات من الملفات على الخادم، على سبيل المثال محفوظات الصور أو الملفات للتنزيل. <b>التنقل في شجرة المجلد</b> يمكنك توسيع شجرة المجلد وتقليصها بواسطة أيقونات +/-. سيؤدي النقر فوق رمز المجلد إلى عرض قائمة منبثقة بها خيارات متعلقة بهذا المجلد المحدد. تشمل الخيارات نسخ / قص / لصق، إعادة تسمية، تحميل، إلخ. سيؤدي النقر فوق عنوان المجلد إلى تحميل الوحدة الفرعية النشطة حالياً في الإطار الأيمن للواجهة الخلفية. ستعرض الوحدة الفرعية عادةً الملفات والمجلدات داخل المجلد الذي نقرت عليه. <b>منح حق الوصول إلى شجرة المجلد</b> يحتاج المسؤول إلى السماح لمستخدمي الواجهة الخلفية بالوصول إلى الوحدات النمطية للملف بالإضافة إلى إتاحة تحميل مِلَفّ لهم قبل أن يتمكنوا من استخدام شجرة المجلد.
fr: L'arborescence des dossiers est disponible pour tous les sous-modules du module principal Fichiers dans TYPO3. Le module de fichiers est comme un client FTP à l'intérieur de TYPO3 qui permet d'envoyer, renommer, copier, déplacer, effacer et éditer des fichiers dans TYPO3. La plupart des utilisateurs de TYPO3 n'ont pas besoin d'accéder au module Fichiers et aux sous-modules pour envoyer des images sur les pages web. Ils peuvent le faire directement quand ils éditent des éléments de contenu. Mais le module Fichiers est utile pour maintenir une collection de fichiers sur le serveur, par exemple une archive d'images ou des fichiers à télécharger. <b>Naviguer dan l'arborescence des dossiers</b> Vous pouvez déplier et plier l'arborescence des dossiers avec les icônes +/-. Cliquer un icône de dossier affichera un menu contextuel avec des options relatifs à ce dossier. Les options incluent le copier/couper/coller, renommer, envoyer, etc… Cliquer le titre d'un dossier rechargera le sous-module actif dans le cadre droit du backend. Le sous-module affichera typiquement des fichiers et dossiers à l'intérieur du dossier cliqué. <b>Permettre l'accès à l'arborescence des dossiers</b> L'administrateur doit permettre aux utilisateurs du backend d'accéder au module Fichiers et de plus leur créer un point de montage accessible avant qu'ils puissent utiliser l'arborescence des dossiers.
it: L'albero delle Cartelle è disponibile per ogni modulo dell'area File in TYPO3. L'area File è come un piccolo client FTP basato su web all'interno di TYPO3 che consente di caricare, rinominare, copiare, spostare, eliminare e modificare i file e cartelle all'interno di TYPO3. La maggior parte degli utenti di TYPO3 non ha bisogno di accedere ai moduli di File per caricare le immagini sulle pagine web. Possono farlo direttamente dagli Elementi di Contenuto. L'area File è utile per mantenere raccolte di file sul server, per esempio un archivio di immagini o file da scaricare. <b>Navigazione dell'Albero delle Cartelle</b> È possibile espandere e contrarre l'albero delle cartelle facendo clic sulle relative icone a triangolo (rotante). Facendo clic sull'icona di una cartella verrà visualizzato un menù contestuale con le opzioni relative a quella particolare cartella. Le opzioni includono copia/taglia/incolla, rinomina, carica, ecc. Facendo clic sul titolo della cartella verrà caricato, nel riquadro destro del backend, il modulo attualmente attivo. Il modulo mostrerà, in genere, file e cartelle all'interno della cartella che hai cliccato. <b>Concedere l'accesso all'Albero delle Cartelle</b> L'amministratore deve consentire agli utenti di backend di accedere ai moduli dell'area File e inoltre rendere disponibile almeno un nodo, dell'Albero delle Cartelle, prima di poterlo utilizzare.

# _filetree.seeAlso
source: be_groups:groupMods, be_groups:file_mountpoints, be_users:file_mountpoints, Managing files in TYPO3 | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Uploading Files | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/, Details about file mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/, sys_filemounts, xMOD_csh_corebe:filelist_module
ar: be_groups:groupMods, be_groups:file_mountpoint be_users:file_mountpoint إدارة الملفات في TYPO3 <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ تحميل الملفات <unk> https://docs.typo3. rg/typo3cms/GettingStartedtutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/، تفاصيل حول شكل الملفات <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/، sys_filemounts، xMOD_csh_corebe:filelist_modul.
fr: be_groups:groupMods, be_groups:file_mountpoints, be_users:file_mountpoints, Gestion des fichiers dans TYPO3 | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Téléchargement de fichiers | https://docs.typo3. rg/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/, Détails sur les montages de fichiers | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/, sys_filemounts, xMOD_csh_corebe:filelist_module
it: be_groups:groupMods, be_groups:file_mountpoints, be_users:file_mountpoints, Gestire i file in TYPO3 | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/ManagingFilesInTypo3/ Caricare File | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/, Dettagli sui "File Mounts" | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/, sys_filemounts, xMOD_csh_corebe:filelist_module

# filetree.image_descr
source: The Folder Tree of the "fileadmin/" folder. This is mounted by default for "Admin"-users. Other users will have to have a file mount configured for them first. Clicking the icon of a folder displays the context menu of the folder. If you click the folder title in the Folder Tree you will see the sub-module loaded in the right frame. Here it is the File > Filelist module that will display files and folders inside. Clicking the icon of a file will display a context menu for the file.
ar: شجرة المجلد للمجلد "fileadmin /". يتم تحميل هذا بشكل افتراضي لمستخدمي "المسؤول". سيتعين على المستخدمين الآخرين تكوين مِلَفّ تحميل لهم أولاً. يؤدي النقر فوق رمز المجلد إلى عرض قائمة السياق الخاصة بالمجلد. إذا ضغطت فوق عنوان المجلد في Folder Tree ، فسترى الوحدة النمطية الفرعية محملة في الإطار الأيمن. ها هو الملف > . وحدة قائمة الملفات التي ستعرض الملفات والمجلدات بالداخل. سيؤدي النقر فوق رمز الملف إلى عرض قائمة سياق للملف.
fr: L'arborescence des dossiers du dossier "fileadmin/". C'est monté par défaut pour les utilisateurs "Admin". Les autres utilisateurs doivent avoir d'abord un point de montage configuré pour eux. Cliquer un icône de dossier affichera un menu contextuel pour ce dossier. Si vous cliquez le titre d'un dossier dans l'arborescence des dossiers, vous verrez le sous-module chargé dans le cadre droit. Ici, c'est le module Fichiers > Liste des fichiers qui affichera les fichiers et les dossiers à l'intérieur. Cliquer l'icône d'un fichier affichera un menu contextuel pour ce fichier.
it: L'albero delle cartelle di "fileadmin/". È montato per impostazione predefinita per gli utenti "Admin". Gli altri utenti dovranno prima avere configurato un "File Mounts". Facendo clic sull'icona di una cartella viene visualizzato il menù contestuale della cartella. Se fai clic sul titolo della cartella nell'albero delle cartelle vedrai il modulo caricato nel riquadro a destra. Ecco il modulo "File>Lista File" che mostrerà i file e le cartelle all'interno. Facendo clic sull'icona di un file verrà visualizzato un menù contestuale per il file.

# tcatree.collapseAll
source: Collapse All
ar: طَيّ الجدول
fr: Tout réduire
it: Contrai tutto

# tcatree.expandAll
source: Expand All
ar: توسيع الكل
fr: Déplier tout
it: Espandi tutto

# tcatree.toggleHideUnchecked
source: hide/show unchecked items
ar: إخفاء/إظهار العناصر غير المُحددة
fr: cacher/afficher les éléments non cochés
it: mostra/nascondi elementi non selezionati

# tcatree.findItem
source: Find Item
ar: البحث عن عنصر
fr: Rechercher un élément
it: Trova elemento

# list_module.alttitle
source: The Web>List module
ar: وحدة ويب>القائمة
fr: Le module Web>Liste
it: Modulo Web>Lista

# list_module.description
source: Listing records located on a page. From here you can copy/cut/paste records around in the system. You can edit records, access the change history of elements etc.
ar: تسجيل السجلات الموجودة في الصفحة. من هنا يمكنك نسخ، قص أو لصق السجلات في النظام. يمكنك تعديل السجلات، والوصول إلى سجل تغيير العناصر، إلخ.
fr: Liste les enregistrements d'une page. À partir d'ici, vous pouvez copier/couper/coller les enregistrements du système. Vous pouvez éditer les enregistrements, accèder à l'historique des modifications etc.
it: Elenca i record di una pagina. Da qui puoi copiare/tagliare/incollare i record per tutto il sistema. Puoi modificare i record, accedere alla cronologia degli elementi, ecc.

# list_module.details
source: The list module is like the file manager in an Operating System; it provides basic access to all "elements" available in the system. In TYPO3 almost all information is stored in the database and managed after the same principles internally. For instance Content Elements representing page content are database records just like backend users are. The Web>List module allows us to create, modify and delete both kinds of records after the same principles. The Web>List module might not be the best "view" of the content on a page for any situation. For instance if you want to manage website content on a page (Content Elements) you should rather use the "Web>Page" module which is designed to display content elements more optimized. But the List module will always give you access to whatever is on the page in a basic way if no better module is available for management. <b>Single-table mode</b> If you click the table title in the listing you will enter single-table mode. In this mode you can select additional fields from the table to show in the listing. Also you will get additional editing facilities, for instance you will be able to edit multiple records at a time and even only certain fields from those records. See the screenshot for more details.
ar: وحدة القائمة هذه تشبه مدير الملفات في نظام التشغيل؛ إنها توفر الوصول الأساسي إلى جميع "العناصر" المُتاحة في النظام. تقريباً يتم تخزين جميع المعلومات في TYPO3 في قاعدة البيانات وتدار وفقاً لنفس المبادئ داخلياً. على سبيل المثال، عناصر المحتوى التي تمثل محتوى الصفحة هي سجلات قاعدة البيانات تماماً مثل مستخدمي الواجهة الخلفية. تتيح لنا وحدة الويب > القائمة إنشاء وتعديل وحذف كلا النوعين من السجلات على نفس المبادئ. قد لا تكون وحدة قائمة الويب> أفضل "عرض" للمحتوى على الصفحة لأي حالة. على سبيل المثال، إذا كنت ترغب في إدارة محتوى الموقع على صفحة (عناصر المحتوى) يجب أن تستخدم وحدة "Web>Page" المصممة لعرض عناصر المحتوى بشكل أفضل. لكن وحدة القائمة ستعطيك دائماً حق الوصول إلى كُل ما هو موجود في الصفحة بطريقة أساسية إذا لم تكن هناك وحدة أفضل متاحة للإدارة. <b>وضع جدول واحد</b> إذا قمت بالنقر على عنوان علامة التبويب في القائمة فإنك ستدخل وضع جدول واحد. في هذا الوضع يمكنك تحديد حقول إضافية من الجدول لإظهارها في القائمة. كما ستحصل على المزيد من مرافق التحرير، على سبيل المثال ستتمكن من تحرير سجلات متعددة في وقت واحد وحتى حقول معينة فقط من تلك السجلات. راجع لقطة الشاشة لمزيد من التفاصيل.
fr: Le module Liste est comme un gestionnaire de fichier d'un OS : il fournit un accès à tous les "éléments" disponibles du système. Dans TYPO3, la plupart des informations sont enregistrées dans la base de données et gérées de la même manière. Les éléments de contenu représentant le contenu d'une page sont des enregistrements de la base de données tout comme le sont les utilisateurs du backend. Le module Web>Liste nous permet de créer, modifier et effacer toutes les sortes d'enregistrements selon les mêmes principes. Le module Web>Liste peut ne pas être la meilleure façon de "voir" le contenu d'une page dans certain cas. Par exemple si vous voulez gérer le contenu d'une page (éléments de contenu), vous devriez plutôt utiliser le module "Web>Page", qui est prévu pour ça. Mais le module Liste vous donnera toujours accès à ce qui est sur la page d'une manière basique s'il n'y a pas de meilleur module accessible pour la gestion. <b>Mode table unique</b> Si vous cliquez sur le titre d'une table dans la liste, vous entrez dans le mode table unique. Dans ce mode, vous pouvez sélectionner d'autres champs de la table à afficher. De plus, vous aurez d'autres outils d'édition, par exemple vous pourrez éditer plusieurs enregistrements en même temps et même seulement certains champs de ces enregistrements. Voyez la capture d'écran pour plus de détails.
it: Il modulo "Lista" è come il file manager in un Sistema Operativo; fornisce l'accesso di base a tutti gli "elementi" disponibili nel sistema. In TYPO3 quasi tutte le informazioni sono memorizzate nel database e gestite secondo gli stessi principi internamente. Per esempio gli elementi di contenuto, che rappresentano il contenuto della pagina, sono record del database proprio come gli utenti di backend. Il modulo "Web>Lista" ti permette di creare, modificare ed eliminare entrambi i tipi di record secondo gli stessi principi. Il modulo "Web>Lista" potrebbe non essere la migliore modalità di visualizzazione del contenuto di una pagina per ogni situazione. Per esempio, se vuoi gestire il contenuto di un sito web su una pagina (Elementi di Contenuto) si dovrebbe piuttosto utilizzare il modulo "Web>Pagina" che è progettato per visualizzare gli elementi di contenuto con posizionamento ottimizzati. Ma il modulo Lista ti darà sempre accesso a tutto ciò che è sulla pagina in modo base, se non è disponibile un modulo migliore per la gestione. <b>Modalità singola-tabella</b> Se fai clic sul titolo della tabella nell'elenco entrerai in modalità singola-tabella. In questa modalità è possibile selezionare campi aggiuntivi dalla tabella da mostrare nella lista. Inoltre otterrai ulteriori modalità di modifica, per esempio sarai in grado di modificare più record alla volta e anche solo alcuni campi da tali record. Vedi l'immagine per maggiori dettagli.

# _list_module.seeAlso
source: xMOD_csh_corebe:pagetree, xMOD_csh_corebe:list_module_root, xMOD_csh_corebe:filelist_module, xMOD_csh_corebe:TCEforms Selective Editing | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/SelectiveEditing/ The List module ("Inside TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/,
ar: xMOD_csh_corebe:pagetree, xMOD_csh_corebe:list_module_root, xMOD_csh_corebe:filelist_module, xMOD_csh_corebe:TCEforms التحرير الانتقائي | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/SelectiveEditing/ وحدة القائمة ("داخل TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/,
fr: xMOD_csh_corebe:pagetree, xMOD_csh_corebe:list_module_root, xMOD_csh_corebe:filelist_module, xMOD_csh_corebe:TCEforms Édition sélective | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/SelectiveEditing/ Le module Liste ("Inside TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/,
