Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_sysfilereference.xlf
Languages: ar, fr, it

# alternative.description
source: Sets the alternative text of this asset.
ar: قم بتعيين النص البديل لهذا الأصل.
fr: Définit le texte alternatif de cette ressource.
it: Imposta il testo alternativo di questa risorsa.

# alternative.details
source: When using the img element, specify a short text alternative with the alt attribute. Note. The value of this attribute is referred to as "alt text". When an image contains words that are important to understanding the content, the alt text should include those words. This will allow the alt text to play the same function on the page as the image. Note that it does not necessarily describe the visual characteristics of the image itself but must convey the same meaning as the image.
ar: عند استخدام عنصر img ، حدد نص بديل قصير مع خاصيّة alt. ملاحظة: يُشار إلى قيمة هذه السمة باسم "alt text". عندما تحتوي الصورة على كلمات مهمة لِفهم المُحتوى، يجب أن يتضمن النص البديل تلك الكلمات. هذا سيسمح للنص البديل بتشغيل نفس الوظيفة في الصفحة كالصورة. ويلاحظ أنه لا يصف بالضرورة الخصائص البصرية للصورة نفسها بل يجب أن ينقل نفس المعنى الذي تعبر عنه الصورة.
fr: Lorsque vous utilisez l'élément img, spécifiez une alternative de texte court avec l'attribut alt. Note. La valeur de cet attribut est appelée "texte alt". Lorsqu'une image contient des mots importants pour comprendre le contenu, le texte alt doit inclure ces mots. Cela permettra au texte alt de jouer la même fonction sur la page que l'image. Notez qu'il ne décrit pas nécessairement les caractéristiques visuelles de l'image elle-même, mais qu'il doit transmettre le même sens que l'image.
it: Quando si utilizza l'elemento di img, specificare un'alternativa di testo con l'attributo alt. Nota: il valore di questo attributo è indicato come "testo alt". Quando un'immagine contiene parole che sono importanti per capire il contenuto, il testo alt dovrebbe includere quelle parole. Questo permetterà al testo alt di riprodurre la stessa funzione sulla pagina dell'immagine. Nota che non descrive necessariamente le caratteristiche visive dell'immagine stessa, ma deve trasmettere lo stesso significato dell'immagine.

# link.description
source: Sets a link on this asset.
ar: قم بتعيين رابط على هذا الأصل.
fr: Définit un lien sur cette ressource.
it: Imposta un collegamento per questa risorsa.

# link.details
source: Use the wizard next to the field to specify a link that a user can follow by clicking the image.
ar: استخدم المُعالج بجانب الحقل لتحديد الرابط الذي يُمكن للمستخدم أن يتبعه بالنقر على الصورة.
fr: Utilisez l'assistant à côté du champ pour spécifier un lien qu'un utilisateur peut suivre en cliquant sur l'image.
it: Usare la procedura guidata, accanto al campo, per specificare un collegamento che un utente può seguire facendo clic sull'immagine.

# title.description
source: Sets the title text of this asset.
ar: قم بتعيين عنوان هذا الأصل.
fr: Définit le texte alternatif de cette ressource.
it: Imposta il testo del titolo di questa risorsa.

# title.details
source: The title attribute is used to provide additional information to help clarify or further describe the purpose of a link. If the supplementary information provided through the title attribute is something the user should know before following the link, such as a warning, then it should be provided in the link text rather than in the title attribute.
ar: تستخدم خاصيّة العنوان لتوفير معلومات إضافية للمساعدة في توضيح الغرض من الرابط أو زيادة وَصفِه. إذا كانت المعلومات التكميلية المُقدمة من خلال خاصيّة العنوان هي شيء يجب أن يعرفُه المُستخدم قبل اتباع الرابط، مثل التحذير، ثم يجب أن يتم توفيره في نص الرابط وليس في خاصيّة العنوان.
fr: L'attribut titre est utilisé pour fournir des renseignements supplémentaires afin de clarifier ou de mieux décrire l'objet d'un lien. Si les informations supplémentaires fournies par l'attribut titre sont quelque chose que l'utilisateur doit savoir avant de suivre le lien, comme un avertissement, alors il devrait être fourni dans le texte du lien plutôt que dans l'attribut titre.
it: L'attributo 'title' viene utilizzato per fornire informazioni aggiuntive che aiutino a chiarire o descrivere ulteriormente lo scopo di un collegamento. Se le informazioni aggiuntive fornite, attraverso l'attributo title, riguardano qualcosa che l'utente dovrebbe conoscere prima di seguire il collegamento, come per esempio un avvertimento, allora questo tipo di informazione dovrebbe essere fornita nel testo del collegamento, anziché nell'attributo 'title'.

# description.description
source: Sets the image-caption-text of this asset.
ar: قم بتعيين النص التوضيحي للصورة لهذا الأصل.
fr: Définit le texte de la légende de l'image.
it: Imposta la didascalia dell'immagine di questa risorsa.

# description.details
source: This text will be displayed underneath your asset and can be used to supply additional context to the image. Depending on local laws you might have to use this to supply proper copyright information on your assets.
ar: سيتم عرض هذا النص أدنى الأصل الخاص بك ويمكن استخدامه لتوفير سياق إضافي للصورة. اعتماداً على القوانين المحلية قد تضطر إلى استخدام هذا لتوفير معلومات حقوق التأليف والنشر الصحيحة على أصولك.
fr: Ce texte sera affiché sous votre image et pourra être utilisé pour fournir un contexte supplémentaire à l'image. Selon les lois locales, vous pourriez avoir à utiliser ceci pour fournir des informations appropriées sur vos images (copyright).
it: Questo testo verrà mostrato sotto la risorsa e può essere utilizzato per fornire un ulteriore contesto all'immagine. A seconda della legislazione locale, è possible che questo debba essere utilizzato per inserire le opportune informazioni di copyright riguardanti le risorse.

# crop.description
source: Click "Open Editor" to start up the image editor.
ar: انقر فوق "فتح التعديل" لبدء محرر الصورة.
fr: Cliquez sur "Ouvrir l'éditeur" pour démarrer l'éditeur d'image.
it: Fai clic su "Apri editor" per avviare l'editor di immagini.

# autoplay.description
source: Check to let embedded media play once loaded.
ar: تحقق للسماح لتشغيل الوسائط المضمنة بمجرد تحميلها.
fr: Cochez cette case pour lancer la lecture des médias intégrés dès qu'ils sont chargés.
it: Seleziona per riprodurre il file multimediale una volta caricato.
