Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_mfa_provider.xlf
Languages: ar, it

# totp.title
source: Time-based one-time password
ar: كلمة مرور لمرة واحدة لمدة محدودة
it: Password monouso a scadenza

# totp.description
source: This provider allows to authenticate with a single-use passcode which is based on the current time. Each code is only valid for 30 seconds. You need an OTP application or device, supporting such tokens.
ar: يُتيح هذا المزود المُصادقة باستخدام رمز لمَرة واحدة يعتمد على الوقت الحالي. كل رمز صالح فقط لمدة 30 ثانية. تحتاج إلى تطبيق أو جهاز OTP الذي يدعم مثل هذه الرموز.
it: Questo provider consente di autenticarsi con un codice di accesso monouso basato sull'ora corrente. Ogni codice è valido solo per 30 secondi. Hai bisogno di un'applicazione o dispositivo OTP, che supporti tali token.

# totp.setupInstructions
source: The time-based one-time password provider enables you to strengthen your accounts' security by requiring a six-digit code on every login. This provider is based on a shared secret, which will be exchanged between your OTP application (or device) and TYPO3. Each code takes the current time into account and is only valid for 30 seconds. Setting up: 1. Scan the QR-code or directly enter the shared secret in your application or device 2. Add a specific name for this provider (optional) 3. Enter the generated six-digit code in the corresponding field 4. Submit the form to activate the provider Note: In case your application supports otpauth:// urls, you can retrieve the url by clicking on the info button next to the shared secret.
ar: يُمكّنُكَ "مُوفر كلمة المرور لمرة واحدة، المستند إلى الوقت" من تعزيز أمان حساباتك من خلال طلب رمز مُكوّن من سِتة أرقام عند كل تسجيل دخول. يعتمد هذا المُزود على الأمان المُشترك، والذي سيتم تبادله بين تطبيق OTP (أو الجهاز) و TYPO3. يأخذ كل رمز الوقت الحالي في الاعتبار وهو صالح لمدة 30 ثانية فقط. الإعدادات: 1. امسح رمز QR ضوئياً أو أدخل كلمة السر مباشرةً في تطبيقك أو جهازك. 2. أضف اسماً مُحدداً لهذا المزود (اختياري) 3. أدخل الرمز المكون من سِتة أرقام في الحقل المقابل 4. أرسل النموذج لتفعيل المزود. ملاحظة: في حال كان التطبيق الخاص بك يدعم الـ otpauth: // urls، يمكنك استرداد عنوان url بالنقر فوق زر المعلومات بجوار كلمة السر.
it: Il provider di password monouso a scadenza ti consente di rafforzare la sicurezza dei tuoi account richiedendo un codice a sei cifre su ogni accesso. Questo provider si basa su una chiave segreta condivisa, che verrà scambiata tra l'applicazione o il dispositivo OTP e TYPO3. Ogni codice riporta l'ora corrente ed è valido solo per 30 secondi. Impostazione: 1. Scansiona il codice QR o inserisci direttamente la chiave segreta condivisa nell'applicazione o nel dispositivo 2. Aggiungi un nome specifico per questo provider (opzionale) 3. Inserisci il codice generato a sei cifre nel campo corrispondente 4. Invia il modulo per attivare il provider. Nota: nel caso in cui l'applicazione supporti il protocollo otpauth://, è possibile recuperare l'url cliccando sul pulsante info accanto al chiave segreta condivisa.

# recoveryCodes.title
source: Recovery codes
ar: رمز الاستعادة
it: Codici di recupero

# recoveryCodes.description
source: This provider allows to authenticate with a set of single-use passcodes, in case you lost your primary MFA credentials, or just have no access to them temporarily.
ar: يسمح هذا الموفر بالمصادقة باستخدام مجموعة من رموز المرور أحادية الاستخدام، في حال فقدت بيانات اعتماد MFA الأساسية، أو عدم إمكانية الوصول إليها مؤقتاً.
it: Questo provider permette di autenticarsi con un insieme di codici monouso, nel caso tu abbia perduto le tue credenziali MFA primarie o semplicemente tu non abbia accesso a queste temporaneamente.

# recoveryCodes.setupInstructions
source: Recovery codes are random eight-digit codes which can be used to authenticate, in case your lost your main authentication credentials. Each code is only valid once. As soon as all recovery codes are exhausted, you're required to generate a new set. Therefore, periodically check the amount of remaining codes in the Edit / Change view of the provider. Setting up: 1. Copy the recovery codes and store them at a safe place 2. Add a specific name for this provider (optional) 3. Submit the form to activate the provider - see below note Note: Since the recovery codes are being encrypted and stored securely, this process can take some time.
ar: رموز الاسترداد هي رموز عشوائية مكونة من ثمانية أرقام يمكن استخدامها للمصادقة، في حالة فقدان بيانات اعتماد المصادقة الرئيسية الخاصة بك. كل رمز صالح لمرة واحدة فقط. <unk> <unk> <unk> <unk> <unk> بمجرد استنفاد جميع رموز الاسترداد، يجب عليك إنشاء مجموعة جديدة. لذلك، تحقق دورياً من كمية الرموز المتبقية في عرض تعديل / تغيير مقدم الخدمة. <unk> <unk> <unk> <unk> <unk> إعداد: <unk> <unk> <unk> <unk> 1. انسخ رموز الاسترداد وتخزينها في مكان آمن <unk> <unk> <unk> <unk> <unk> 2. إضافة اسم محدد لهذا المزود (اختياري) <unk> <unk> <unk> <unk> 3. قم بتقديم النموذج لتفعيل المزود - انظر أدناه الملاحظة <unk> <unk> <unk> <unk> <unk> ملاحظة: لما كان رموز الاسترداد يتم تشفيرها وتخزينها بشكل آمن، ويمكن أن تستغرق هذه العملية بعض الوقت.
it: I codici di recupero sono codici casuali a otto cifre che possono essere utilizzati per autenticarsi, nel caso in cui le credenziali principali siano state perse. Ogni codice è valido solo una volta. Non appena tutti i codici di recupero saranno esauriti, sarà necessario generarne una nuova serie. Pertanto, controlla periodicamente la quantità di codici rimanenti in Modifica / Cambia del provider. Configurazione: 1. Copiare i codici di recupero e memorizzarli in un luogo sicuro 2. Aggiungi un nome specifico per questo provider (opzionale) 3. Invia il modulo per attivare il provider - vedi nota sotto Nota: dal momento che i codici di recupero sono crittografati e memorizzati in modo sicuro, questo processo può richiedere un po' di tempo.

# totpInputLabel
source: Enter the generated six-digit code
ar: أدخل الرمز المُكوّن من ستة أرقام
it: Inserisci il codice generato a sei cifre

# totpInputHelp
source: This code should now be displayed on your device or in your application.
ar: يجب عرض هذا الرمز الآن على جهازك أو في التطبيق الخاص بك.
it: Questo codice dovrebbe ora essere visualizzato sul tuo dispositivo o nella tua applicazione.

# locked
source: The maximum attempts for this provider are exceeded. Please use another provider or contact your administrator.
ar: تم تجاوز الحد الأقصى من المحاولات لهذا المُزوّد. الرجاء استخدام مُزوّد آخر أو الاتصال بالمسؤول.
it: Il numero massimo di tentativi per questo provider sono superati. Utilizza un altro provider o contatta il tuo Amministratore.

# edit.table.head
source: Provider information
ar: معلومات المُزوّد
it: Informazioni provider

# edit.table.name
source: Name
ar: اسم
it: Nome

# edit.table.nameInputPlaceholder
source: Enter a name
ar: أدخل الاسم
it: Inserisci un nome

# edit.table.recoveryCodesLeft
source: Recovery codes left
ar: رموز الاستعادة المُتبقية
it: Codici di recupero rimanenti

# edit.table.lastUsed
source: Last used
ar: آخر استخدام
it: Ultimo utilizzato

# edit.table.lastUsed.default
source: Never
ar: أبداً
it: Mai

# edit.table.lastUpdated
source: Last updated
ar: آخر تحديث
it: Ultimo aggiornamento

# edit.regenerate
source: Regenerate recovery codes
ar: إعادة إنشاء أكواد الاستعادة
it: Rigenera i codici di recupero

# edit.regenerate.description
source: If you lost your recovery codes or just want to get fresh ones, you can regenerate them by selecting the checkbox below. You've currently %d codes left.
ar: <unk> <unk> <unk> <unk> إذا فقدت أكواد الاستعادة الخاصة بك أو تريد فقط الحصول على أكواد جديدة، فيمكنك <unk> <unk> <unk> <unk> <unk> <unk> إعادة إنشاؤها عن طريق تحديد مربع الاختيار أدناه. لقد تبقيت حاليا %d كود. <unk> <unk> <unk>
it: Se hai perso i tuoi codici di recupero o vuoi solo ottenerne di nuovi, puoi rigenerarli spuntando l'opzione qui sotto. Hai attualmente %d codici rimasti.

# edit.regenerate.inputLabel
source: Regenerate recovery codes
ar: إعادة إنشاء أكواد الاستعادة
it: Rigenera i codici di recupero

# setup.step.1
source: Step 1
ar: الخطوة 1
it: Passo 1

# setup.step.1a
source: Step 1a
ar: الخطوة 1 أ
it: Passo 1a

# setup.step.1b
source: Step 1b
ar: الخطوة 1 ب
it: Passo 1b

# setup.step.2
source: Step 2
ar: الخطوة 2
it: Passo 2

# setup.step.3
source: Step 3
ar: الخطوة 3
it: Passo 3

# setup.qrCode.label
source: Scan the displayed QR code
ar: مسح كود QR المعروض
it: Scansiona il codice QR visualizzato

# setup.qrCode.help
source: Scan this code with your OTP application (e.g. Google Authenticator).
ar: امسح هذا الكود باستخدام تطبيق OTP الخاص بك (مثل Google Authenticator).
it: Scansiona questo codice con l'applicazione OTP (es. Google Authenticator).

# setup.secret.label
source: Copy the shared secret
ar: نسخ السر المُشترك
it: Copia la chiave segreta condivisa

# setup.secret.help
source: You can also enter the shared secret manually in your OTP application or device.
ar: يمكنك أيضاً إدخال السر المُشترك يدوياً في تطبيق OTP أو جهازك.
it: È inoltre possibile inserire manualmente la chiave segreta condivisa nell'applicazione o nel dispositivo OTP.

# setup.name.label
source: Enter a name (optional)
ar: أدخل الاسم (اختياري)
it: Inserisci un nome (opzionale)

# setup.name.help
source: Specify a custom name for this provider.
ar: حدد اسم مُخصص لهذا المزوّد.
it: Specifica un nome personalizzato per questo provider.

# setup.recoveryCodes.InputLabel
source: Recovery codes
ar: كود الاستعادة
it: Codici di recupero

# setup.recoveryCodes.InputHelp
source: Copy these codes and store them at a safe place.
ar: نسخ هذه الأكواد وتخزينها في مكان آمن.
it: Copia questi codici e custodiscili in un luogo sicuro.

# setup.recoveryCodes.reloadTitle
source: Reload recovery codes
ar: إعادة تحميل أكواد الاستعادة
it: Ricarica i codici di recupero

# setup.recoveryCodes.reloadLabel
source: Reload
ar: إعادة التحميل
it: Ricarica

# setup.recoveryCodes.noActiveProviders.title
source: Setup not possible
ar: الإعداد غير ممكن
it: Impostazione non possibile

# setup.recoveryCodes.noActiveProviders.message
source: Recovery codes are only meant as a fallback if you lose access to your main multi-factorauthentication credentials. Therefore, please activate a comprehensive MFA provider first.
ar: يُقصد من رُموز الاسترداد فقط أن تكون رمزاً احتياطياً إذا فقدت الوصول إلى بيانات اعتماد المصادقة المتعددة العوامل الرئيسية. لذلك، يرجى تنشيط مزود MFA أولاً.
it: I codici di recupero sono intesi solo come un ripiego se perdi l'accesso alle tue credenziali di autenticazione multi-fattore. Pertanto, prima attivare un provider MFA completo.

# setup.totpAuthUrlButton.title
source: Show authentication URL
ar: إظهار رابط المصادقة
it: Mostra URL di autenticazione

# setup.totpAuthUrlModal.title
source: Authentication URL
ar: رابط المصادقة
it: URL di Autenticazione

# setup.totpAuthUrlModal.description
source: In case you are not able to scan the QR code, but your OTP application supports authentication URLs next to, or instead of plain shared secrets, you can copy and paste the URL shown below. The URL contains some information like the issuer (this site) and your email address or username. Most OTP applications will display this information next to the generated codes.
ar: في حالة عدم قدرتك على مسح كود QR، ولكن تطبيق OTP الخاص بك يدعم <unk> <unk> <unk> <unk> <unk> <unk> <unk> <unk> مصادقة عناوين URL المجاورة لـ: أو بدلاً من الأسرار المشتركة الواضحة، يمكنك نسخ و <unk> <unk> <unk> <unk> <unk> <unk> لصق عنوان URL الموضح أدناه. يحتوي عنوان URL على بعض المعلومات مثل المصدر (هذا الموقع) <unk> <unk> <unk> <unk> <unk> و عنوان بريدك الإلكتروني أو اسم المستخدم. ستعرض معظم تطبيقات OTP هذه المعلومات <unk> <unk> <unk> <unk> بعد الأكواد التي تم إنشاؤها. <unk> <unk> <unk> <unk>
it: Nel caso in cui non fossi in grado di scansionare il codice QR, ma la tua applicazione OTP supporta URL di autenticazione o in sostituzione di chiavi segrete condivise, puoi copiare e incollare l'URL mostrato di seguito. L'URL contiene alcune informazioni, come l'emittente (questo sito), il tuo indirizzo email o il nome utente. La maggior parte delle applicazioni OTP mostrerà queste informazioni accanto ai codici generati.

# setup.totpAuthUrlModal.ok
source: OK
ar: موافق

# auth.totp.inputLabel
source: Enter the six-digit code
ar: أدخل الرمز المُكوّن من ستة أرقام
it: Inserire il codice a sei cifre

# auth.recoveryCodes.inputLabel
source: Enter an eight-digit recovery code
ar: أدخل كود الاستعادة المُكوّن من ثمانية أرقام
it: Inserisci un codice di recupero a otto cifre

# unlock.recoveryCodes.title
source: Your recovery codes were automatically updated!
ar: تم تحديث أكواد الاستعادة الخاصة بك تلقائياً!
it: I tuoi codici di recupero sono stati aggiornati automaticamente!

# unlock.recoveryCodes.message
source: Please copy and store them at a safe place: %s
ar: يرجى نسخها وتخزينها في مكان آمن: %s
it: Si prega di copiarli e conservarli in un luogo sicuro: %s

# unlock.recoveryCodes.title
source: Recovery codes successfully regenerated
ar: تم إعادة إنشاء أكواد الاستعادة الاحتياطية بنجاح
it: Codici di recupero rigenerati con successo
