Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_*_groups.xlf
Languages: ar, fr, it

# .description
source: This is the Backend administration user groups available for the Backend users. These determine the access credentials for the Backend users.
ar: هذه هي مجموعات مشرفي الواجهة الخلفية المتاحة لمستخدمي الواجهة الخلفية "Backend". تحدد هذه المجموعات بيانات الدخول للمستخدمين في الواجهة الخلفية.
fr: Ceci est l'interface BE d'administration des groupes utilisateurs. C'est ici que sont définis les accès pour les utilisateurs BE.
it: Il Gruppo Utenti di Backend, disponibile per gli Utenti di Backend, definisce le modalità di accesso, le risorse e le funzionalità disponibili.

# .details
source: Groups contain the main permission settings you can set for a backend user. Many users can be members of the same group and thus share permissions. When a user is a member of many groups (including sub-groups) then the permission settings are added together so that the more groups a user is a member of, the more access is granted to him.
ar: تحتوي المجموعات على إعدادات الأُذُونات الرئيسية التي يمكنك تعيينُها لمستخدم الواجهة الخلفية. يمكن أن يكون العديد من المستخدمين أعضاء في نفس المجموعة وبالتالي مشاركة نفس الأُذُونات. عندما يكون المستخدم عضواً في عدة مجموعات (بما في ذلك المجموعات الفرعية) ، تتم إضافة إعدادات الأُذُونات معاً، بحيث كُلما زاد عدد المجموعات التي ينتمي إليها المستخدم، زادت عدد الأُذُونات المُعطاة له.
fr: Les groupes contiennent les paramètres de permissions que vous pouvez attribuer pour un utilisateur backend. La plupart des utilisateurs peuvent être membre du même groupe et donc partager les même permissions. Quand un utilisateur est membre de plusieurs groupe (sous-groupe inclus) alors les paramètres de permission sont additionnés si bien que les permissions augmentent avec le nombre de groupe auquel il appartient.
it: I gruppi contengono le impostazioni di autorizzazione principali che puoi impostare per un utente di backend. Molti utenti possono essere membri dello stesso gruppo e quindi condividere i permessi. Quanto un utente appartiene a più gruppi (inclusi i sottogruppi) allora le impostazioni dei permessi vengono sommati cosicché più sono i gruppi ai quali un utente è associato e maggiori sono i permessi che gli vengono attribuiti.

# _.seeAlso
source: be_users, "Inside TYPO3" about users / groups | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, How to set up a backend user | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, Setting up groups (from "Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ar: be_users, "داخل TYPO3" حول المستخدمين / المجموعات | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, كيفية إعداد مستخدم الواجهة الخلفية | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, إعداد المجموعات (من "البداية") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
fr: be_users, "Inside TYPO3" à propos des utilisateurs / groupes | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, Comment configurer un utilisateur backend | https://docs.typo3. rg/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, Configuration des groupes (de "Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
it: be_users, "Inside TYPO3" a proposito di utenti e gruppi | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, Come impostare un utente di backend | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, Impostare un gruppo (da "Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# .image_descr
source: Backend Usergroups are found in the root of the page tree where only "admin" users can edit them. The usergroups with red icons in this image are the ones with Access Lists enabled. The blue are just plain usergroups. This usergroup has Access Lists enabled. In the Access Lists you specify which modules, tables, database fields etc. the group members can access in TYPO3.
ar: توجد مجموعات مُستخدمي الواجهة الخلفية في أصل قائمة الصفحات، ويمكن فقط للمشرفين التعديل عليهم. مجموعات المستخدمين ذات الرموز الحمراء في هذه الصورة هي المجموعات التي تم تمكين قوائم الوصول إليها. أما المجموعات ذات الرموز الزرقاء هي فقط مجموعات مستخدمين عادية. تم تمكين "قوائم الوصول" لمجموعة المستخدمين هذه. في قوائم الوصول، يمكنك تحديد حقول الوحدات والجداول وقاعدة البيانات والخ. التي يمكن لأعضاء المجموعة الوصول إليها في TYPO3.
fr: Les groupes d'utilisateurs backend se trouve à la racine de l'arborescence des pages. Uniquement un utilisateur "admin" peut éditer ces groupes. Sur cette image, les groupes d'utilisateurs avec une icône rouge sont ceux qui ont les listes d'accès activés. Les icônes bleues représentent les groupes tout simplement. Ce groupe d'utilisateurs a les listes d'accès activés. Les listes d'accès vous permettent de définir à quel module, table, champs, etc... le membre du groupe aura accès dans TYPO3.
it: I gruppi di utenti backend si trovano nella root dell'Albero delle Pagine (nodo TYPO3), dove solo gli utenti "admin" possono modificarli. I gruppi di utenti con icone rosse, in questa immagine, sono quelli con liste di accesso abilitate. Quelli in blu sono un gruppo di utenti semplice. Questo gruppo di utenti ha Liste di Accesso abilitate. Nelle Liste di Accesso si specifica a quali moduli, tabelle, campi i membri del gruppo possono accedere in TYPO3.

# title.description
source: Name of the Backend usergroup. The name should be descriptive and can always be changed later.
ar: اسم مجموعة مستخدم الواجهة الخلفية. يجب أن يكون الاسم وَصفيْ وذا معنى، يمكنك تعديل الاسم بأي وقت لاحقاً.
fr: Nom du groupe d'utilisateurs backend. Le nom doit être descriptif et peut toujours être modifié par la suite.
it: Nome del gruppo di Backend. Il nome dovrebbe essere descrittivo e può sempre essere modificato nel tempo.

# title.details
source: Backend Usergroups are identified by their "uid" field value (integer) and therefore the title can always be changed. The "uid" can never be changed for a user group.
ar: يتم تحديد مجموعات مُستخدمي الواجهة الخلفية من خلال قيمة الحقل "uid" (عدد صحيح)، وبالتالي يمكن تغيير العنوان دائماً. لا يمكن أبداً تغيير "uid" لمجموعة ما من المستخدمين.
fr: Les groupes d'utilisateurs backend sont identifiés par la valeur de leur champ "uid" (entier). Le titre du groupe peut donc toujours être modifié. Le "uid" ne peut jamais être changé pour un groupe d'utilisateurs.
it: I gruppi di utenti di Backend sono identificati tramite il campo "uid" (valore intero) e pertanto il titolo può essere sempre cambiato. L'identificativo (uid) non può mai essere modificato per un gruppo di utenti.

# title.image_descr
source: The usergroup title is shown in the record lists.
ar: يَظهر عنوان مجموعة المستخدمين في قوائم السجلات.
fr: Le titre du groupe utilisateur est affiché dans la liste des enregistrements.
it: Il titolo del gruppo utenti è visualizzato nella lista dei record.

# db_mountpoints.description
source: Define page tree root points for the group members.
ar: تحديد نقاط جذر شجرة الصفحة لأعضاء المجموعة.
fr: Définit la racine de l'arborescence pour les membres du groupe.
it: Definisce le parti dell'Albero delle Pagine alle quali gli utenti, membri del gruppo, hanno accesso.

# db_mountpoints.details
source: The page tree in TYPO3 must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a "Database mount" or "DB mount". DB mounts <i>may</i> be inherited by the users which are members of this group. This depends on whether the user is configured to include the mounts set in the member groups. However it's recommended to use backend user groups like this to configure mounts. Especially if they need to be shared among many users.
ar: يجب أن تحتوي شجرة الصفحة في TYPO3 على بعض نقاط الدخول. هنا يجب عليك إدخال مرجع واحد أو أكثر إلى الصفحة التي تمثل صفحة جذر جديدة لشجرة الصفحة "root page". هذا يُسمّى "Database Mount" أو "Mount DB". Mount DB <i>قد</i> يرثها المستخدمون الذين هم أعضاء في هذه المجموعة. هذا يعتمد على ما إذا كان المستخدم قد تم إعداده بحيث يشمل الأعداد المُحددة في مجموعات الأعضاء. ومع ذلك، من الأفضل استخدام مجموعات مستخدمي الواجهة الخلفية مثل هذا لتكوين هذا البناء. خاصةً إذا كان من الضروري مشاركتها بين العديد من المستخدمين.
fr: L'arborescence des pages de TYPO3 doit avoir des points d'entrée définis. Ici vous devriez insérer une ou plusieurs références à une page qui représentera une nouvelle page racine pour l'arborescence. Cela s'appelle un « montage de base de données » ou « montage BDD ». Les montages BDD <i>peuvent</i> être hérités par les utilisateurs qui sont membres de ce groupe. Cela dépend si la configuration de l'utilisateur pour inclure les montages définis dans les groupes de membres est active. Cependant, il est recommandé d'utiliser des groupes d'utilisateurs backend comme celui-ci pour configurer des montages. Surtout s'ils doivent être partagés entre plusieurs utilisateurs.
it: Il gruppo, e quindi i membri del gruppo, deve poter accedere ad alcune parti dell'Albero delle Pagine. Qui dovresti inserire uno o più nodi dell'Albero delle Pagine, che rappresenteranno un nuovo (sotto-)Albero delle Pagine. Questo è chiamato, tecnicamente, "Database Mount" oppure "DB Mount". I "DB mounts" <i>possono</i> essere ereditati dagli utenti membri del gruppo. L'ereditarietà ha luogo solo se l'utente è configurato per ereditare i "DB Mounts" dai gruppi. È consigliato utilizzare i gruppi utenti di backend per configurare i "DB Mounts", soprattutto se hanno bisogno di essere condivisi tra molti utenti.

# _db_mountpoints.seeAlso
source: be_groups:file_mountpoints, be_users:db_mountpoints, be_users:options, xMOD_csh_corebe:list_module
ar: be_groups:file_mountpoints, be_users:db_mountpoint be_users:options, xMOD_csh_corebe:list_module

# _db_mountpoints.image
source: EXT:core/Resources/Public/Images/cshimages/be_groups_3.png, EXT:core/Resources/Public/Images/cshimages/be_groups_4.png
ar: EXT:core/Resources/Public/Images/cshimages/be_groups_2.png, EXT:core/Resources/Public/Images/cshimages/be_groups_1.png

# db_mountpoints.image_descr
source: Here a page is added as a "DB mount"... ... and in the page tree of member users this will become the starting point for the page tree.
ar: هنا تمت إضافة صفحة كـ "DB mount"... ... وفي صفحة شجرة الأعضاء المستخدمين ستصبح هذه نقطة البداية لشجرة الصفحة "Page tree".
fr: Voici une page définit comme un "point de montage" ... ... et dans l'arborescence des pages de l'utilisateur ce "point de montage" devient le point de départ de l'arborescence des pages.
it: Qui una pagina è aggiunta come un "DB mount"... ... e nell'Albero delle Pagine degli utenti, membri del gruppo, costituirà un sotto-albero dello stesso Albero delle Pagine.

# file_mountpoints.description
source: Define startpoints for the file folder tree.
ar: تحديد نقاط البدء لشجرة مجلد الملف.
fr: Définit les points d'entrée pour l'arborescence de fichiers.
it: Definisce le parti dell'Albero delle Cartelle alle quali gli utenti, membri del gruppo, hanno accesso.

# file_mountpoints.details
source: The file folder tree is used by all File-submodules to navigate the file folders on the webserver. If you want users to access the servers file system through TYPO3 they need at least one File Mount (and access to eg. File > Filelist module). You can mount a path in "fileadmin/" relative to the TYPO3 installation or you can mount an absolute path somewhere else on the server (outside webroot!). The last requires that $TYPO3_CONF_VARS[BE][lockRootPath] is defined. The path you mount is defined by the Filemount record you refer to by this field. So a File Mount just points to another record inside of which the details are configured. See screenshots below. "admin" users always have the "fileadmin/" folder mounted by default. Notice; as with 'DB mounts' the file folder mounts may be inherited by the users which are members of this group.
ar: يتم استخدام شجرة مجلد الملف من قبل جميع وحدات الملفات الفرعية للتنقل في مجلدات الملفات على خادم الويب. إذا كنت تريد للمستخدمين الوصول إلى ملفات النظام والخادم "Server" من خلال TYPO3 فإنهم بحاجة إلى ملف واحد على الأقل (والوصول إلى ملف > وحدة قائمة الملفات). يمكنك تحميل مسار في "fileadmin/" فيما يتعلق بتثبيت TYPO3 أو يمكنك تحميل مسار مطلق في مكان آخر على الخادم (خارج Webroot!). يتطلب الأخير أن يكون $TYPO3_CONF_VARS[BE][lockRootPath] مُعرّف. المسار الذي تقوم بتحميله يتم تعريفه بواسطة سجل "Filemount" الذي تشير إليه بهذا الحقل. يشير "Filemount" فقط إلى سجل آخر يتم فيه تكوين التفاصيل. انظر لقطات الشاشة أدناه. المُشرفين الـ "admin" لديهم دائماً مجلد "fileadmin/" المحمول بشكل افتراضي. إشعارات، كما هو الحال مع 'DB mounts' قد يكون مجلد الملفات موروث من قبل المستخدمين الذين هم أعضاء في هذه المجموعة.
fr: L'arborescence des dossiers de fichiers est utilisée par tous les sous-modules Fichier pour naviguer dans les dossiers de fichiers sur le serveur web. Si vous voulez que les utilisateurs accèdent au système de fichiers des serveurs par l'intermédiaire de TYPO3, ils ont besoin d'au moins un montage de fichier (et d'un accès à p. ex. Fichier > Liste). Vous pouvez monter un chemin du "fileadmin/" de l'installation de TYPO3 ou vous pouvez monter un chemin absolu ailleurs sur le serveur (en dehors de la racine web !). Ce dernier requiert que $TYPO3_CONF_VARS[BE][lockRootPath] soit défini. Le chemin que vous montez est défini par l'enregistrement "Montage de fichier" auquel vous faites référence par ce champ. Ainsi, un montage de fichier pointe juste vers un autre enregistrement à l'intérieur duquel les détails sont configurés. Voir les captures d'écran ci-dessous. Les utilisateurs "admin" ont toujours le dossier "fileadmin/" monté par défaut. Avertissement : comme avec 'Montage BDD', le montage de fichier peut être hérité par les utilisateurs qui sont membres de ce groupe.
it: L'Albero delle Cartelle è utilizzato, da tutti i moduli di File, per navigare tra le cartelle dei file sul server web. Se si desidera che gli utenti possano accedere ai file dei server tramite TYPO3, bisogna rendere disponibile l'accesso ad almeno un Albero delle Cartelle (e anche l'accesso a un module File, es. "File>Lista File"). Puoi definire un percorso in "fileadmin/" relativo all'installazione di TYPO3 oppure un percorso assoluto da qualche altra parte sul server (anche al di fuori della webroot!). In questo caso è necessario impostare $TYPO3_CONF_VARS[BE][lockRootPath]. Il percorso da montare è definito dal record Filemount a cui fai riferimento da questo campo. Quindi un Filemount punta ad un altro record (Storage) all'interno del quale sono configurati i dettagli. Vedi le immagini qui sotto. Gli utenti admin hanno sempre la cartella "fileadmin/" montata di default. Nota: come con 'DB Mounts', la cartella definita nel Filemount può essere ereditata dagli utenti che sono membri di questo gruppo (File Mounts).

# _file_mountpoints.seeAlso
source: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, More about File Mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
ar: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, المزيد عن File Mounts <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
fr: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, En savoir plus sur Montage de fichiers | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/

# file_mountpoints.image_descr
source: The File Mounts are references to records from the "Filemounts" table. In the Filemount record you define whether the path should be absolute (must be within $TYPO3_CONF_VARS[BE][lockRootPath]) or relative to "fileadmin/". In this case the Filemount points to "fileadmin/user_upload/" This is the page tree of the "admin" user. Notice the folder "user_upload" which is the folder referred to by the File Mount record. This shows the mounted folder as seen by a user who was member of the group. Filemount records are also created in the page tree root.
ar: تركيب الملف هي مراجع للسجلات من جدول "Filemounts". في سجل Filemount ، تحدد ما إذا كان يجب أن يكون المسار مطلقاً (يجب أن يكون داخل $TYPO3_CONF_VARS[BE][lockRootPath]) أو بالنسبة إلى "fileadmin/". في هذه الحالة يشير الملف إلى "fileadmin/user_upload/" هذه هي صفحة شجرة المُشرف "admin". لاحظ المجلد "user_upload" الذي هو المجلد المشار إليه في سجل File Mount. هذا يظهر المجلد المثبت كما يراه مستخدم كان عضواً في المجموعة. يتم إنشاء سجلات Filemounts أيضا في جذر صفحة الشجرة.
fr: Les Montages de fichiers sont des références à des enregistrements de la table "Montages de fichiers". Dans l'enregistrement du montage de fichiers, vous définissez si le chemin doit être absolu (doit être dans $TYPO3_CONF_VARS[BE][lockRootPath]) ou relatif à "fileadmin/". Dans ce cas, le montage pointe vers "fileadmin/user_upload/". C'est l'arborescence des pages de l'utilisateur "admin". Notez le dossier "user_upload" qui est le dossier auquel il est fait référence par l'enregistrement du montage de fichier. Cela montre le dossier monté tel qu'il est vu par un utilisateur qui était membre du groupe. Les enregistrements de montage de fichiers sont également créés à la racine de l'arborescence des pages.
it: I Filemount sono riferimenti a record della tabella dei "Filemount". Nel record Filemount si definisce se il percorso deve essere assoluto (dentro $TYPO3_CONF_VARS[BE][lockRootPath]) o relativo a "fileadmin/". In questo caso il Filemount punta a "fileadmin/user_upload/" Questo è l'albero delle pagine dell'utente "admin". Notare la cartella "user_upload" che è la cartella a cui fa riferimento il record Filemount. Mostra come, la cartella montata, viene visualizzata da un utente che fa parte del gruppo. I record di Filemount vengono creati nel nodo root (nodo-TYPO3: uid=0) dell'albero delle pagine.

# file_permissions.description
source: Select file operation permissions for the group members.
ar: حدد أذونات عملية الملف لأعضاء المجموعة.
fr: Sélectionnez les permissions sur les manipulations de fichier pour les membres du groupe.
it: Imposta i permessi delle operazioni su cartelle e file per i membri del gruppo.

# file_permissions.details
source: These settings relate to the functions found in the File>Filelist module as well as general upload of files. <strong>Notice</strong> that these settings apply to all members of this group and extend the users permissions accordingly.
ar: هذه الإعدادات تتعلق بالوظائف الموجودة في ملف > وحدة قائمة الملفات، بالإضافة إلى تحميل الملفات بشكل عام. <strong>لاحظ</strong> أن هذه الإعدادات تنطبق على جميع أعضاء هذه المجموعة وتمديد أذونات المستخدمين وفقا لذلك.
fr: Ces paramètres concernent les fonctions trouvées dans le module Fichiers>Liste ainsi que le téléversement général de fichiers. <strong>Remarquez</strong> que ces paramètres s'appliquent à tous les membres de ce groupe et étendent donc les permissions des utilisateurs.
it: Queste impostazioni si riferiscono alle funzionalità del modulo "File>Lista File", così come al caricamento generale dei file. <strong>Notare</strong> che queste impostazioni si applicano a tutti i membri di questo gruppo e, di conseguenza, estendono i permessi degli utenti.

# fileoper_perms.description
source: Select file operation permissions for the group members.
ar: حدد أُذُونات عملية الملف لأعضاء المجموعة.
fr: Sélectionnez les permissions sur les manipulations de fichier pour les membres du groupe.
it: Imposta i permessi delle operazioni su cartelle e file per i membri del gruppo.

# fileoper_perms.details
source: These settings relate to the functions found in the File>Filelist module as well as general upload of files. <strong>Notice</strong> that these settings apply to all members of this group and extend the users permissions accordingly.
ar: هذه الإعدادات تتعلق بالوظائف الموجودة في ملف > وحدة قائمة الملفات، بالإضافة إلى تحميل الملفات بشكل عام. <strong>لاحظ</strong> أن هذه الإعدادات تنطبق على جميع أعضاء هذه المجموعة وتمديد أُذُونات المستخدمين وُفقاً لذلك.
fr: Ces paramètres concernent les fonctions trouvées dans le module Fichiers>Liste ainsi que le téléversement général de fichiers. <strong>Remarquez</strong> que ces paramètres s'appliquent à tous les membres de ce groupe et étendent donc les permissions des utilisateurs.
it: Queste impostazioni si riferiscono alle funzionalità del modulo "File>Lista File", così come al caricamento generale dei file. <strong>Notare</strong> che queste impostazioni si applicano a tutti i membri di questo gruppo e, di conseguenza, estende i permessi degli utenti.

# pagetypes_select.description
source: Select which 'Types' of Pages the members may set.
ar: حدد أنواع الصفحات التي يمكن للأعضاء تعينها.
fr: Sélectionnez quels types de pages le membre pourra créer.
it: Seleziona a quali Tipi di Pagina i membri possono accedere.

# pagetypes_select.details
source: This option limits the number of valid choices for the user when he is about to select a page type. Choice of Page types (doktype) for a page is associated with a) a special icon for the page, b) permitted tables on the page (see $PAGES_TYPES global variable) and c) if the page is a web page or "system folder" type.
ar: يحد هذا الخيار من عدد الخيارات الصحيحة للمستخدم عندما يكون على وشك تحديد نوع الصفحة. اختيار نوع الصفحة (doktype) لصفحة ما يرتبط بـ (أ- أيقونة خاصة للصفحة، (ب- الجداول المسموح بها على الصفحة (انظر المتغير العالمي $PAGES_TYPES ) و (ج- إذا كانت الصفحة صفحة ويب أو نوع "مجلد النظام".
fr: Cette option limite le nombre de choix valides pour l'utilisateur lorsqu'il est sur le point de sélectionner un type de page. Le choix des types de page (doktype) pour une page est associé à a) une icône spéciale pour la page, b) les tables autorisées sur la page (voir la variable globale $PAGES_TYPES ) et c) si la page est une page web ou un dossier système.
it: Questa opzione limita il numero di scelte valide per l'utente quando sta per selezionare un tipo di pagina. La scelta del tipo di pagina (doktype) definisce a) un'icona speciale per la pagina, b) le tabelle consentite sulla pagina (vedi la variabile globale $PAGES_TYPES) e c) se la pagina è un contenuto web o una "Cartella" di sistema.

# pagetypes_select.image_descr
source: The list of typical page types available in a CMS context. Selecting Page types for a usergroup defines which of these options can be selected by member users.
ar: قائمة بأنواع الصفحات النموذجيّة المُتاحة في سياق CMS. تحديد أنواع الصفحات لمجموعة المستخدم يحدد أي من هذه الخيارات يمكن اختيارها من قبل المستخدمين الأعضاء.
fr: Liste des pages à disposition. Le choix sera limité en fonction des options que vous aurez sélectionné pour un groupe d'utilisateurs.
it: L'elenco di tipici tipi di pagina, disponibili in un contesto CMS. Selezionando i tipi di Pagina per un gruppo di utenti si definisce quale di queste opzioni può essere selezionata dagli utenti membri.

# tables_modify.description
source: Select which tables the members may modify.
ar: حدد الجداول التي يمكن للأعضاء تعديلها.
fr: Choisissez quelles tables le membre peut modifier.
it: Seleziona quali tabelle i membri possono modificare.
