Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_*_groups.xlf
Languages: ar, fr, it

# tables_modify.details
source: An important part of setting permissions is to define which database tables a user is allowed to modify. Tables allowed for modification is automatically also allowed for selection and thus you don't need to set tables entered here in the "Tables (listing)" box. <strong>Notice</strong> that this list adds to the fields selected in other member groups of a user.
ar: جزء هام من أُذُونات الإعداد هو تحديد جداول قاعدة البيانات التي يُسمح للمستخدم بتعديلها. الجداول المسموح بتعديلها مسموح بها أيضاً للتحديد تلقائياً، وبالتالي لا تحتاج إلى تعيين الجداول المُدخلة هنا في مربع "الجداول (listing)". <strong>لاحظ</strong> أن هذه القائمة تضاف إلى الحقول المُحددة في مجموعات الأعضاء.
fr: Une partie importante des permissions / accès consiste à choisir quelles tables de la base de données l'utilisateur sera autorisé à modifier. Si un utilisateur est autorisé à modifier une table, il peut naturellement automatiquement sélectionner cette table. Vous n'avez donc pas besoin de définir cette permission aussi dans la partie "Table (Liste)". <strong>Notez</strong> que cette liste s'ajoute aux champs sélectionnés dans les autres groupes de membres de l'utilisateur.
it: Una parte importante, dell'impostazione dei permessi, è quella di definire quali tabelle di database un utente può modificare. Le tabelle consentite per la modifica sono automaticamente selezionabili, quindi non è necessario impostarle anche qui nella casella "Tabelle (elenco)". <strong>Notare</strong> che queste impostazioni si applicano a tutti i membri di questo gruppo e, di conseguenza, estendono i permessi degli utenti.

# tables_modify.image_descr
source: The screenshot above shows how the "Create new record" dialog looks for a user limited to editing only "Page" and "Page content" elements. The two tables are simply added to the list of "Tables (modify)" in the group Access Lists. This is (an example of) the full amount of elements that can be created on the page by the "admin" user for whom there are no restrictions.
ar: توضح لقطة الشاشة أعلاه كيف يبحث مربع الحوار "إنشاء سجل جديد" عن مستخدم مُقيّد بتعديل عُنصُرَي "الصفحة" و "محتوى الصفحة" فقط. يتم ببساطة إضافة الجدولين إلى قائمة "الجداول (تعديل)" في قوائم الوصول للمجموعة. هذا (مثال على) الكمية الكاملة للعناصر التي يمكن إنشاؤها على الصفحة بواسطة مستخدم "المسؤول" الذي لا توجد قيود عليه.
fr: L'image ci-dessus montre ce qu'un utilisateur; avec la permission d'éditer uniquement les éléments "Page" et "Elément de contenu", voit lorsqu'il créé un nouvel enregistrement. Les deux tables sont simplement ajoutées à la liste des "Tables (Modifier)" dans la liste des accès. Un exemple de la même vue mais cette fois pour un utilisateur "admin" qui n'a donc aucune restriction.
it: L'immagine qui sopra mostra come la finestra di dialogo "Crea nuovo record", appare a un utente limitato a modificare solo gli elementi "Pagina" e "Contenuto di Pagina". Le due tabelle sono semplicemente aggiunte alla lista di "Tabelle (modifica)" nella sezione "Liste di Accesso" del gruppo. Questo è (un esempio) la disponibilità completa di elementi che possono essere creati sulla pagina dall'utente "admin", per il quale non ci sono restrizioni.

# tables_select.description
source: Select which tables the members may see in record lists ('modify' tables does not need to be re-entered here!).
ar: حدد الجداول التي قد يراها الأعضاء في قوائم السجلات (الجداول 'المُعدلة' لا تحتاج إلى إعادة إدخالها هنا!).
fr: Choisissez quelles tables les membres peuvent voir dans les listes d'enregistrements. Pas besoin de resélectionner ici une table déjà autorisée sous "Tables (Modifier)".
it: Seleziona le tabelle che i membri possono vedere nelle liste di record (le tabelle già abilitate alla modifica non devono essere reinserite qui!).

# tables_select.details
source: This determines which tables - in addition to those selected in the "Tables (modify)" box - may be viewed and listed for the member users. He is not able to <em>edit</em> the table - only select the records and view the content. This list is not very important. It's a pretty rare situation that a user may select tables but not modify them.
ar: هذا يُحدد الجداول -بالإضافة إلى الجداول المُختارة في مُربع "الجداول (المعدلة)"- التي يمكن الاطلاع عليها وإدراجها للمستخدمين الأعضاء. إنه غير قادر على <em>تعديل</em> الجدول - فقط تحديد السجلات وعرض المحتوى. هذه القائمة ليست مهمة جدا. إنها حالة نادرة جدا يمكن للمستخدم اختيار الجداول ولكن لا تعديلها.
fr: Définit quelles tables - en plus de celles sélectionnées sous "Tables (Modifier)" - l'utilisateur pourra voir et lister. L'utilisateur ne pourra donc pas <em>éditer</en> cette table - uniquement sélectionner et voir le contenu. Cette liste n'est pas vraiment importante. La situation où un utilisateur devrait pouvoir sélectionner une table sans pouvoir la modifier est plutôt rare.
it: Questo determina quali tabelle - oltre a quelle incluse in "Tabelle (modifica)" - possono essere visualizzate ed elencate dagli gli utenti membri. Non sarà possibile <em>modificare</em> la tabella, ma solo selezionare i record e visualizzarne il contenuto. Questa lista non è molto importante. È una situazione abbastanza rara che un utente può visualizzare le tabelle ma non modificarle.

# non_exclude_fields.description
source: Certain table fields are not available by default. Those fields can be explicitly enabled for the group members here.
ar: بعض حقول الجدول غير متوفرة بشكل افتراضي. يمكن تمكين هذه الحقول بشكل صريح لأعضاء المجموعة هنا.
fr: Certains champs des tables ne sont pas disponibles par défaut. Ces champs peuvent être explicitement autorisé ici pour les membres du groupe.
it: Alcuni campi delle tabelle non sono disponibili per default. Questi campi possono essere qui esplicitamente abilitati per i membri del gruppo.

# non_exclude_fields.details
source: "Allowed excludefields" allows you to detail the permissions granted to tables. By default all these fields are not available to users but must be specifically enabled by being selected here. One application of this is that pages are usually hidden by default and that the hidden field is not available for a user unless he has been granted access by this list of "Allowed excludefields". So the user may create a new page, but cannot un-hide the page - unless of course he has been assigned the "Page: Hide page" exclude field through one of his member groups. Of course it does not make any sense to add fields from tables which are not included in the list of tables allowed to be modified.
ar: تسمح لك "الحقول المستبعدة المسموح بها" بتفصيل الأُذُونات الممنوحة للجداول. بشكل افتراضي جميع هذه الحقول غير متوفرة للمستخدمين ولكن يجب تفعيلها على وجه التحديد عن طريق اختيارها هنا. أحد التطبيقات العملية على هذا هو أن الصفحات عادة ما تكون مخفية بشكل افتراضي وأن الحقل المخفي غير متوفر للمستخدم ما لم يكن قد مُنح حق الوصول إلى هذه القائمة من "الحقول المُستبعدة المسموح بها". لذلك يمكن للمستخدم إنشاء صفحة جديدة، ولكن لا يمكن إلغاء إخفاء الصفحة - ما لم يتم بالطبع تعيين "الصفحة: إخفاء الصفحة" يستبعد الحقل من خلال إحدى مجموعات أعضائه. وبطبيعة الحال، ليس من المعقول إضافة حقول من الجداول غير المدرجة في قائمة الجداول المسموح بتعديلها.
fr: "Champs exclus autorisés" vous permet de détailler les permissions accordées aux tables. Par défaut, tous ces champs ne sont pas disponibles pour les utilisateurs mais doivent être spécifiquement activés en étant sélectionnés ici. Un exemple de ce réglage est que les pages sont généralement masquées par défaut et que le champ "Cacher la page" n'est pas disponible pour un utilisateur, à moins que l'accès à ce champ n'ait été accordé par cette liste de "Champs exclus autorisés". Ainsi, l'utilisateur peut créer une nouvelle page, mais ne peut pas dé-masquer la page - sauf si bien sûr on lui a autorisé le champ "Page: Cacher la page" dans un de ses groupes membres. Bien sûr, il n'y a aucun sens à ajouter des champs pour des tables qui ne sont pas incluses dans la liste des tables autorisées à être modifiées.
it: "Campi esclusivi Consentiti" permette di dettagliare i permessi concessi alle tabelle. Per impostazione predefinita, tutti questi campi non sono disponibili per gli utenti, ma devono essere specificamente abilitati selezionandoli qui. Uno scopo di questo è che, ad esempio, le nuove pagine sono nascoste per default e il campo "Abilitato" non è disponibile per un utente, a meno che non gli sia stato concesso l'accesso da questa lista di "Campi esclusivi consentiti". Così l'utente può creare una nuova pagina, ma non può renderla visibile - a meno che non gli sia stato assegnato il campo "Pagina: Abilitato" attraverso uno dei suoi gruppi membri. Naturalmente non ha senso aggiungere campi da tabelle che non sono incluse nella lista delle tabelle che possono essere modificate - Tabelle (modifica).

# _non_exclude_fields.seeAlso
source: be_groups:inc_access_lists, Examples from "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ar: be_groups:inc_access_lists, أمثلة عن "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
fr: be_groups:inc_access_lists, Exemples dans "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
it: be_groups:inc_access_lists, Esempi da "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# hidden.description
source: Enables a user group.
ar: تفعيل مجموعة مستخدمين.
fr: Active un groupe d'utilisateurs.
it: Abilita un gruppo utente.

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them.
ar: إذا قمت بتعطيل مجموعة المستخدمين، فإن جميع أعضاء المجموعة لن يرثوا أي خصائص مُعطاة لهم في هذه المجموعة.
fr: Si vous désactivez un groupe utilisateur tous ses utilisateurs n'hériterons plus des propriétés que ce groupe leur attribuait.
it: Se disabiliti un gruppo di utenti tutti gli utenti che sono membri del gruppo, non erediteranno alcuna proprietà che questo gruppo potrebbe aver dato loro.

# groupMods.description
source: Select available backend modules for the group members.
ar: حدد أدوات الواجهة الخلفية المُتاحة لأعضاء المجموعة.
fr: Choisissez les modules backend disponibles pour les membres du groupe.
it: Seleziona i moduli di backend disponibili per i membri del gruppo.

# groupMods.details
source: This determines which 'menu items' are available for the group members. This list of modules is added to any modules selected in other member groups of a user as well as the corresponding field of the user himself.
ar: يحدد هذا 'عناصر القائمة' المُتاحة لأعضاء المجموعة. هذه القائمة تُضاف إلى أي وحدات تم اختيارها في مجموعات أعضاء أخرى للمستخدم وكذلك الحقل المقابل للمستخدم نفسه.
fr: Ceci détermine quels 'éléments de menu' sont disponibles pour les membres du groupe. Cette liste de modules est ajoutée aux modules sélectionnés dans les autres groupes d'un utilisateur ainsi que dans le champ correspondant de son enregistrement Utilisateur BE.
it: Questo determina quali 'voci di menù' sono disponibili per i membri del gruppo. Questo elenco di moduli viene aggiunto a tutti quelli già inclusi in altri gruppi di un utente e a quelli già inclusi nel corrispondente campo dell'utente stesso, ovvero nel record di "Utente di Backend".

# _groupMods.seeAlso
source: be_users:userMods, be_groups:inc_access_lists, Backend Interface | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/
ar: be_users:userMods, be_groups:inc_access_lists, Backend Interface <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/
fr: be_users:userMods, be_groups:inc_access_lists, Interface Backend | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/
it: be_users:userMods, be_groups:inc_access_lists, Interfaccia di Backend | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/

# groupMods.image_descr
source: The Backend Modules available for a user is reflected in the menu items of the backend. For most regular users only modules in the Web and File main modules are enabled. Typically "Web > Page" is used for editing of page content. This is the assignment of Backend Modules to the user from the screenshot above. All four Web sub-modules and the two User sub-modules are configured here. However the File > Filelist module must have been configured for another member group of this user (or inside the user profile itself which is also possible). The Help modules are all accessible by default and does not require explicit access.
ar: تنعكس وحدات الواجهة الخلفية المتاحة للمستخدم في عناصر القائمة الخاصة بالواجهة الخلفية. بالنسبة لمعظم المستخدمين العاديين ، يتم تمكين الوحدات النمطية الرئيسية في الويب والوحدات النمطية للملف فقط. عادةً ما يتم استخدام "Web > Page" لتحرير محتوى الصفحة. هذا هو أمر وحدات الواجهة الخلفية للمستخدم من لقطة الشاشة أعلاه. يتم هنا تكوين جميع الوحدات الفرعية للويب الأربعة والوحدتين الفرعيتين للمستخدم. لكن الملف > يجب تكوين وحدة قائمة الملفات لمجموعة أعضاء أخرى لهذا المستخدم (أو داخل ملف تعريف المستخدم نفسه وهو أمر ممكن أيضاً). يمكن الوصول إلى جميع وحدات التعليمات بشكل افتراضي ولا تتطلب وصولاً صريحاً.
fr: Les modules Backend disponibles pour un utilisateur sont visibles dans le menu de gauche dans le backend. Pour la plupart des utilisateurs ordinaires, seuls les modules Web et les modules principaux sont activés. Typiquement "Web > Page" est utilisé pour l'édition du contenu de la page. Ceci est l'affectation de Modules Backend à l'utilisateur à partir de la capture d'écran ci-dessus. Les quatre sous-modules Web et les deux sous-modules utilisateur sont configurés ici. Cependant le module "Fichiers > Liste" doit avoir été configuré pour un autre groupe membre de cet utilisateur (ou dans le profil de l'utilisateur lui-même, ce qui est aussi possible). Les modules Aide sont tous accessibles par défaut et ne nécessitent pas un accès explicite.
it: I moduli di backend disponibili per un utente si riflettono nelle voci di menù del backend. Per la maggior parte degli utenti abituali sono abilitati solo i moduli nelle aree Web e File. Tipicamente "Web>Pagina" viene utilizzato per la modifica del contenuto della pagina. Questa è l'assegnazione di Moduli di Backend all'utente dalla schermata qui sopra. Tutti e quattro i moduli Web e i due moduli Utente sono configurati qui. Tuttavia il modulo "File>Lista File" deve essere stato configurato per un altro gruppo membro di questo utente (o all'interno del profilo utente stesso). I moduli di aiuto sono tutti accessibili per default e non richiedono una assegnazione esplicita.

# inc_access_lists.description
source: Select whether the Access Lists for Page type, Tables, Module and Allowed excludefield are enabled for this group.
ar: حدد ما إذا كانت قوائم الوصول لنوع الصفحة والجداول والوحدة النمطية والاستبعاد المسموح بها مُفعّلة لهذه المجموعة.
fr: Choisissez si les listes d'accès aux modules, tables, types de pages, autorisations et exclusions explicites sont activées pour ce groupe.
it: Seleziona se le Liste di Accesso per Tipo di Pagina, Tabelle, Modulo e Campi Esclusivi sono abilitati per questo gruppo.

# inc_access_lists.details
source: If this option is disabled the Access Lists cannot be configured for the group. When Access Lists are disabled the icon for the group is blue while it is red when Access Lists are enabled.
ar: إذا تم تعطيل هذا الخيار، فلا يمكن تكوين قوائم الصلاحيات للمجموعة. عندما يتم تعطيل قوائم الصلاحيات، يكون رمز المجموعة باللون الأزرق بينما يكون أحمر اللون عند تمكين قوائم الصلاحيات.
fr: Si cette option est désactivée, les listes d'accès ne peuvent pas être configurées pour le groupe. Lorsque les listes d'accès sont désactivées, l'icône du groupe est bleue alors qu'il est rouge lorsque les listes d'accès sont activées.
it: Se questa opzione è disabilitata, le Liste di Accesso non possono essere configurate per il gruppo. Quando le Liste di Accesso sono disabilitate, l'icona per il gruppo è blu mentre è rossa quando sono abilitate.

# description.description
source: Enter a short description of the user group, what it is for and who should be members. This is for internal use only.
ar: أدخل وصفاً مُوجزاً لمجموعة المستخدمين، ما هي؟ ولماذا أُنشأت؟ ومن يجب أن يكونوا أعضاؤها؟. هذا الوصف للاستخدام الداخلي فقط.
fr: Entrez une brève description du groupe d'utilisateurs, à quoi il sert et qui devrait être membre. Ceci est seulement pour usage interne.
it: Inserisci una breve descrizione del gruppo utente, la sua finalità e chi dovrebbe essere membro. Questo è solo per uso interno.

# TSconfig.description
source: User TSconfig: Additional configuration through TypoScript style values (Advanced).
ar: مستخدم الـ TSconfig: تكوين إضافي من خلال قيم نمط TypoScript (مُتقدم).
fr: User TSconfig : Configuration supplémentaire avec des valeurs de type TypoScript (Avancé).
it: TSconfig Utente: configurazione aggiuntiva via TypoScript (avanzato).

# TSconfig.details
source: User TSconfig can be set for each backend user and group. Configuration set for backend groups is inherited by the user who is a member of those groups. The available options typically cover user settings like those found in the User>Setup module (in fact options from that module can be forcibly overridden from User TSconfig!), configuration of the "Admin Panel" (frontend), various backend tweaks (lock user to IP, may user clear all cache?, width of the navigation frame etc.) and backend module configuration (overriding any configuration set for backend modules in Page TSconfig).
ar: يمكن ضبط مستخدم الـ TSconfig لكل مستخدم ومجموعة خلفية. يورث المستخدم الذي هو عضو في تلك المجموعات مجموعة التكوين لمجموعات الواجهة الخلفية. عادةً ما تغطي الخيارات المُتاحة إعدادات المستخدم مثل تلك الموجودة في مستخدم > وحدة الإعداد. (في الواقع يمكن تجاوز الخيارات من تلك الوحدة بالقوة من User TSconfig!)، تكوين "Admin Panel" (الواجهة الأمامية) ، تعديلات بالواجهة الخلفية مختلفة (قفل المستخدم لعنوان IP ، هل يمكن للمستخدم مسح كل ذاكرة التخزين المؤقت؟، عرض التنقل إطار وما إلى ذلك) وتكوين وحدة الواجهة الخلفية (تجاوز أي مجموعة تكوين لوحدات الواجهة الخلفية في Page TSconfig).
fr: La configuration "User TSconfig" peut être définie pour chaque utilisateur et groupe backend. La configuration pour les groupes backend est héritée par les utilisateurs membres de ces groupes. Les options disponibles couvrent généralement les paramètres de l'utilisateur tels que ceux trouvés dans le module Utilisateurs>Paramètres (en fait, les options de ce module peuvent être remplacées par la TSconfig de l'utilisateur !) , configuration du "panneau d'administration" (frontend), diverses améliorations du backend (verrouiller l'utilisateur sur une adresse IP, peut-il effacer tout le cache?, la largeur du cadre de navigation, etc...), et la configuration du module backend (outrepassant toute configuration des modules backend dans Page TSconfig).
it: È possibile impostare il TSconfig per un utente tramite i record utente e gruppo di backend. La configurazione dei gruppi di backend è ereditata dall'utente che è un membro di tali gruppi. Le opzioni, in genere, coprono tutte le impostazioni utente, quelle nel profilo utente, ossia nel modulo "Utente>Impostazioni Utente". Le opzioni del profilo utente possono essere sovrascritte da TSconfig, blocco utente a un IP, pulizia della cache, larghezza del riquadro di navigazione e disponibilità dei moduli di backend (sovrascrivendo qualsiasi configurazione impostata nel TSconfig di Pagina).

# TSconfig.syntax
source: TypoScript syntax without conditions and constants.
ar: بناء صيغة TypoScript بدون شروط وثوابت.
fr: Syntaxe Typoscript sans conditions ni constantes.
it: Sintassi TypoScript senza condizioni e costanti.

# TSconfig.image_descr
source: In the TSconfig field help is right at hand - just click the TS wizard icon, then a window will pop up. In the pop-up window you will see a tree of possible configuration values. These are extracted from the TSconfig manual. You can click around to find the options you need to set through this wizard.
ar: في حقل TSconfig، تكون المساعدة في متناول اليد -فقط انقر فوق رمز معالج TS، فتظهر نافذة منبثقة-. في هذه النافذة سترى شجرة قيم التكوين المُمكِنة. يتم استخلاصها من دليل TSconfig. يمكنك النقر حولها للعثور على الخيارات التي تحتاجها لتعيينها من خلال هذا المعالج.
fr: Dans le champ d'aide du champ TSconfig se trouve à droite - il suffit de cliquer sur l'icône de l'assistant TS, puis une fenêtre s'ouvre. Dans la fenêtre pop-up vous verrez une arborescence de valeurs de configuration possibles. Ils sont extraits du manuel de TSconfig. Vous pouvez cliquer sur ces valeurs pour trouver les options que vous devez définir à travers cet assistant.
it: Nel campo di TSconfig l'aiuto è a portata di mano; facendo clic sull'icona della procedura guidata TS verrà visualizzata una finestra. Nella finestra popup vedrai un albero di possibili valori di configurazione. Questi sono estratti dal manuale di TSconfig. Con semplici clic per trovare le opzioni che devi impostare attraverso questa procedura guidata.

# subgroup.description
source: All settings from the selected groups will be merged with the properties from this group, for example DB mounts, permissions, TSconfig, etc.
ar: سيتم دمج جميع الإعدادات من المجموعات المُحددة مع الخصائص من هذه المجموعة، على سبيل المثال قاعدة البيانات والأُذُونات و TSconfig وما إلى ذلك.
fr: Tous les paramètres des groupes sélectionnés seront fusionnés avec les propriétés de ce groupe, par exemple les montages BDD, les permissions, TSconfig, etc.
it: Tutte le impostazioni dei gruppi selezionati verranno unite con le proprietà di questo gruppo, ad esempio DB Mounts, permessi, TSconfig, ecc.

# subgroup.details
source: The properties of subgroups are added to the properties of this group and basically they will simply be added to the list of member groups of any user which is a member of this group. This feature provides a great way to create 'Supervisor' user groups.
ar: تمت إضافة خصائص المجموعات الفرعية إلى خصائص هذه المجموعة، وسيتم إضافتها بشكل أساسي إلى قائمة مجموعات الأعضاء لأي مستخدم عضو في هذه المجموعة. توفر هذه الميزة طريقة رائعة لإنشاء مجموعات مستخدمين "Supervisor".
fr: Les propriétés des sous-groupes sont ajoutées aux propriétés de ce groupe et elles seront simplement additionnées à la liste des groupes de membres de tout utilisateur qui est membre de ce groupe. Cette fonctionnalité fournit un excellent moyen de créer des groupes d'utilisateurs 'Superviseur'.
it: Le proprietà dei sottogruppi vengono aggiunte alle proprietà di questo gruppo e concettualmente verranno aggiunte alla lista dei gruppi di ogni utente che è membro di questo gruppo. Questa funzione offre un ottimo modo per creare gruppi di utenti supervisori.

# explicit_allowdeny.description
source: Select field values to explicitly deny or allow for user group members.
ar: حدد قِيَم الحقل للرفض أو للسماح لأعضاء مجموعة المستخدمين.
fr: Sélectionnez les champs explicitement autorisés ou interdits pour les membres du groupe utilisateur.
it: Seleziona i valori del campo per negare o consentire l'utilizzo ai membri del gruppo utente.
