Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_password_policy.xlf
Languages: ar, it

# passwordRequirements.description
source: The password must match the following requirements:
ar: يجب أن تحتوي كلمه المرور علي المتطلبات التالية:
it: La password deve avere ai seguenti requisiti:

# requirement.minimumLength
source: Minimum length: %d chars
ar: الطول الأدنى: %d حرف
it: Lunghezza minima: %d caratteri

# requirement.upperCaseCharacterRequired
source: At least one upper case char
ar: حرف واحد من أعلى الحالة على الأقل
it: Almeno un carattere maiuscolo

# requirement.lowerCaseCharacterRequired
source: At least one lower case char
ar: حرف حالة صغيرة واحد على الأقل
it: Almeno un carattere minuscolo

# requirement.digitCharacterRequired
source: At least one digit
ar: رقم واحد على الأقل
it: Almeno una numero

# requirement.specialCharacterRequired
source: At least one special char
ar: رمز خاص واحدة على الأقل
it: Almeno un carattere speciale

# requirement.notCurrentPassword
source: Must be different from current password
ar: يجب أن تكون مختلفة عن كلمة المرور الحالية
it: Deve essere diversa dalla password attuale

# error.minimumLength
source: The password is too short. Minimum length is %d chars
ar: كلمة المرور قصيرة جداً. الطول الأدنى هو %d حرف
it: La password è troppo corta. La lunghezza minima è di %d caratteri

# error.upperCaseCharacterRequired
source: The password must at least contain one upper case char
ar: يجب أن تحتوي كلمة المرور على الأقل على حرف كبير
it: La password deve contenere almeno un carattere maiuscolo

# error.lowerCaseCharacterRequired
source: The password must at least contain one lower case char
ar: يجب أن تحتوي كلمة المرور على الأقل على حرف صغير
it: La password deve contenere almeno un carattere minuscolo

# error.digitCharacterRequired
source: The password must at least contain one digit
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل
it: La password deve contenere almeno un numero

# error.specialCharacterRequired
source: The password must at least contain one special char
ar: يجب أن تحتوي كلمة المرور على الأقل على حرف مميز
it: La password deve contenere almeno un carattere speciale

# error.notCurrentPassword
source: The password must be different from the old password
ar: يجب أن تكون كلمة المرور مختلفة عن كلمة المرور القديمة
it: La password deve essere diversa dalla vecchia password

# dataHandler.passwordNotSaved
source: Password not saved ({table}:{uid}):
ar: لم يتم حفظ كلمة المرور ({table}:{uid}):
it: Password non salvata ({table}:{uid}):
