Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_misc.xlf
Languages: ar, it

# shortcut_edit
source: Edit
ar: تعديل
it: Modifica

# shortcut_create
source: Create
ar: إنشاء
it: Crea

# shortcut_editID
source: Edit/Search
ar: تعديل/بحث
it: Modifica/Cerca

# shortcut_save
source: Update shortcut title
ar: تحديث عنوان الاختصار
it: Aggiorna il nome dello segnalibro

# shortcut_saveClose
source: Update and close editor
ar: تحديث وإغلاق المُحرر
it: Aggiorna e chiudi editor

# shortcut_close
source: Close shortcut editor
ar: إغلاق مُحرر الاختصار
it: Chiudi l'editor dei segnalibri

# shortcut_delete
source: Remove shortcut
ar: إزالة الاختصار
it: Elimina segnalibro

# shortcut_loadEdit
source: Loading page
ar: جارِ تحميل الصفحة
it: Sto caricando la pagina

# shortcut_searchFor
source: Search for
ar: البحث عن
it: Cerca

# shortcut_notEditable
source: No editable page found!
ar: لم يتم العثور على صفحة قابلة للتعديل!
it: Nessuna pagina modificabile trovata!

# shortcut_group
source: Group
ar: المجموعة
it: Gruppo

# shortcut_group_1
source: Pages
ar: الصفحات
it: Pagine

# shortcut_group_2
source: Records
ar: السجلات

# shortcut_group_3
source: Files
ar: الملفات

# shortcut_group_4
source: Tools
ar: الأدوات
it: Strumenti

# shortcut_group_5
source: Miscellaneous
ar: متنوعات
it: Miscellanea

# shortcut_global
source: Global
ar: عام
it: Globale

# shortcut_all
source: All
ar: الكل
it: Tutti

# shortcut_onlyAdmin
source: You cannot edit a shared shortcut!
ar: لا يمكنك تعديل الاختصار المشترك!
it: Non puoi modificare un segnalibro condiviso!

# shortcut_selSC
source: Select shortcut
ar: حدد الاختصار
it: Seleziona il segnalibro

# shortcut_delAllInCat
source: Delete all shortcuts in this group?
ar: حذف جميع الاختصارات في هذه المجموعة؟
it: Vuoi eliminare tutti i segnalibri in questo gruppo?

# shortcut_onlineWS
source: LIVE workspace
ar: مساحة العمل الحَيّة LIVE
it: Workspace Live

# shortcut_active
source: active
ar: نشط
it: attivo

# shortcut_inactive
source: inactive
ar: غير نشط
it: disattivo

# shortcut_noWSfound
source: ERROR: No workspaces found!
ar: خطأ: لا توجد مساحات عمل!
it: ERRORE: nessun workspace trovato!

# shortcut_FEPreview
source: Enable Frontend Preview
ar: تفعيل مُعاينة الواجهة الأمامية
it: Abilita Anteprima Frontend

# shortcut_workspace
source: Go to Workspace Module
ar: الذهاب إلى وحدة مساحة العمل
it: Vai al Modulo Workspace

# bookmark_edit
source: Edit
ar: تعديل
it: Modifica

# bookmark_create
source: Create
ar: إنشاء
it: Crea

# bookmark_editID
source: Edit/Search
ar: تعديل/بحث
it: Modifica/Cerca

# bookmark_save
source: Update bookmark title
ar: تحديث عنوان الإشارة المرجعية
it: Aggiorna titolo segnalibro

# bookmark_saveClose
source: Update and close editor
ar: تحديث وإغلاق المُحرر
it: Aggiorna e chiudi editor

# bookmark_close
source: Close bookmark editor
ar: إغلاق محرر الإشارات المرجعية
it: Chiudi editor di segnalibri

# bookmark_delete
source: Remove bookmark
ar: إزالة الإشارة المرجعية
it: Rimuovi segnalibro

# bookmark_loadEdit
source: Loading page
ar: جارِ تحميل الصفحة
it: Sto caricando la pagina

# bookmark_searchFor
source: Search for
ar: البحث عن
it: Cerca

# bookmark_notEditable
source: No editable page found!
ar: لم يتم العثور على صفحة قابلة للتعديل!
it: Nessuna pagina modificabile trovata!

# bookmark_group
source: Group
ar: المجموعة
it: Gruppo

# bookmark_group_1
source: Pages
ar: الصفحات
it: Pagine

# bookmark_group_2
source: Records
ar: السجلات
it: Record

# bookmark_group_3
source: Files
ar: الملفات
it: File

# bookmark_group_4
source: Tools
ar: الأدوات
it: Strumenti

# bookmark_group_5
source: Miscellaneous
ar: متنوعات
it: Miscellanea

# bookmark_global
source: Global
ar: عام
it: Globale

# bookmark_all
source: All
ar: الكل
it: Tutti

# bookmark_onlyAdmin
source: You cannot edit a shared bookmark!
ar: لا يمكنك تعديل الإشارة المرجعية المُشتَرَكة!
it: Non puoi modificare un segnalibro condiviso!

# bookmark_selSC
source: Select bookmark
ar: حدد الإشارة المرجعية
it: Seleziona segnalibro

# bookmark_delAllInCat
source: Delete all bookmarks in this group
ar: حذف جميع الإشارات المرجعية في هذه المجموعة
it: Elimina tutti i segnalibri di questo gruppo

# bookmark_onlineWS
source: LIVE workspace
ar: مساحة العمل الحَيّة LIVE
it: Workspace Live

# bookmark_active
source: active
ar: نشط
it: attivo

# bookmark_inactive
source: inactive
ar: غير نشط
it: disattivo

# bookmark_FEPreview
source: Enable Frontend Preview
ar: تفعيل مُعاينة الواجهة الأمامية
it: Abilita Anteprima Frontend

# bookmark_workspaceComparisonView
source: Enable comparison view
ar: تفعيل عرض المقارنة
it: Abilita visualizzazione confronto

source: Overwrite existing files
ar: الكتابة فوق الملفات الموجودة
it: Sovrascrivi i file esistenti

# uploadMultipleFilesInfo
source: Upload multiple files by holding the Shift or CTRL-file pressed while selecting your files (works on modern browsers only).
ar: لتحميل ملفات متعددة، قم بالضغط على زر Shift أو CTRL أثناء تحديد الملفات الخاصة بك (يعمل على المتصفحات الحديثة فقط).
it: Carica più file tenendo premuto il tasto Maiusc (Shift) o il tasto Ctrl durante la selezione dei file (funziona solo per browser moderni).

# fileMetaDataLocation
source: Location
ar: الموقع
it: Posizione

# fileMetaErrorInvalidRecord
source: File meta data not found
ar: تعذر العثور على بيانات التعريف للملف
it: Metadati del file non trovati

# selectPosition
source: Select a position for the new page
ar: حدد موضع للصفحة الجديدة
it: Seleziona la posizione della nuova pagina

source: Page (select position)
ar: الصفحة (اختيار موضع)
it: Pagina (seleziona posizione)

source: Go back
ar: رجوع
it: Indietro

# createNewPage
source: Create a new page
ar: إنشاء صفحة جديدة
it: Crea nuova pagina

# insertNewPageHere
source: Insert the new page here
ar: أدخل الصفحة الجديدة هنا
it: Inserisci qui la nuova pagina

source: Insert new record here
ar: إدراج سجل جديد هنا
it: Inserisci qui il nuovo record

# movePageToHere
source: Move page to this position
ar: نقل الصفحة إلى هذا الموضع
it: Sposta la pagina in questa posizione

# moveElementToHere
source: Move element to this position
ar: نقل العنصر إلى هذا الموضع
it: Sposta l'elemento in questa posizione

source: Move element
ar: نقل العنصر
it: Sposta elemento

source: Move elements
ar: نقل العناصر
it: Sposta elementi

source: Copy elements
ar: نسخ العناصر
it: Copia elementi

# selectPositionOfElement
source: Select position of the element
ar: حدد موضع العنصر
it: Scegli la posizione dell'elemento

# movingElement
source: Move element
ar: نقل العنصر
it: Sposta elemento

# makeCopy
source: Make copy instead of moving element
ar: إنشاء نسخة بدلاً من نقل العنصر
it: Crea una copia invece di spostare l'elemento

# newRecordWizard.filter.placeholder
source: Search for any record type
ar: البحث عن أي نوع من السِجلات
it: Cerca per ogni tipo di record

# newRecordWizard.filter.noResults
source: Unfortunately no record type matches your query, please try a different one.
ar: لسوء الحظ، لا يوجد نوع سِجل يطابق الاستعلام الخاص بك، يرجى تجرِبة محتوى مختلف.
it: Sfortunatamente nessun tipo di record corrisponde alla tua ricerca; per favore provane una diversa.

source: New content element
ar: عنصر محتوى جديد
it: Nuovo elemento di contenuto

# newContentElement.filter.label
source: Filter by:
ar: التصفية حسب:
it: Filtra per:

# newContentElement.filter.placeholder
source: Search for any content type
ar: البحث عن أي نوع من المحتوى
it: Cerca un tipo di contenuto

# newContentElement.filter.noResults
source: Unfortunately no content type matches your query, please try a different one.
ar: لسوء الحظ، لا يوجد نوع محتوى يطابق الاستعلام الخاص بك، يرجى تجرِبة محتوى مختلف.
it: Sfortunatamente nessun tipo di contenuto corrisponde alla tua ricerca; per favore provane una diversa.

source: System Records
ar: سجلات النظام
it: Record di sistema

# recordgroup.content
source: Content
ar: مُحتوى
it: Contenuto

# recordgroup.backendaccess
source: Backend Access
ar: صَلاحِيَة الدخول إلى الواجهة الخلفية
it: Accesso Backend

# recordgroup.frontendaccess
source: Frontend Access
ar: صَلاحِيَة الدخول إلى الواجهة الأمامية
it: Accesso Frontend

# 1_selectType
source: First select the type of the new content element
ar: حدد أولاً نوع عنصر المحتوى الجديد
it: Seleziona prima il tipo del nuovo elemento di contenuto

# 2_selectPosition
source: Now click on the position of the new content element
ar: الآن انقر فوق موضع عنصر المحتوى الجديد
it: Ora clicca sulla posizione del nuovo elemento di contenuto

# CM_history
source: History/Undo
ar: التاريخ/التراجع
it: Cronologia/Annulla

# CM_hideInMenus
source: Hide in menu
ar: إخفاء في القائمة
it: Nascondi nel menù

# CM_showInMenus
source: Show in menu
ar: إظهار في القائمة
it: Mostra nel menù

# CM_perms
source: Access
ar: صَلاحِيَة الدخول
it: Accesso

# CM_moveWizard
source: Move element
ar: نقل العنصر
it: Sposta elemento

# CM_moveWizard_page
source: Move page
ar: نقل الصفحة
it: Sposta pagina

# CM_newWizard
source: 'Create New' wizard
ar: 'إنشاء جديد' معالج
it: Nuovo (procedura guidata)

# CM_editPageProperties
source: Edit page properties
ar: تعديل خصائص الصفحة
it: Modifica proprietà pagina

# noEditPage
source: You asked to edit page "%s" but you cannot edit this page. Now loading backend as usual.
ar: لقد طلبت تعديل الصفحة "%s" ولكن لا يمكنك تعديلها، يمكنك الآن تحميل الواجهة الخلفية كالمعتاد.
it: Non puoi modificare la pagina "%s". Ora il backend viene caricato come al solito.

source: Localize
ar: توطين
it: Localizza

# localize.isLocalizable
source: Record can be localized
ar: السجل يمكن توطينه
it: Il record può essere localizzato

# localize.wasRemovedInOriginal
source: Record was removed in original language
ar: تم إزالة السجل في اللغة الأساسية
it: Il record in lingua originale è stato rimosso

source: Localize all records
ar: توطين جميع السجلات
it: Localizza tutti i record

source: Synchronize with original language
ar: المزامنة مع اللغة الأصلية
it: Sincronizza con la lingua originale

# pageTree_filter
source: Filter
ar: تصفية
it: Filtro

# fileUpload_windowTitle
source: File Upload Progress
ar: مستوى تقدم التحميل
it: Avanzamento caricamento file

# fileUpload_buttonSelectFiles
source: Select Files
ar: حدد الملفات
it: Seleziona file

# fileUpload_buttonCancelAll
source: Cancel All Uploads
ar: إلغاء جميع التحميلات
it: Annulla Tutti i Caricamenti

# fileUpload_infoComponentMaxFileSize
source: You can upload files with a maximum size of {0}.
ar: يمكنك تحميل الملفات بحد أقصى للحجم {0}.
it: Puoi caricare file con dimensione massima {0}.

# fileUpload_infoComponentFileUploadLimit
source: You can upload a total of {0}.
ar: يمكنك تحميل مجموع الـ {0}.
it: Puoi caricare un totale di {0} file.

# fileUpload_infoComponentFileTypeLimit
source: You can upload the following file types {0}.
ar: يمكنك تحميل أنواع الملفات التالية {0}.
it: Puoi caricare i seguenti tipi di file {0}.

# fileUpload_infoComponentOverrideFiles
source: Overwrite existing files
ar: الكتابة فوق الملفات الموجودة
it: Sovrascrivi i file esistenti

# fileUpload_processRunning
source: Another process is already uploading
ar: هنالك عملية أخرى قيد التحميل بالآن
it: Un altro processo di caricamento è già in atto.

# fileUpload_uploadWait
source: Waiting to start upload of {0}
ar: في انتظار بدء تحميل {0}
it: In attesa di iniziare il caricamento di {0}

# fileUpload_uploadStarting
source: Starting upload of {0}
ar: بدء تحميل الـ {0}
it: Inizio caricamento di {0}

# fileUpload_uploadProgress
source: {0}% of {1} uploaded
ar: {0}% من {1} تم تحميلها
it: {0}% di {1} caricato

# fileUpload_uploadSuccess
source: {0} was successfully uploaded!
ar: تم رفع {0} بنجاح!
it: {0} caricato con successo!

# pagetree_networkErrorTitle
source: Page tree error
ar: خطأ في شجرة الصفحة
it: Errore dell'Albero delle Pagine

# pagetree_networkErrorDesc
source: Got unexpected response from the server. Please check logs for details.
ar: حصلت على استجابة غير متوقعة من الخادم. الرجاء التحقق من السجلات للحصول على التفاصيل.
it: Ricevuta una risposta inaspettata dal server. Controlla i log per i dettagli.

# tree_networkError
source: Navigation loading error
ar: خطأ في تحميل التنقل
it: Errore di caricamento navigazione

# tree_networkErrorDescription
source: Got unexpected response from the server. Please check logs for details.
ar: حصلت على استجابة غير متوقعة من الخادم. الرجاء التحقق من السجلات للحصول على التفاصيل.
it: Ricevuta una risposta inaspettata dal server. Controlla i log per i dettagli.

# fileUpload_errorQueueLimitExceeded
source: Too many files selected
ar: تم تحديد عدد كبير جداً من الملفات
it: Troppi files selezionati

# fileUpload_errorQueueFileSizeLimit
source: {0} is too big
ar: {0} الملف كبير للغاية
it: {0} è troppo grande

# fileUpload_errorQueueZeroByteFile
source: {0} is empty
ar: {0} فارغ
it: {0} è vuoto

# fileUpload_errorQueueInvalidFiletype
source: Filetype not allowed for {0}
ar: نوع الملف غير مسموح به لـ {0}
it: Il tipo di file non è consentito per {0}

# fileUpload_errorUploadHttp
source: Too many files selected
ar: تم تحديد عدد كبير جداً من الملفات
it: Troppi files selezionati

# fileUpload_errorUploadHttpError
source: A HTTP error occurred: {0}
ar: حدث خطأ في HTTP: {0}
it: Errore HTTP: {0}

# fileUpload_errorUploadMissingUrl
source: Internal error: No Upload URL set
ar: خطأ داخلي: لم يتم تعيين عنوان URL للتحميل
it: Errore interno: nessun URL di caricamento impostato

# fileUpload_errorUploadIO
source: Internal error: Problems while reading/writing the file
ar: خطأ داخلي: مشاكل أثناء قراءة/كتابة الملف
it: Errore interno: problemi nel leggere/scrivere il file

# fileUpload_errorUploadSecurityError
source: Internal error: {0}
ar: خطأ داخلي: {0}
it: Errore interno: {0}

# fileUpload_errorUploadLimit
source: Upload limit exceeded
ar: تم تجاوز حد التحميل
it: Superato il limite di caricamento

# fileUpload_errorUploadFailed
source: Upload failed
ar: فشل التحميل
it: Caricamento fallito

# fileUpload_errorUploadFileIDNotFound
source: Internal error: File ID not found
ar: خطأ داخلي: لم يتم العثور على مُعرّف الملف ID
it: Errore interno: ID del file non trovato

# fileUpload_errorUploadFileValidation
source: Internal error while validating the file
ar: خطأ داخلي أثناء التحقق من صحة الملف
it: Errore interno durante la validazione del file

# fileUpload_errorUploadFileCancelled
source: Upload of {0} canceled
ar: تم إلغاء تحميل {0}
it: Caricamento di {0} annullato

# fileUpload_errorUploadStopped
source: Upload of {0} stopped
ar: توقف تحميل {0}
it: Caricamento di {0} interrotto

# fileUpload_allErrorMessageTitle
source: All uploads failed
ar: فشل جميع عمليات التحميل
it: Tutti i caricamenti sono falliti

# fileUpload_allErrorMessageText
source: All of your uploads failed.<br /><br />If this problem persists, please try another browser, contact your administrator or disable this "Flash Uploader" in your User Settings.<br /><br />Detailed problem description:<br />
ar: فشل كل التحميلات. <br /><br /> إذا استمرت هذه المشكلة، يرجى تجرِبة مُتصفّح آخر، أو اتصل بالمسؤول الخاص بك أو عطّل خِيار "Flash Uploader" في إعدادات المستخدم الخاصة بك. <br /><br /> تفاصيل وصف المشكلة: <br />
it: Tutti i caricamenti sono falliti.<br /><br />Se il problema persiste, prova un altro browser, contatta il tuo amministratore o disabilita questo caricatore Flash (plugin del browser) nelle Impostazioni Utente.<br /><br />Descrizione dettagliata del problema:<br />

# fileUpload_allError401
source: The server returned the status code 401, which is related to a .htaccess file used for password protection on your server. Unfortunately this can not be handled by your browser's Flash plugin.
ar: أعاد الخادم رمز الحالة 401، الذي يتصل بملف .htaccess الذي يُستخدم لحماية كلمة المرور على الخادم الخاص بك. للأسف لا يمكن التعامل مع هذا بواسطة ملحق فلاش في المتصفح الخاص بك.
it: Il server ha restituito il codice di stato 401, relativo a un file .htaccess, utilizzato per la protezione da password sul tuo server. Purtroppo questo non può essere gestito dal plugin Flash del tuo browser.

# fileUpload_allError2038
source: An input/output error occurred (Error #2038). This i.e. happens with servers using a self-signed SSL certificate, which is a limitation of your browser's Flash plugin.
ar: حدث خطأ في الإدخال/الإخراج (خطأ #2038). أي إن هذا يحدث مع الخوادم باستخدام شهادة SSL الموقعة ذاتيا، وهو قيد على الملحق الفلاش في المتصفح الخاص بك.
it: Si è verificato un errore di input/output (Error #2038). Questo vale per i server che utilizzano un certificato SSL autofirmato, che è una limitazione del plugin Flash del browser.

# synchronizeRelations.afterFolderRenamed
source: %d %s records referencing the renamed directory were updated.
ar: تم تحديث %d %s من السجلات التي تشير إلى الدليل المعاد تسميته.
it: %d %s record, che fanno riferimento alla cartella rinominata, sono stati aggiornati.

# liveSearch_title
source: Short result list
ar: قائمة نتائج قصيرة
it: Risultati

# liveSearch_emptyText
source: Enter search term
ar: أدخل مصطلح البحث
it: Inserisci termine di ricerca

# liveSearch_loadingText
source: Searching...
ar: جارِ البحث...
it: Ricerca in corso...

# liveSearch_listEmptyText
source: No results found.
ar: لم يتم العثور على أي نتائج.
it: Nessun risultato trovato.

# liveSearch_helpTitle
source: How to use advanced search tags
ar: كيفية استخدام علامات البحث المتقدمة
it: Come usare i tags per la ricerca avanzata

# liveSearch_helpDescription
source: Search in certain tables
ar: البحث في جداول مُعينة
it: Cerca in determinate tabelle

# liveSearch_helpDescriptionPages
source: #page:Home will search for all pages with the title "Home"
ar: #page:Home سوف يبحث عن جميع الصفحات بعنوان "Home"
it: #page:Home cercherà tutte le pagine con il titolo "Home"

# liveSearch_helpDescriptionContent
source: #content:Professional will search for all content elements containing the term "Professional"
ar: #content:Professional سوف يبحث عن جميع عناصر المحتوى التي تحتوي على مصطلح "الاحترافي"
it: #content:Professionale cercherà tutti gli elementi di contenuto contenenti il termine "Professionale"

# liveSearch_help.shortcutOpen
source: You can open the live search by pressing the Ctrl+K or Cmd+K keystroke
ar: يمكنك فتح البحث المباشر عن طريق الضغط على Ctrl+K أو Cmd+K
it: Puoi aprire la ricerca premendo la combinazione di tasti Ctrl+K o Cmd+K

# viewport_navigation_show
source: Show Navigation
ar: إظهار شريط التنقل
it: Mostra Navigazione

# viewport_navigation_hide
source: Hide Navigation
ar: إخفاء شريط التنقل
it: Nascondi Navigazione
