Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_sysfilem.xlf
Languages: ar, fr, it

# .description
source: Filemounts describe a filepath on the server, relative or absolute.
ar: تصف الملفّات المرفقة مسار المِلَفّ على الخادم، سواءً بشكل نسبي أو مطلق.
fr: Le montage de fichiers décrit un chemin sur le serveur, relatif ou absolu.
it: Il Filemount rappresenta un nodo nell'Albero dell Cartelle oppure, detto in altro modo, è un riferimento a una cartella di uno Storage. I Filemount sono utilizzati per concedere l'accesso, a utenti di backend, a nodi specifici dell'Albero delle Cartelle.

# .details
source: By creating a file mount record and placing a reference to it in a Backend usergroup you can allow a user access to the file mount in the File>List module. Filemounts may also configure access to a path on the server to which the user has FTP-access. Just remember to set file-permissions on the server correctly so the webserver user (which PHP is running as) has at least read access to the FTP-dir. You can only mount absolute paths if they are within the base path set in $TYPO3_CONF_VARS[BE][lockRootPath]
ar: بواسطة إنشاء سجل تحميل المِلَفّ ووضع مرجع إليه في مجموعة مستخدمي الواجهة الخلفية، يمكنك السماح للمستخدم بالوصول إلى تركيب المِلَفّ في الملف>وحدة القائمة. قد تقوم Filemounts أيضا بتهيئة الوصول إلى المسار على الخادم الذي يمكن للمستخدم الوصول إليه على FTP. فقط تذكر تعيين أُذُونات المِلَفّ على الخادم بشكل صحيح بحيث أن مستخدم خادم الويب (الذي يعمل PHP كذلك) لديه على الأقل صَلاحِيَة للقراءة على FTP-dir. يمكنك بناء المسارات المطلقة فقط إذا كانت داخل المسار الأساسي المحدد في $TYPO3_CONF_VARS[BE][lockRootPath]
fr: En créant un enregistrement de montage de fichier et en plaçant une référence dans un groupe d'utilisateurs Backend, vous pouvez autoriser un utilisateur à accéder au montage de fichier dans le module Fichiers>Liste. Les montages de fichiers peuvent également configurer l'accès à un chemin sur le serveur auquel l'utilisateur a accès FTP. N'oubliez pas de définir correctement les permissions de fichier sur le serveur afin que l'utilisateur du serveur web (celui que PHP utilise) ait au moins un accès en lecture au répertoire FTP. Vous ne pouvez monter des chemins absolus que s'ils sont dans le chemin de base défini dans $TYPO3_CONF_VARS[BE][lockRootPath]
it: Creando un record Filemount e includendolo in un gruppo di utenti Backend (File Mounts) è possibile consentire l'accesso a cartelle specifiche, dell'Albero delle Cartelle, utilizzando il modulo File>Lista File. Un Filemount può anche configurare l'accesso a un percorso sul server web a cui l'utente ha accesso via FTP. In questo caso è necessario impostare i permessi di accesso a cartelle e file, sul server, in modo corretto affinché l'utente, del server web, abbia almeno l'accesso in lettura alla cartella FTP. Puoi montare percorsi assoluti ed esterni alla webroot solo se sono all'interno del percorso impostato in $TYPO3_CONF_VARS[BE][lockRootPath]

# _.seeAlso
source: be_groups:file_mountpoints, be_users:file_mountpoints, More about File mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
ar: be_groups:file_mountpoints، be_users:file_mountpoints، المزيد عن ملفات التركيب <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
fr: be_groups:file_mountpoints, be_users:file_mountpoints, En savoir plus sur Montage de fichiers | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
it: be_groups:file_mountpoints, be_users:file_mountpoints, Altro su File mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/

# title.description
source: Enter a title for the filemount. The title will appear as the name of the file mount when it is applied to users and groups.
ar: أدخل عنوان filemount. سيظهر العنوان كاسم file mount عندما يتم تطبيقه على المستخدمين والمجموعات.
fr: Saisir un titre pour le montage de fichier. Le titre apparaîtra comme nom du montage de fichier quand il est appliqué aux utilisateurs et aux groupes
it: Inserisci una etichetta per il Filemount: apparirà come identificativo, del nodo dell'Albero delle Cartelle, quando sarà da assegnare, a Utenti o Gruppi di backend, nel campo "File Mounts - Nodi Albero delle Cartelle".

# path.description
source: Enter the path of the filemount, relative or absolute depending on the settings of BASE.
ar: أدخل مسار filemount النسبي أو المطلق تبعاً لإعدادات BASE.
fr: Entrer le chemin du montage de fichier, relatif ou absolu selon les options de configuration de « BASE »
it: Seleziona la cartella nello Storage da assegnare al Filemount.

# path.details
source: If BASE is set to relative, the path mounted is found in the subfolder "fileadmin/" of the website. Then you should enter the subfolder in "fileadmin/" as path. For instance if you want to mount access to "fileadmin/user_uploads/all/" then enter the value "user_uploads/all" as the value of PATH. If BASE is absolute you should enter the absolute path on the server, eg. "/home/ftp_upload" or "C:/home/ftp_upload". Further you must make sure the configuration variable $TYPO3_CONF_VARS[BE][lockRootPath] contains the first part of the path you want to mount. <strong>Notice:</strong> In any case, make sure the webserver user which PHP is running as has <em>at least</em> read-access to the path. If not, the mount will simply not appear without any warnings. If you have problems - especially with absolute mounts - try to mount something "simple" like a relative path in fileadmin. If that is working well, try the absolute path. Your PHP-configuration may also impose other restrictions on you if open_basedir is enabled. Then use relative paths.
ar: إذا تم تعيين BASE إلى النسبي، المسار المثبت يتم العثور عليه في المجلد الفرعي "fileadmin/" من الموقع. ثم يجب عليك إدخال المجلد الفرعي في "fileadmin/" كمسار. على سبيل المثال إذا كنت ترغب في تحميل الوصول إلى "fileadmin/user_uploads/all/" ثم أدخل القيمة "user_uploads/all" كقيمة لـ PATH. إذا كان BASE مطلقاً يجب عليك إدخال المسار المطلق على الخادم، على سبيل المثال "/home/ftp_upload" أو "C:/home/ftp_upload". كذلك يجب عليك التأكد من أن متغير التكوين $TYPO3_CONF_VARS[BE][lockRootPath] يحتوي على الجزء الأول من المسار الذي تريد تحميله. <strong>إشعار:</strong> في أي حالة، تحقق أن مستخدم خادم الويب الذي يعمل به PHP كما لديه <em>على الأقل</em> الوصول للقراءة إلى المسار. وإذا لم يكن الأمر كذلك، فلن يظهر هذا المبنى دون أي تحذيرات. إذا كان لديك مشكلات -خاصة مع الكتل المطلقة- حاول تركيب شيء "بسيط" مثل المسار النسبي في fileadmin. إذا كان ذلك يعمل بشكل جيد، حاول المسار المطلق. قد يفرض تكوين PHP-الخاص بك أيضاً قيوداً أخرى عليك إذا تم تمكين open_basedir. ثم استخدم المسارات النسبية.
fr: Si BASE est définie comme relative, le chemin monté se trouve dans le sous-dossier "fileadmin/" du site web. Ensuite, vous devez entrer le sous-dossier dans "fileadmin/" comme chemin. Par exemple, si vous voulez monter l'accès à "fileadmin/user_uploads/all/" puis entrez la valeur "user_uploads/all" comme valeur de PATH. Si BASE est absolue, vous devez entrer le chemin absolu sur le serveur, par exemple "/home/ftp_upload" ou "C:/home/ftp_upload". En outre, vous devez vous assurer que la variable de configuration $TYPO3_CONF_VARS[BE][lockRootPath] contient la première partie du chemin que vous voulez monter. <strong>Remarque :</strong> Dans tous les cas, assurez-vous que l'utilisateur du serveur web que PHP utilise a <em>au moins</em> accès en lecture au chemin. Si ce n'est pas le cas, le montage n'apparaîtra tout simplement pas sans avertissement. Si vous avez des problèmes - surtout avec des montages absolus - essayez de monter quelque chose de "simple" comme un chemin relatif dans fileadmin. Si cela fonctionne bien, essayez le chemin absolu. Votre configuration PHP peut également vous imposer d'autres restrictions si open_basedir est activé. Utilisez alors des chemins relatifs.
it: <b>Riguardo la configurazione dello Storage</b>: se 'Tipo Percorso' è impostato su relativo, il percorso montato si trova nella sottocartella "fileadmin/" del sito web. Quindi dovresti inserire una sottocartella di "fileadmin/" come percorso. Per esempio, se desideri montare "fileadmin/user_uploads/all/", devi inserire "user_uploads/all" come valore di 'Percorso Base'. Se 'Tipo Percorso' è assoluto, dovresti inserire il percorso assoluto sul server, ad esempio "/home/ftp_upload" o "C:/home/ftp_upload". Inoltre devi assicurarti che la variabile di configurazione $TYPO3_CONF_VARS[BE][lockRootPath] contenga la cartella padre del percorso che vuoi montare, ad esempio "/home/", "C:/home/". <strong>Nota:</strong> in ogni caso, assicurati che l'utente del server web, che sta eseguendo PHP, abbia <em>almeno</em> accesso in lettura al percorso. In caso contrario, lo specifico Albero delle Cartelle non apparirà, senza alcun avvertimento. Se hai problemi, soprattutto con i percorsi assoluti, prova a montare qualcosa di "semplice" come un percorso relativo a fileadmin. Se questo funziona bene, prova il percorso assoluto. La tua configurazione PHP potrebbe anche imporre altre restrizioni se open_basedir (direttiva PHP) è impostato. Quindi usa i percorsi relativi.

# _path.seeAlso
source: sys_filemounts:base, be_groups:file_mountpoints, sys_filemounts
ar: sys_filemounts:base, be_groups:file_mountpoint sys_filemounts

# path.image_descr
source: This is a filemount relative to "fileadmin/". The mounted folder is "fileadmin/user_upload/" since "user_upload" is the value of the "Path" field. The directory structure of "fileadmin/" where you can see the "user_upload" folder in the bottom of the list.
ar: هذا مِلَفّ ذو صلة بـ "fileadmin/". المجلد المثبت هو "fileadmin/user_upload/" لأن "user_upload" هو قيمة حقل "المسار". بنية الدليل "fileadmin/" حيث يمكنك رؤية مجلد "user_upload" في أسفل القائمة.
fr: Ceci est un montage de fichier relatif à "fileadmin/". Le dossier monté est "fileadmin/user_upload/" depuis "user_upload" et correspond à la valeur du champ "Chemin". La structure du dossier de "fileadmin/" où vous pouvez voir le dossier "user_upload" est placé en bas de la liste.
it: Questo è un filemount relativo a "fileadmin/". La cartella montata è "fileadmin/user_upload/" poiché "user_upload" è il valore del campo "Cartella". La struttura della directory di "fileadmin/" dove puoi vedere la cartella "user_upload" in fondo alla lista.

# hidden.description
source: Unchecking this option temporarily disables the filemount.
ar: استخدم هذا الخِيار لتعطيل filemount مؤقتاً.
fr: Décocher cette option désactive temporairement le montage de fichier.
it: Deselezionare quest'opzione per disabilitare temporaneamente il filemount.

# hidden.details
source: All backend users using the mount will not have access anymore. This includes 'Admin'-users.
ar: لن يتمكن جميع مستخدمي الواجهة الخلفية الذين يستخدمون mount من الوصول بعد الآن. ويشمل هذا 'المشرفين' أيضاً.
fr: Tous les utilisateurs backend utilisant ce point de montage n'auront plus accès à rien. Cela inclut également les utilisateurs de type "Admin".
it: Tutti gli utenti del backend che usano l'Albero delle Cartelle non avranno più accesso. Questo include utenti admin.

# base.description
source: Determines whether the value of the PATH field is to be recognized as an absolute path on the server or a path relative to the fileadmin/ subfolder to the website.
ar: يحدد ما إذا كان سيتم التعرف على قيمة حقل PATH كمسار مطلق على الخادم أو مسار يتعلق بالملف أو المجلد الفرعي إلى الموقع.
fr: Détermine si la valeur du champ « Chemin » doit être reconnue comme un chemin absolu sur le serveur ou un chemin relatif au sous-dossier « fileadmin/ » du site web.
it: Seleziona da quale Storage scegliere la cartella da assegnare al Filemount.

# read_only.description
source: Display this file mount as read-only.
ar: عرض file mount كمقروء فقط.
fr: Afficher ce montage en lecture seule.
it: Imposta questo Albero delle Cartelle in sola lettura.

# read_only.details
source: Read-only file mounts are displayed in the Filelist and the Element Browser. They allow displaying of files and folders which are neither writable nor editable for the user.
ar: يتم عرض file mounts للقراءة فقط في المِلَفّ ومستعرض العنصر. تسمح بعرض الملفات والمجلدات التي ليست قابلة للكتابة أو التعديل للمستخدم.
fr: Les montages de fichiers en lecture seule sont affichés dans la liste de fichiers et dans le navigateur d'éléments. Ils permettent l'affichage de fichiers et de dossiers qui ne sont pas modifiables pour l'utilisateur.
it: Gli Alberi delle Cartelle in sola lettura sono visualizzati sia nel riquadro di navigazione che nel Navigatore Elementi. Consentono la visualizzazione di file e cartelle che non sono né scrivibili né modificabili per l'utente.
