Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_*_groups.xlf
Languages: ar, fr, it

# explicit_allowdeny.details
source: Selector box fields can be configured for access control on value level. This list represents all values that are configured for access control. Each value can be configured to require either explicit access (Allow) or explicit denial (Deny). If a value has the prefix "Allow" (green icon) it means that by default users <em>cannot</em> set this value unless they are member of a user group which explicitly allows it (by setting this checkbox). If a value has the prefix "Deny" (red icon) it means that by default users can set this value unless they are member of a user group which explicitly denies it (by setting this checkbox). The list is organized so values from the same selector box is listed together. If values from a selectorbox is not present in the allow/deny list it simply means they are not evaluated and hence they can be set by anyone having access to the field in general.
ar: يمكن تكوين حقول صندوق المحدد للتحكم في الوصول إلى مستوى القيمة. تمثل هذه القائمة جميع القيم التي تم تكوينها للتحكم في الوصول. يمكن تكوين كل قيمة لطلب إما وصول صريح (سماح) أو رفض صريح (رفض). إذا كانت هناك قيمة بالبادئة "سماح" (رمز أخضر) فهذا يعني أنه افتراضياً للمستخدمين <em> لا يمكن </em> قم بتعيين هذه القيمة ما لم يكونوا أعضاء في مجموعة مستخدمين تسمح بذلك صراحة (عن طريق تعيين مربع الاختيار هذا). إذا كان للقيمة البادئة "Deny" (الرمز الأحمر) ، فهذا يعني أنه يمكن للمستخدمين افتراضياً تعيين هذه القيمة ما لم يكونوا أعضاء في مجموعة مستخدمين ترفضها صراحة (عن طريق تعيين مربع الاختيار هذا). تم تنظيم القائمة بحيث يتم سرد القيم من نفس مربع المحدد معاً. إذا كانت القيم من مربع التحديد غير موجودة في قائمة السماح / الرفض ، فهذا يعني ببساطة أنه لم يتم تقييمها وبالتالي يمكن تعيينها من قبل أي شخص لديه حق الوصول إلى الحقل بشكل عام.
fr: Les champs de la boîte de sélection peuvent être configurés pour le contrôle d'accès au niveau de la valeur. Cette liste représente toutes les valeurs qui sont configurées pour le contrôle d'accès. Chaque valeur peut être configurée pour exiger un accès explicite (Autoriser) ou un refus explicite (Refuser). Si une valeur a le préfixe "Autoriser" (icône verte) cela signifie que par défaut les utilisateurs <em>ne peuvent pas</em> définir cette valeur à moins qu'ils ne soient membres d'un groupe d'utilisateurs qui l'autorise explicitement (en définissant cette case à cocher). Si une valeur a le préfixe "Refuser" (icône rouge), cela signifie que par défaut les utilisateurs peuvent définir cette valeur à moins qu'ils ne soient membres d'un groupe d'utilisateurs qui le refuse explicitement (en définissant cette case à cocher). La liste est organisée de sorte que les valeurs de la même boîte de sélection sont listées ensemble. Si les valeurs d'une boîte de sélecteur ne sont pas présentes dans la liste autoriser/refuser, cela signifie simplement qu'elles ne sont pas évaluées et qu'elles peuvent donc être définies par toute personne ayant accès au champ en général.
it: I campi di selezione, come i menù a tendina, possono essere configurati per il controllo degli accessi per singolo valore. Questa lista rappresenta tutti i valori che sono configurati per il controllo degli accessi. Ogni valore può essere configurato per richiedere un accesso esplicito (Consenti) o un rifiuto esplicito (Nega). Se un valore è preceduto da "[Consenti]" (icona verde) significa che per default gli utenti <em>non possono</em> impostare questo valore, a meno che non siano membri di un gruppo utente che lo consenta esplicitamente (spuntando la relativa checkbox). Se un valore ha il prefisso "Nega" (icona rossa) significa che per impostazione predefinita gli utenti possono impostare questo valore, a meno che non siano membri di un gruppo utente che lo neghi esplicitamente (spuntando la relativa checkbox). La lista è organizzata in modo che i valori, dello stesso campo di selezione, siano elencati insieme. Se i valori di un campo di selezione non sono presenti nella lista consenti/nega, significa semplicemente che non sono valutati e quindi possono essere impostati da chiunque abbia accesso al campo in generale.

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
ar: حدد لغات التسجيل التي يقتصر تعديلها على أعضاء المجموعة.
fr: Choisissez les langues auxquelles le groupe à les droits d'éditions.
it: Seleziona a quali lingue i membri del gruppo sono limitati alla modifica.

# allowed_languages.details
source: Records in TYPO3 can be configured to carry information about their language. If that is the case access to these elements will also be evaluated based on whether the user has the language in question included from this list. If a user has no languages listed all together it simply means that he can edit <em>all</em> languages!
ar: يمكن تكوين السجلات في TYPO3 لنقل المعلومات عن لغتهم. وإذا كان الأمر كذلك، فإن الوصول إلى هذه العناصر سيتم أيضا تقييمه استناداً إلى ما إذا كان لدى المستخدم اللغة المعنية المُدرجة في هذه القائمة. إذا لم يكن لدى المستخدم لغات مدرجة جميعها معاً، فذلك يعني ببساطة أنه يستطيع تحرير <em> جميع </em> اللغات!
fr: Les enregistrements dans TYPO3 peuvent contenir des informations concernant leur langue. Si c'est le cas alors l'accès à ces enregistrements est permis uniquement si l'utilisateur à cette langue dans sa liste. Si un utilisateur na pas de langue dans sa liste alors cela signifie qu'il peut éditer <em>toutes</em> les langues!
it: I record in TYPO3 possono essere configurati per avere informazioni sulla lingua di appartenenza. In tal caso, l'accesso a questi elementi sarà valutato sulla base della disponibilità della lingua, in questione, da parte dell'utente. Se un utente non ha lingue assegnate, significa che può modificare <em>tutte</em> le lingue!

# allowed_languages.image_descr
source: This example shows a situation where two languages, Danish and German, are created in addition to the default language.
ar: يُوضّح هذا المثال موقفاً يتم فيه إنشاء لُغتين، الدنماركية والألمانية، بالإضافة إلى اللغة الإفتراضية.
fr: Cet exemple montre une situation où deux langues, le danois et l'allemand, sont créées en plus de la langue par défaut.
it: Questo esempio illustra una situazione nella quale due lingue, Danese e Tedesco, sono state create in aggiunta alla lingua di default.

# custom_options.description
source: Select custom permission options.
ar: حدد خيارات الإذن المخصصة.
fr: Choisissez les options de permission personnalisées.
it: Seleziona le opzioni per i permessi personalizzati.

# custom_options.details
source: This list represents custom permissions introduced by various backend modules (from extensions). The significance of each option depends on the backend module that evaluates it.
ar: تمثل هذه القائمة أُذونات مخصصة مقدمة من وحدات الواجهة الخلفية المختلفة (من الإضافات). تعتمد أهمية كل خيار على وحدة الواجهة الخلفية التي تقيمه.
fr: Cette liste représente les permissions personnalisées introduites par différents modules backend (depuis les extensions). La signification de chaque option dépend du module backend qui l'évalue.
it: Questo elenco rappresenta i permessi personalizzati introdotti dai vari moduli di backend (dalle estensioni). Il significato di ogni opzione dipende dal modulo di backend che le valuta.

# custom_options.image_descr
source: This is just an example from an internal test application. It shows how checkboxes are added by a custom module under its own header. You can also show a description text with each checkbox to explain its function.
ar: هذا مجرد مثال من تطبيق اختبار داخلي. يوضح كيفية إضافة مربعات الاختيار بواسطة وحدة مخصصة تحت عنوانها الخاص. يمكنك أيضاً إظهار نص وصفي مع كل خانة اختيار لشرح وظيفتها.
fr: Ceci est juste un exemple d'une application de test interne. Il montre comment les cases à cocher sont ajoutées par un module personnalisé sous son propre en-tête. Vous pouvez également afficher un texte de description avec chaque case à cocher pour expliquer sa fonction.
it: Questo è solo un esempio fornito da una applicazione interna di test. Mostra come le checkbox sono aggiunte da un modulo personalizzato sotto il suo header. Puoi anche vedere un testo descrittivo per ogni checkbox che spiega la sua funzionalità.

# _TSconfig.seeAlso
source: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, TSconfig Reference| https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/, TypoScript Syntax | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/
fr: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, Référence TSconfig| https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/, Syntaxe TypoScript | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/
