Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_mod_web_list.xlf
Languages: ar, it

# mlang_labels_tablabel
source: List of database records
ar: قائمة سجلات قاعدة البيانات
it: Lista dei record del database

# mlang_labels_tabdescr
source: The Web>List module provides low level access to records appearing on a page.
ar: تُوفّر وحدة ويب>القائمة إمكانية وصول منخفضة المستوى إلى السجلات التي تظهر على الصفحة.
it: Il modulo Web>Lista fornisce l'accesso 'a basso livello' ai record di una pagina.

# mlang_tabs_tab
source: List
ar: قائمة
it: Lista

# clip_pasteAfter
source: Paste after: Clipboard content is inserted after this record
ar: لصق بعد: يتم إدخال محتوى الحافظة بعد هذا السجل
it: Incolla dopo: il contenuto della clipboard viene inserito dopo questo record

# clip_pasteInto
source: Paste into: Clipboard content is inserted on this page
ar: لصق في: يتم إدراج محتوى الحافظة في هذه الصفحة
it: Incolla in: il contenuto della clipboard viene inserito in questa pagina

# clip_paste
source: Paste in clipboard content
ar: لصق في محتوى الحافظة
it: Incolla contenuto clipboard

# clip_markRecords
source: Mark All/Mark none
ar: تحديد الجميع/ عدم تحديد أي شيء
it: Seleziona tutti/nessuno

# clip_selectMarked
source: Transfer the selection of records to clipboard
ar: نقل الملفات المنتقاة إلى الحافظة
it: Trasferisci i record selezionati nella clipboard

# clip_duplicates
source: Mark duplicates
ar: تحديد التكرارات
it: Seleziona duplicati

# clip_editMarked
source: Edit marked
ar: تعديل المُحدد
it: Modifica selezionati

# clip_deleteMarked
source: Delete marked
ar: حذف المُحدد
it: Elimina selezionati

# clip_deleteMarkedWarning
source: Are you sure you want to delete all marked records from the table '%s'?
ar: هل أنت متأكد من أنك تريد حذف جميع السجلات المُحددة من الجدول '%s'؟
it: Sei sicuro di voler eliminare tutti i record selezionati dalla tabella '%s'?

# showInfo
source: Info
ar: معلومة
it: Informazioni

# edit
source: Edit record
ar: تعديل السجل
it: Modifica record

# editPage
source: Edit page properties
ar: تعديل خصائص الصفحة
it: Modifica proprietà pagina

# new
source: New record
ar: سجل جديد
it: Nuovo record

# newRecordOfType
source: New %s
ar: %s جديد
it: Nuovo %s

# newPage
source: Create new page after this page
ar: إنشاء صفحة جديدة بعد هذه الصفحة
it: Crea nuova pagina dopo questa

# newRecord
source: Create new record after this record
ar: إنشاء سجل جديد بعد هذا السجل
it: Crea nuovo record dopo questo

# newRecordGeneral
source: Create new record
ar: إنشاء سجل جديد
it: Crea nuovo record

# moveUp
source: Move up in list
ar: تحريك لأعلى في القائمة
it: Sposta su

# moveDown
source: Move down in list
ar: تحريك للأسفل في القائمة
it: Sposta giù

# move_record
source: Re-position content element
ar: إعادة موضع عنصر المحتوى
it: Sposta elemento di contenuto

source: Move page
ar: نقل الصفحة
it: Sposta pagina

# hide
source: Hide record
ar: إخفاء السجل
it: Disabilita

# unHide
source: Un-hide record
ar: إلغاء إخفاء السجل
it: Abilita

source: Hide page
ar: إخفاء الصفحة
it: Disabilita

source: Un-hide page
ar: إلغاء إخفاء الصفحة
it: Abilita

# prevLevel
source: Move this page to the position after the current parent page (Inwards)
ar: نقل هذه الصفحة إلى الموضع بعد الصفحة الأصلية الحالية (الداخل)
it: Sposta questa pagina dopo la pagina padre (verso l'interno)

# nextLevel
source: Move this page to be a subpage of the page above (Outwards)
ar: نقل هذه الصفحة لتكون صفحة فرعية من الصفحة أعلاه (إلى الخارج)
it: Sposta questa pagina come sottopagina della pagina sopra (verso l'esterno)

# delete
source: Delete record (!)
ar: حذف السجل (!)
it: Elimina record (!)

# history
source: History/Undo
ar: التاريخ/التراجع
it: Cronologia/Annulla

source: Display versions
ar: عرض الإصدارات
it: Mostra versioni

# permissions
source: Set permissions for page
ar: تعيين الأذونات للصفحة
it: Imposta i permessi per la pagina

# largeControl
source: Extended view
ar: عرض مُوسّع
it: Vista estesa

# contractView
source: List all tables
ar: أدرج كافة الجداول
it: Elenca tutte le tabelle

# expandView
source: List only this table
ar: أدرج فقط هذا الجدول
it: Elenca solo questa tabella

# collapseExpandTable
source: Collapse and expand records of table "%s"
ar: تصغير وتوسيع سجلات الجدول"%s"
it: Contrai ed espandi i record della tabella "%s"

source: Show clipboard
ar: إظهار الحافظة
it: Mostra clipboard

# editShownColumns
source: Edit all shown fields of the listed records
ar: تعديل جميع الحقول المعروضة من السجلات المدرجة
it: Modifica tutti i campi dei record visualizzati

# editThisColumn
source: Edit the '%s' field of the listed records
ar: تعديل حقل '%s' السجلات المُدْرَجة
it: Modifica il campo '%s' dei record in elenco

# deleteWarning
source: Are you sure you want to delete the record '%s'?
ar: هل أنت متأكد من أنك تريد حذف السجل ''%s'؟
it: Sei sicuro di voler eliminare il record '%s'?

# localization
source: Localization view
ar: عرض التوطين
it: Vista localizzazione

# defaultLanguage
source: Default
ar: افتراضي
it: Predefinito

# multipleLanguages
source: All languages
ar: كل اللغات
it: Tutte le lingue

# Localize
source: Localize to
ar: توطين إلى
it: Localizza in

# viewRecords
source: Viewing records of
ar: عرض سجلات من
it: Stai vedendo i record di

# pageIndicator
source: Page %1$s of %2$d
ar: الصفحة %1$s من %2$d
it: Pagina %1$s di %2$d

# rangeIndicator
source: Records %1$d - %2$d
ar: السجلات %1$d - %2$d
it: Record %1$d - %2$d

# missingTcaColumnsMessageTitle
source: Missing TCA definition
ar: تعريف TCA مفقود
it: Definizione TCA mancante

# missingTcaColumnsMessage
source: No fields for table "%s" have been found. $TCA['%s']['columns'] does not contain the necessary definitions.
ar: لم يتم العثور على أي حقول للجدول "%s". $TCA['%s']['columns'] لا يحتوي على التعاريف الضرورية.
it: Nessun campo per la tabella "%s" è stato trovato. $TCA['%s']['columns'] non contiene le definizioni necessarie.

# noRecordsOnThisPage
source: There are no records on this page.
ar: لا توجد سجلات في هذه الصفحة.
it: Non ci sono record in questa pagina.

# noRecordsOfTypeOnThisPage
source: There are no records of type "%s" on this page.
ar: لا توجد سجلات من نوع "%s" في هذه الصفحة.
it: Non ci sono record di tipo "%s" in questa pagina.

# button.cancel
source: Cancel
ar: إلغاء
it: Annulla

# button.close
source: Close
ar: إغلاق
it: Chiudi

# button.ok
source: OK
ar: موافق

# button.delete
source: Delete
ar: حذف
it: Elimina
