Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_core.xlf
Languages: ar, it

# labels.datepicker.label
source: Open date picker
ar: فتح نافذة التقويم
it: Apri selettore data

# labels.openInNewWindow
source: Open in new window
ar: فتح في نافذة جديدة
it: Apri in una nuova finestra

# labels.goBack
source: Go back
ar: رجوع
it: Indietro

# labels.makeShortcut
source: Create a shortcut to this page?
ar: إنشاء اختصار لهذه الصفحة؟
it: Creare una scorciatoia a questa pagina?

# labels.makeBookmark
source: Create a bookmark to this record
ar: إنشاء إشارة مرجعية لهذا السجل
it: Crea un segnalibro per questo record

# labels.alreadyBookmarked
source: This record is already bookmarked
ar: هذا السجل مَحفُوظَ مُسبقاً
it: Questo record è già presente nei segnalibri

# labels.copyCurrentUrl
source: Copy URL of this record
ar: نسخ عنوان URL لهذا السجل
it: Copia l'URL di questo record

# labels.lockedRecord
source: The user '%s' began to edit this record %s ago.
ar: بدأ المستخدم '%s' في تعديل هذا السجل منذ %s .
it: L'utente '%s' ha iniziato a modificare questo record %s fa.

# labels.lockedRecord_content
source: The user '%s' began to edit content on this page %s ago.
ar: بدأ المستخدم '%s' في تعديل المحتوى على هذه الصفحة منذ %s .
it: L'utente '%s' ha iniziato a modificare il contenuto di questa pagina %s fa.

# labels.lockedRecordUser
source: The %s '%s' began to edit this record %s ago.
ar: بدأ %s '%s' في تعديل هذا السجل منذ %s.
it: %s '%s' ha iniziato a modificare questo record %s fa.

# labels.lockedRecordUser_content
source: The %s '%s' began to edit content on this page %s ago.
ar: بدأ %s '%s' في تعديل المحتوى على هذه الصفحة منذ %s.
it: %s '%s' ha iniziato a modificare il contenuto di questa pagina %s fa.

# labels.color
source: Color
ar: اللون
it: Colore

# labels.user
source: User
ar: مُستخدم
it: Utente

# labels.beUser
source: BE-User
ar: مستخدم الواجهة الخلفية BE
it: Utente BE

# labels.feUser
source: FE-User
ar: مستخدم الواجهة الأمامية FE
it: Utente FE

# labels.unknownUser
source: -Unknown-
ar: غير معروف
it: -Sconosciuto-

# labels.showRecords
source: Show records
ar: عرض التسجيلات
it: Mostra record

# labels.path
source: Path
ar: مسار
it: Percorso

# labels.resetFilter
source: Reset Filter
ar: إعادة ضبط الفلتر
it: Ripristina Filtro

# labels.table
source: Table
ar: جدول
it: Tabella

# labels.upOneLevel
source: Up one level
ar: مستوى واحد لأعلى
it: Su di un livello

# labels.expandTable
source: Expand table
ar: توسيع الجدول
it: Espandi tabella

# labels.collapseTable
source: Collapse table
ar: طَيّ الجدول
it: Contrai tabella

# labels.enterSearchString
source: Enter search term
ar: أدخل مصطلح البحث
it: Inserisci termine di ricerca

# labels.enterSearchLevels
source: This page|1 level down|2 levels down|3 levels down|4 levels down
ar: هذه الصفحة| مستوى واحد للأسفل| مستويان للأسفل| 3 مستويات للأسفل| 4 مستويات للأسفل
it: Questa pagina|1 livello sotto|2 livelli sotto|3 livelli sotto|4 livelli sotto

# labels.searchLevel.0
source: This page
ar: هذه الصفحة
it: Questa pagina

# labels.searchLevel.1
source: 1 level down
ar: 1 مستوى لأسفل
it: 1 livello sotto

# labels.searchLevel.2
source: 2 levels down
ar: 2 مستويات لأسفل
it: 2 livelli sotto

# labels.searchLevel.3
source: 3 levels down
ar: 3 مستويات لأسفل
it: 3 livelli sotto

# labels.searchLevel.4
source: 4 levels down
ar: 4 مستويات لأسفل
it: 4 livelli sotto

# labels.searchLevel.infinite
source: Infinite levels
ar: مُستويات غير نهائية
it: Infiniti livelli

# labels.noEditPermission
source: Sorry, you didn't have proper permissions to perform this change.
ar: عذراً، لم يكن لديك الصلاحيات المناسبة لإجراء هذا التغيير.
it: Spiacente, non hai i permessi adeguati per eseguire questa modifica.

# labels.fieldsMissing
source: The fields marked with an exclamation mark are not yet correctly filled in. Please complete them properly.
ar: الحقول التي تحمل علامة التعجب لم يتم ملؤها بشكل صحيح بعد. يرجى إتمامها بشكل صحيح.
it: I campi contrassegnati con un punto esclamativo non sono ancora stati correttamente valorizzati. Si prega di completarli in modo appropriato.

# labels.fieldsChanged
source: There are unsaved changes in the form! Do you want to continue WITHOUT saving?
ar: هناك تغييرات غير مَحفُوظة في النموذج! هل تريد الاستمرار بدون حفظ التغييرات؟
it: Ci sono modifiche non salvate! Vuoi continuare SENZA salvare?

# labels.remainingCharacters
source: Remaining characters: {0}
ar: الأحرف المُتبقية: {0}
it: Caratteri rimanenti: {0}

# labels.minCharactersLeft
source: Characters missing: {0}
ar: الأحرف مفقودة: {0}
it: Caratteri mancanti: {0}

# labels.maxItemsAllowed
source: A maximum of {0} child records are allowed.
ar: يسمح بحد أقصى {0} من السجلات الثانوية.
it: Un massimo di {0} record figli sono consentiti.

# labels.noRTEfound
source: Notice: This field can only be edited with a Rich Text Editor. No editor is currently available or enabled.
ar: إشعار: لا يمكن تعديل هذا الحقل إلا مع محرر المَتنْ. لا يوجد مُحرر مُتاح حالياً أو مُفعّل.
it: Attenzione: questo campo può essere modificato solo con Rich Text Editor. Non è disponibile o abilitato alcun editor RTE.

# labels.recordInformation
source: Record information
ar: تسجيل المعلومات
it: Informazioni record

# labels.disableRTE
source: Disable Rich Text Editor (RTE)
ar: تعطيل محرر المَتنْ (RTE)
it: Disabilita Rich Text Editor (RTE)

# labels._CONTROL_
source: Control
ar: تحكم
it: Controllo

# labels._PATH_
source: Path
ar: مسار
it: Percorso

# labels._LOCALIZATION_
source: Localization
ar: توطين
it: Localizzazione

# labels._REF_
source: Ref
ar: مرجع
it: Rif

# labels.uid
source: Unique ID
ar: ID فريد
it: ID unico

# labels.pid
source: Parent page ID
ar: ID مُعرّف الصفحة الأصل
it: ID pagina padre

# labels.tstamp
source: Last modified
ar: آخر تعديل
it: Ultima modifica

# labels.crdate
source: Creation date
ar: تاريخ الإنشاء
it: Data di creazione

# labels.cruser_id
source: Created by
ar: أنشِئ بواسطة
it: Creato da

# labels.sorting
source: Sorting
ar: فرز
it: Ordinamento

# labels.t3ver_state
source: Workspace status
ar: حالة مساحة العمل
it: Stato workspace

# labels.t3ver_wsid
source: Workspace ID
ar: ID مُعرّف مساحة العمل
it: ID workspace

# labels.t3ver_oid
source: Live record ID
ar: ID مُعرّف السجل المباشر
it: ID record pubblicato

# labels.setFields
source: Set fields
ar: تعيين الحقول
it: Imposta campi

# labels.search
source: Search
ar: بحث
it: Cerca

# labels.author
source: Author
ar: المُؤلّف
it: Autore

# labels.note
source: Note
ar: ملحوظة
it: Nota

# labels.category
source: Category
ar: فئة
it: Categoria

# labels.reload
source: Reload
ar: إعادة تحميل
it: Ricarica

# labels.language
source: Language
ar: اللغة
it: Lingua

# labels.view
source: View
ar: عرض
it: Mostra

# labels.view.layout
source: Layout
ar: التصميم

# labels.view.language_comparison
source: Language Comparison
ar: مقارنة اللغة
it: Confronto tra lingue

# labels.view.list
source: List
ar: قائمة
it: Elenco

# labels.view.tiles
source: Tiles
ar: المُربّع
it: Griglia

# labels.view.showThumbnails
source: Show thumbnails
ar: عرض الصورة المُصغّرة
it: Mostra le miniature

# labels.view.showClipboard
source: Show clipboard
ar: عرض الحافظة
it: Mostra clipboard

# labels.view.showSearch
source: Show search
ar: إظهار البحث
it: Mostra ricerca

# labels.view.selectColumns
source: Select columns
ar: حدد الاعمدة
it: Seleziona colonne

# labels.share
source: Share
ar: مشاركة
it: Condividi

# labels.csv
source: Download CSV file
ar: تنزيل ملف بصيغة CSV
it: Scarica file CSV

# labels.clear_cache
source: Clear cache for this page
ar: مسح ذاكرة التخزين المؤقت لهذه الصفحة
it: Svuota cache pagina

# labels.no_title
source: No title
ar: بلا عنوان
it: Nessun titolo

# labels.cancel
source: Cancel
ar: إلغاء
it: Annulla

# labels.deactivate
source: Deactivate
ar: الغاء التّفعيل
it: Disattiva

# labels.hidden
source: Hidden
ar: مخفي
it: Disabilitato

# labels.starttime
source: Start
ar: بدء
it: Inizio

# labels.endtime
source: End
ar: نهاية
it: Fine

# labels.minutesHoursDaysYears
source: min|hrs|days|yrs|min|hour|day|year
ar: دقائق|ساعات|أيام|سنوات|دقائق|ساعات|يوم|سنة
it: min|ore|giorni|anni|min|ora|giorno|anno

# labels.menu
source: Menu
ar: قائمة
it: Menù

# labels.showPage
source: View webpage
ar: عرض الصفحة
it: Mostra pagina web

# labels.showList
source: Show record list
ar: عرض التسجيلات
it: Mostra elenco record

# labels.days
source: days
ar: أيام
it: giorni

# labels.depth_0
source: This page
ar: هذه الصفحة
it: Questa pagina

# labels.depth_1
source: 1 level
ar: مستوى 1
it: 1 livello

# labels.depth_2
source: 2 levels
ar: مستويان
it: 2 livelli

# labels.depth_3
source: 3 levels
ar: 3 مستويات
it: 3 livelli

# labels.depth_4
source: 4 levels
ar: 4 مستويات
it: 4 livelli

# labels.depth_infi
source: Infinite
ar: لا نهائي
it: Infiniti

# labels.allow
source: Allow
ar: سماح
it: Consenti

# labels.deny
source: Deny
ar: رفض
it: Nega

# labels.automatic
source: Auto
ar: تلقائي

# labels.enabled
source: Enabled
ar: تفعيل
it: Abilitato

# labels.show
source: Show
ar: عرض
it: Mostra

# labels.refresh
source: Reload the tree from server
ar: إعادة تحميل القائمة من الخادم
it: Ricarica albero dal server

# labels.collapse
source: Collapse all tree items
ar: طي جميع عناصر الشجرة
it: Contrai l'albero

# labels.temporaryDBmount
source: Cancel temporary DB mount
ar: إلغاء DB المؤقت
it: Elimina DB mount temporaneo

# labels.refreshList
source: Reload list from server
ar: إعادة تحميل القائمة من الخادم
it: Ricarica lista dal server

# labels.close
source: Close
ar: إغلاق
it: Chiudi

# labels.tableWizard
source: Table Wizard
ar: معالج الجدول
it: Procedura Guidata Tabella

# labels.new
source: NEW
ar: جديد
it: NUOVO

# labels.list
source: List
ar: قائمة
it: Lista

# labels.link
source: Link
ar: رابط
it: Collegamento

# labels.edit
source: Edit
ar: تعديل
it: Modifica

# labels.createNew
source: Create new
ar: إنشاء جديد
it: Crea nuovo

# labels.createNewPage
source: Create new %s
ar: إنشاء جديد %s
it: Crea nuovo %s

# labels.createNewRecord
source: Create new %s on page "%s"
ar: إنشاء %s جديد على صفحة "%s"
it: Crea nuovo %s nella pagina "%s"

# labels.createNewRecordRootLevel
source: Create new %s on root level
ar: إنشاء %s جديد على المستوى الجذري
it: Crea nuovo %s sul livello root

# labels.editPage
source: Edit %s "%s"
ar: تعديل %s "%s"
it: Modifica %s "%s"

# labels.editRecord
source: Edit %s "%s" on page "%s"
ar: تعديل %s "%s" على الصفحة "%s"
it: Modifica %s "%s" nella pagina "%s"

# labels.editRecordNoTitle
source: Edit %s on page "%s"
ar: تعديل %s على صفحة "%s"
it: Modifica %s nella pagina "%s"

# labels.editRecordRootLevel
source: Edit %s "%s" on root level
ar: تعديل %s "%s" على مستوى الجذر
it: Modifica %s "%s" sul livello root

# labels.editMultiplePages
source: Edit multiple pages
ar: تعديل صفحات مُتعددة
it: Modifica pagine multiple

# labels.editMultipleRecords
source: Edit multiple "%s" records on page "%s"
ar: تعديل عِدّة "%s" سجلات على الصفحة "%s"
it: Modifica multipla di "%s" record della pagina "%s"

# labels.editMultipleRecordsRootLevel
source: Edit multiple "%s" records on root level
ar: تعديل "%s" سجلات مُتعددة على مستوى الجذر
it: Modifica multipla di "%s" record, al livello root

# labels.rootLevel
source: root level
ar: مستوى الجذر
it: livello root

# labels.addnew
source: Add new
ar: إضافة جديد
it: Aggiungi nuovo

# labels.toggleall
source: Toggle all
ar: تبديل الكل
it: Inverti tutti

# labels.toggleSelection
source: Toggle selection
ar: تبديل التحديد
it: Inverti selezione

# labels.selected
source: Selected Items
ar: العناصر المُحددة
it: Elementi selezionati

# labels.items
source: Available Items
ar: العناصر المُتوفرة
it: Elementi disponibili

# labels.remove_selected
source: Remove selected items
ar: إزالة العناصر المُحددة
it: Rimuovi gli elementi selezionati

# labels.move_to_top
source: Move selected items to top
ar: نقل العناصر المُحددة إلى الأعلى
it: Sposta gli elementi selezionati in cima

# labels.move_up
source: Move selected items upwards
ar: نقل العناصر المُحددة لأعلى
it: Sposta gli elementi selezionati in su

# labels.move_down
source: Move selected items downwards
ar: نقل العناصر المُحددة لأسفل
it: Sposta gli elementi selezionati in giù

# labels.move_to_bottom
source: Move selected items to bottom
ar: نقل العناصر المُحددة إلى الأسفل
it: Sposta gli elementi selezionati in fondo

# labels.move
source: Move this item
ar: نقل هذا العنصر
it: Sposta questo elemento

# labels.browse_elemets
source: Browse for elements
ar: تصفّح العناصر
it: Sfoglia gli elementi

# labels.browse_folder
source: Browse for folders
ar: استعرض المُجلدات
it: Sfoglia cartelle

# labels.browse_db
source: Browse for records
ar: تصفّح السجلات
it: Sfoglia record

# labels.clipInsert_file
source: Insert %s file(s) from the clipboard
ar: أدرج %s ملف(ملفات) من الحافظة
it: Inserisci %s file dalla clipboard

# labels.clipInsert_db
source: Insert %s record(s) from the clipboard
ar: أدرج %s سجل(سجلات) من الحافظة
it: Inserisci %s record dalla clipboard

# labels.generalOptions
source: General options
ar: خيارات عامّة
it: Opzioni generali

# labels.generalOptions_more
source: General options (continued)
ar: خيارات عامّة (مُتَواصل)
it: Opzioni generali (continuazione)

# labels.allTables
source: [All tables]
ar: [جميع الجداول]
it: [Tutte le tabelle]

# labels.thumbmode_clip
source: Show Thumbnails on ClipBoard
ar: إظهار الصُور المُصغّرة على الحافظة
it: Mostra Miniature nella Clipboard

# labels.copymode
source: Copy items instead of moving them
ar: نسخ العناصر بدلاً من نقلها
it: Copia gli elementi invece di spostarli

# labels.normal
source: Normal (single record mode)
ar: عادي (وضع سجل واحد)
it: Normale (modalità record singolo)

# labels.normal-description
source: "Normal" clipboard allows to copy/move one record at time.
ar: الحافظة "العاديّة" تسمح بنسخ/نقل سجل واحد بنفس الوقت.
it: La clipboard "normale" consente di copiare/spostare un record per volta.

# labels.cliptabs
source: Clipboard #
ar: الحافظة #

# labels.cliptabs-name
source: Clipboard #%s (multi-selection mode)
ar: الحافظة #%s (وضع الاختيار المُتعدد)
it: Clipboard #%s (modalità multi-selezione)

# labels.cliptabs-description
source: This clipboard allows to select and edit/copy/move multiple records at once. Choose it to show a checkbox by each record.
ar: هذه الحافظة تسمح بتحديد وتعديل/نسخ/نقل سجلات متعددة بنفس الوقت. اختر حافظة لإظهار مربع الاختيار عن طريق كل سجل.
it: Questa clipboard consente di selezionare e modificare/copiare/spostare più record per volta. Scegli per disporre di una opzione di selezione per ogni record.

# labels.clipboard.delete_elements
source: Delete elements
ar: حذف العناصر
it: Elimina gli elementi

# labels.clipboard.clear_clipboard
source: Clear clipboard
ar: مسح الحافظة
it: Svuota la clipboard

# labels.removeItem
source: Remove element
ar: إزالة العنصر
it: Rimuovi elemento

# labels.holdDownCTRL
source: Important: Hold down the CTRL key while toggling elements in this list!
ar: هام: اضغط لأسفل بشكل مُطوّل مفتاح CTRL أثناء تبديل العناصر في هذه القائمة!
it: Importante: tieni premuto il tanto CTRL mentre selezioni gli elementi di questa lista!

# labels.revertSelection
source: Revert selection
ar: إعادة التحديد
it: Ripristina selezione originaria

# labels.setAllCheckboxes
source: Select All Checkboxes
ar: حدد جميع خانات الاختيار
it: Seleziona Tutti

# labels.openSelectionOptions
source: Open selection options
ar: فتح خيارات التحديد
it: Apri le opzioni di selezione

# labels.checkAll
source: Check all
ar: اختر الكل
it: Seleziona tutti

# labels.uncheckAll
source: Uncheck all
ar: إلغاء اختيار الكل
it: Deseleziona tutti

# labels.selection
source: Selection:
ar: حدّد:
it: Selezione:

# labels.noActionAvailable
source: No action available
ar: لا يوجد إجراء متاح
it: Nessuna azione disponibile

# labels.placeholder.override
source: Set element specific value (Default: "%s")
ar: تعيين قيمة محددة للعنصر (الإفتراضي: "%s")
it: Imposta un valore specifico per l'elemento (Predefinito: %s")

# labels.placeholder.override_not_available
source: Set element specific value (No default)
ar: تعيين قيمة محددة للعنصر (غير افتراضي)
it: Imposta un valore specifico per l'elemento (Nessun valore predefinito)

# labels.nullCheckbox
source: Set value
ar: تعيين القيمة
it: Imposta valore

# labels.changeInOrig
source: Changed in original translation
ar: تم التغيير في الترجمة الأصلية
it: Cambiato nella traduzione originale

# labels.expandAll
source: Expand all
ar: توسيع الكل
it: Espandi tutto

# labels.generatePassword
source: Generate password
ar: إنشاء كلمة مرور
it: Genera password

# labels.new_section
source: Create new
ar: إنشاء جديد
it: Crea nuovo

# labels.count
source: Quantity
ar: الكميّة
it: Quantità

# labels.title.searchIcon
source: Toggle search toolbar
ar: تبديل شريط أدوات البحث
it: Attiva/Disattiva barra degli strumenti di ricerca

# labels.title.searchString
source: Search term
ar: مصطلح البحث
it: Termine di ricerca

# labels.title.limit
source: Limit
ar: محدود
it: Numero massimo risultati

# labels.title.search
source: Search
ar: بحث
it: Cerca

# labels.title.search_levels
source: Search levels
ar: مستويات البحث
it: Livelli di profondità di ricerca

# labels.label.searchString
source: Search term
ar: عنصر البحث
it: Termine di ricerca

# labels.label.limit
source: Limit
ar: محدود
it: Numero massimo risultati

# labels.label.search_levels
source: Search levels
ar: مستويات البحث
it: Livelli di profondità di ricerca

# labels.active
source: Active
ar: نشط
it: Attivo

# labels.locked
source: Locked
ar: مُقفل
it: Bloccato

# labels.mfa.enabled
source: MFA enabled
ar: MFA مُفعّل
it: MFA abilitato

# labels.mfa.disabled
source: MFA disabled
ar: MFA معطل
it: MFA disabilitato

# labels.recordReadonly
source: The table is defined as readonly and can't be edited.
ar: الجدول مُعرّف على أنه مَقرُوء فقط ولا يمكن تحريره.
it: La tabella è in sola lettura e non può essere modificata.

# labels.inconsistentLanguageWarning
source: No translation parent assigned
ar: لم يتم تعيين أي أصل للترجمة
it: Nessun record padre, di lingua, assegnato

# labels.notEditableInWorkspace
source: Not editable in this workspace without "Live" edit permissions.
ar: غير قابل للتعديل في مساحة العمل هذه دون أذُوُنات التعديل "Live".
it: Non modificabile in questo workspace senza i permessi di modifica "Live".

# labels.editingLiveRecordsWarning
source: Caution! These records are not versioned, you will edit the live records.
ar: تحذير! لم يتم إصدار هذه السجلات بعد، سوف تقوم بتعديل السجلات المباشرة.
it: Attenzione! Questi record non hanno versione, modificherai i record Live.

# labels.th.name
source: Name
ar: الاسم
it: Nome

# alttext.suggestSearching
source: Searching...
ar: جاري البحث...
it: Ricerca in corso...

# ver.online
source: ONLINE
ar: أونلاين

# ver.mgm
source: Version Management
ar: إدارة الإصدار
it: Gestione Versioni

# ver.selVer
source: Select version
ar: إختر الإصدار
it: Seleziona versione

# ver.swap
source: Swap/Publish
ar: مبادلة/نشر
it: Scambia/Pubblica

# ver.swapPage
source: Publish this version of the page including content
ar: نشر هذا الإصدار من الصفحة بما في ذلك المحتوى
it: Pubblica questa versione della pagina e i suoi contenuti

source: TYPO3 Element Browser
ar: مُستعرض عنصر TYPO3
it: Navigatore Elementi TYPO3

# labels.referencesToRecord
source: There are %s reference(s) to this record!
ar: هناك %s مرجع(مراجع) لهذا السجل!
it: Ci sono %s riferimenti a questo record!

# labels.referencesToFile
source: There are %s reference(s) to this file!
ar: هناك %s مرجع(مراجع) لهذا الملف!
it: Ci sono %s riferimenti a questo file!

# labels.translationsOfRecord
source: This record has %s translation(s) which will be deleted, too!
ar: هذا السجل يحتوي على %s تَرْجَمَة/ات سيتم حذفها أيضاً!
it: Questo record ha %s traduzioni che saranno eliminate!

# show_item.php.viewItem
source: View Item
ar: عرض العنصر
it: Vedi Elemento

# show_item.php.fieldValues
source: Field values
ar: قيم الحقل
it: Valori del campo

# show_item.php.general
source: General
ar: عام
it: Generale

# show_item.php.references
source: References
ar: المراجع
it: Riferimenti

# show_item.php.referencesToThisItem
source: References to this item
ar: الإشارات إلى هذا العنصر
it: Riferimenti a questo oggetto

# show_item.php.referencesFromThisItem
source: References from this item
ar: الإشارات من هذا العنصر
it: Riferimenti da questo oggetto

# show_item.php.file
source: File
ar: ملف

# show_item.php.dimensions
source: Dimensions
ar: الأبعاد
it: Dimensioni

# show_item.php.filesize
source: Size
ar: الحجم
it: Dimensione

# show_item.php.pixels
source: Pixels
ar: بيكسلات

# show_item.php.files
source: files
ar: ملفات

# show_item.php.cannotDisplayArchive
source: Sorry, TYPO3_CONF_VARS[BE][disable_exec_function] was set, so cannot display content of archive file.
ar: عُذراً، تم تعيين TYPO3_CONF_VARS[BE][disable_exec_function] لذلك لا يمكن عرض محتوى ملف الأرشيف.
it: Spiacenti, ma TYPO3_CONF_VARS[BE][disable_exec_function] è impostato, quindi non è possibile mostrare il contenuto del file archivio.

# show_item.php.table
source: Table
ar: جدول
it: Tabella

# show_item.php.title
source: Title
ar: عنوان
it: Titolo

# show_item.php.field
source: Field
ar: حقل
it: Campo

# show_item.php.softrefKey
source: Softref Key
ar: مفتاح Softref

# show_item.php.sorting
source: Sorting
ar: فرز
it: Ordinamento

# show_item.php.refTable
source: Ref Table
ar: جدول Ref
it: Rif Tabella

# show_item.php.refString
source: Ref String
ar: نص Ref
it: Rif Stringa

# show_item.php.missing_record
source: Record is missing!
ar: السجل مفقود!
it: Il record è mancante!

# db_new.php.pagetitle
source: New record
ar: سجل جديد
it: Nuovo record

# db_new.php.after
source: after
ar: بعد
it: dopo

# db_new.php.inside
source: inside
ar: بالداخل
it: dentro

# file_upload.php.pagetitle
source: Upload files
ar: تحميل الملفات
it: Carica file

# file_upload.php.submit
source: Upload files
ar: تحميل الملفات
it: Carica file

# file_upload.dropzonehint.title
source: Drag & drop to upload files
ar: اسحب & وضَع هنا لتحميل الملفات
it: Trascina e rilascia per caricare i file

# file_upload.dropzonehint.message
source: Drop your files here, or <u>click, browse & choose files</u>
ar: ضع ملفاتك هنا، أو <u>انقر فوق، تصفح & اختر ملفات </u>
it: Trascina i tuoi file qui o <u>clicca, sfoglia e scegli i file</u>

# file_upload.dropzone.close
source: Close file upload area
ar: إغلاق نافذة تحميل الملفات
it: Chiudi area caricamento file

# file_upload.select-and-submit
source: Select & upload files
ar: حدد & تحميل الملفات
it: Seleziona e carica file

# file_upload.maxFileSizeExceeded
source: File "{0}" exceeds maximum file size of {1}!
ar: الملف "{0}" يتجاوز الحد الأقصى لحجم الملف {1}!
it: Il file "{0}" eccede la dimensione massima del file di {1}!

# file_upload.fileNotAllowed
source: Filename "{0}" is not allowed!
ar: اسم الملف "{0}" غير مسموح به!
it: Nome file "{0}" non consentito!

# file_upload.fileExtensionExpected
source: Upload failed! A file with "{0}" extension is expected!
ar: فشل التحميل! من المتوقع أن يكون هناك ملف مع "{0}" إضافة!
it: Caricamento fallito! Un file con l'estensione "{0}" è previsto!

# file_upload.fileExtensionDisallowed
source: Upload failed! The file extension must not be "{0}"!
ar: فشل في التحميل! يجب ألا يكون مِلَفّ الإضافة "{0}"!
it: Caricamento fallito! L'estensione del file non deve essere "{0}"!

# file_upload.uploadFailed
source: Upload of file "{0}" failed!
ar: فشل تحميل الملف"{0}" !
it: Caricamento del file "{0}" non riuscito!

# file_upload.upload-in-progress
source: File upload in progress...
ar: جاري تحميل الملف...
it: Caricamento file in corso...

# file_upload.upload-progress-info
source: Uploading file {0} out of {1} files.
ar: تحميل الملف {0} من {1} ملف.
it: Caricamento file {0} su {1} file.

# file_upload.upload-finished
source: Upload complete! Filelist reloading...
ar: اكتمل التحميل! إعادة تحميل الملفات...
it: Caricamento completato! Aggiorno la lista dei file...
