Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_*_users.xlf
Languages: ar, fr, it

# .description
source: This is the table of backend administration users. Backend users can login in the backend of TYPO3 and are typically producers of content on a website.
ar: هذا هو جدول مُستخدمي إدارة الواجهة الخلفية. يمكن لمستخدمي الواجهة الخلفية تسجيل الدخول إلى الواجهة الخلفية لـ TYPO3 وعادةً ما يكونوا مُنتجينَ للمُحتوى على موقع الويب.
fr: C'est la table d'administration des utilisateurs backend. Les utilisateurs backend peuvent se connecter dans le backend de TYPO3 et sont typiquement des rédacteurs de contenu.
it: Questa è la tabella per l'amministrazione degli utenti di backend. Un utente di backend può fare login in TYPO3 e tipicamente produrre contenuti per il sito web.

# .details
source: The main settings for a backend user is a username, password and group memberships. The username and password authenticates the user to the system. The group memberships enables the user to perform actions in TYPO3 since groups are the main source of permission settings for a backend user. Backend usergroups can also be understood as "roles". A usergroup can contain a configuration of permissions which allows the user to play a certain role in the system. <b>The "Admin" user</b> There is a special kind of user, the "Admin" user. This user has access to everything in TYPO3. There are no limits for Admin-users at all. You should normally have only a single or two admin-users in your system. Admin-users are the only users who can create other backend users. Alternatively you can create an "Action" which enables other normal users to do it as well (with certain restrictions of course). <b>Location</b> Backend users are always created in the root of the page tree (like Backend groups are). <b>Comparing Users</b> To manage and compare users, getting an overview of their access credentials etc. you can use the Tools > User Admin module (extension: beuser). It allows you to group users by various categories of permissions. You can also switch to another users account by a single click of a button.
ar: الإعدادات الرئيسية لمُستخدم الواجهة الخلفية هي اسم المستخدم وكلمة المرور وعضويّة المجموعة. يقوم اسم المستخدم وكلمة المرور بمُصادقة المستخدم على النظام. تُمكّن عضويات المجموعة المستخدم من تنفيذ الإجراءات في TYPO3 لأن المجموعات هي المصدر الرئيسي لإعدادات الأُذُونات لمُستخدم الواجهة الخلفية. يمكن أيضاً فهم مجموعات مستخدمي الواجهة الخلفية على أنها "أدوار". يمكن أن تحتوي مجموعة المستخدمين على تكوين أذونات تسمح للمستخدم بلعب دور معين في النظام. <b>المُستخدم المُشرف</b> هناك نوع خاص من المستخدمين، المُستخدم "المُشرف". هذا المُستخدم لديه حق الوصول إلى كل شيء في TYPO3. لا توجد حُدود للمستخدمين المُشرفين أبداً. يجب أن يكون لديك عادةً مُستخدم مُشرف واحد أو اثنان فقط في نِظامك. المُستخدمون المُشرفون هم المُستخدمين الوحيدين الذين يمكنهم إنشاء مستخدمين آخرين في الواجهة الخلفية. بدلاً من ذلك، يمكنك إنشاء "إجراء" يُمكّن المستخدمين العاديين الآخرين من القيام بذلك أيضاً (مع قُيود مُعينة بالطبع). <b>الموقع</b> يتم دائماُ إنشاء مُستخدميّ الواجهة الخلفية في جذر شجرة الصفحة (مثل مجموعات الواجهة الخلفية). <b>مقارنة المُستخدمين</b> لإدارة ومُقارنة المُستخدمين ، والحصول على نظرة عامة على بيانات اعتماد الوصول الخاصة بهم، وما إلى ذلك، يمكنك استخدام أدوات > وحدة إدارة المستخدم (إضافة: beuser). يسمح لك بتجميع المُستخدمين حسب فئات مختلفة من الأُذُونات. يمكنك أيضاً التبديل إلى حساب مستخدم آخر بنقرة واحدة على الزر.
fr: Les paramètres principaux d'un utilisateur backend sont le nom d'utilisateur, le mot de passe et l'appartenance à un groupe. Le nom d'utilisateur et le mot de passe authentifient l'utilisateur sur le système. Les appartenances de groupe permettent à l'utilisateur d'effectuer des actions dans TYPO3 car les groupes sont la principale source de paramètres de permission pour un utilisateur backend. Les groupes d'utilisateurs Backend peuvent également être vus comme des "rôles". Un groupe d'utilisateurs peut contenir une configuration des permissions qui permet à l'utilisateur de jouer un certain rôle dans le système. <b>L'utilisateur "Admin"</b> Il y a un type spécial d'utilisateur, l'utilisateur "Admin". Cet utilisateur a accès à tout ce qui se trouve dans TYPO3. Il n'y a aucune restriction pour les administrateurs. Vous ne devriez normalement avoir qu'un ou deux administrateurs sur votre système. Les administrateurs sont les seuls utilisateurs qui peuvent créer d'autres utilisateurs backend. Alternativement, vous pouvez créer une "Action" qui permet aux autres utilisateurs de le faire aussi (avec certaines restrictions bien sûr). <b>Emplacement</b> Les utilisateurs du backend sont toujours créés à la racine de l'arborescence des pages (comme pour les groupes Backend). <b>Comparer les utilisateurs</b> Pour gérer et comparer les utilisateurs, obtenir un aperçu de leurs identifiants d'accès, etc. vous pouvez utiliser le module Outils > Gestion des utilisateurs (extension: beuser). Il vous permet de regrouper les utilisateurs selon différentes catégories de permissions. Vous pouvez également passer à un autre compte utilisateur par un simple clic sur bouton.
it: Le impostazioni principali per un utente di backend sono un nome utente, una password e gruppi di appartenenza. Il nome utente e la password autenticano l'utente al sistema. L'appartenenza a un gruppo consente all'utente di eseguire azioni in TYPO3, poiché i gruppi sono la principale fonte di impostazioni di autorizzazione per un utente di backend. I gruppi utenti di backend possono anche essere intesi come "ruoli". Un gruppo utenti può contenere una configurazione di permessi che permette all'utente di svolgere un certo ruolo nel sistema. <b>L'utente "Admin"</b> C'è un tipo speciale di utente, l'utente "Admin". Questo utente ha accesso a tutto in TYPO3. Non ci sono limiti per gli utenti Admin. Normalmente dovresti avere solo uno o due utenti Admin nel tuo sistema. Gli Admin sono gli unici utenti che possono creare altri utenti di backend. In alternativa è possibile creare una "Azione" che consente anche ad altri utenti ordinari di farlo (con alcune restrizioni, naturalmente). <b>Posizione</b> Gli utenti di backend vengono sempre creati nella root dell'Albero delle Pagine (come i gruppi utenti di backend). <b>Utenti e gruppi a confronto</b> Per gestire e confrontare gli utenti e gruppi, ottenere una panoramica delle loro autorizzazioni di accesso, ecc. è possibile utilizzare il modulo "Sistema>Utenti di Backend". Consente di raggruppare gli utenti per varie categorie di permessi. È inoltre possibile simulare un altro account utente con un solo clic.

# _.seeAlso
source: be_groups, About backend users | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/BackendUsers/ Setting up a new user and group | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/ Users and Groups [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/
ar: be_groups, حول مستخدميّ الواجهة الخلفية | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/BackendUsers/ إعداد مستخدم جديد أو مجموعة جديدة | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/ المُستخدمين والمجموعات [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/
fr: be_groups, À propos des utilisateurs backend | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/BackendUsers/ Configurer un nouvel utilisateur et un nouveau groupe | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/ Utilisateurs et Groupes [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/
it: be_groups, Utenti di Backend | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/BackendUsers/ Configurare un nuovo utente e gruppo | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/ Utenti e Gruppi [Tecnico] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/

# .image_descr
source: Backend users are found in the root of the page tree. "Admin" backend users can always be recognized on their icon being red while normal users have a blue icon. The editing form of a backend users record. The "Tools > User Admin" module where you can get an overview of the users on the system and what permissions they have. Click the "SU" button to switch to a users account.
ar: مُستخدميّ الواجهة الخلفية موجودين في جذر شجرة الصفحة. يمكنك دائماً التعرّف على مُستخدمي الواجهة الخلفية "المُشرفين" من خلال لون الأيقونة البرتقالي، بينما يكون لدى المُستخدمين العاديين أيقونة زرقاء. شكل التحرير لسجل مستخدم الواجهة الخلفية. وحدة "أدوات > المُستخدم المُشرف" هي المكان الذي يُمكنك فيه الحصول على نظرة عامة على المستخدمين وعلى النظام والأُذُونات التي لديهم. انقر فوق الزر "SU" للتبديل إلى حساب المستخدم.
fr: Les utilisateurs backend se trouvent à la racine de l'arborescence des pages. Les utilisateurs du backend "Admin" peuvent toujours être reconnus par leur icône en rouge tandis que les utilisateurs normaux ont une icône bleue. Le formulaire d'édition d'un enregistrement utilisateur backend. Le module "Outils > Gestion des utilisateurs" où vous pouvez obtenir une vue d'ensemble des utilisateurs du système et quelles autorisations ils possèdent. Cliquez sur le bouton "SU" pour basculer vers un compte utilisateur.
it: Gli utenti del backend si trovano nella root dell'Albero delle Pagine. Gli utenti di backend "Admin" possono sempre essere riconosciuti dall'icona in rosso mentre gli utenti ordinari hanno un'icona blu. La form di modifica di un record Utente di Backend. Nel modulo "Sistema>Utenti di Backend" è possibile ottenere una panoramica degli utenti nel sistema e quali permessi possiedono. Fai clic sul pulsante "Simula utente" per passare a un account utente.

# username.description
source: Enter the login name of the backend user.
ar: أدخل اسم المستخدم في الواجهة الخلفية.
fr: Entrez le nom d'utilisateur du backend.
it: Inserisci il nome utente dell'utente di backend.

# username.details
source: A username is required and must be in lowercase without spaces in it. Furthermore the username must be unique. If it is not unique a number will be appended automatically.
ar: اسم المستخدم مطلوب ويجب أن يكون بأحرف صغيرة بدون مسافات. باللإضافة إلى ذلك، يجب أن يكون اسم المستخدم فريداً من نوعه. إذا لم يكن الاسم فريداً فسيتم إلحاقُه برقم تِلقائيّاً.
fr: Un nom d'utilisateur est nécessaire et doit être composé de minuscules sans espaces. De plus, celui-ci doit être unique. S'il existe déjà dans la base, un chiffre sera ajouté en suffixe automatiquement.
it: Un nome utente è richiesto e deve essere tutto minuscolo e senza spazi. Inoltre il nome utente deve essere unico. Se non è unico, un numero, unicamente distintivo, verrà automaticamente aggiungo al nome utente.

# _username.seeAlso
source: be_users:password
ar: be_users:كلمة المرور

# password.description
source: Enter the password for the backend username above (Notice the value you enter <i>will</i> be readable in the field!).
ar: أدخل كلمة المرور لاسم المستخدم في الواجهة الخلفية أعلاه (لاحظ القيمة التي أدخلتها <i>ستكون</i> قابلة للقراءة في الحقل!).
fr: Entrez le mot de passe pour l'utilisateur du back-office ci-dessus (notez que la valeur que vous entrez <em>sera</em> lisible dans le champ!).
it: Inserisci la password per il nome utente del backend qui sopra (nota che il valore che inserisci <i>sarà</i> leggibile nel campo, durante l'inserimento!).

# password.details
source: The password is required. Before the password is sent to the server it's md5-hashed, so the password value itself is not transferred over the Internet. This is true both when editing the password and when the user logs in. While this principle does not reveal the raw password it is <i>not</i> the same as real encryption. If you need the highest degree of security you should install the TYPO3 backend on a secure server. The password is stored in the database as an md5-hash and thus it's not possible to extract the original password from the database either. This means that 'lost passwords' must be substituted with a new password for the user. <b>Notice</b> When you enter the password in the password field it is initially visible in clear text! First when the password field focus is lost will the password become a "list of dots". <b>User changing password</b> Users can change their password from the User > Setup module
ar: كلمة المرور مطلوبة. قبل إرسال كلمة المرور إلى الخادم يتم تشفيرها md5-hashed، لذلك لا يتم نقل قيمة كلمة المرور نفسها عبر الإنترنت. هذا صحيح عند تحرير كلمة المرور وعندما يقوم المستخدم بتسجيل الدخول. في حين أن هذا المبدأ لا يكشف عن كلمة المرور الأولية ، فإنه <i>ليس</i> نفس التشفير الحقيقي. إذا كنت بحاجة إلى أعلى درجة من الأمان، فيجب عليك تثبيت نظام TYPO3 على خادم آمن. يتم تخزين كلمة المرور في قاعدة البيانات كـ md5-hashed وبالتالي لا يمكن استخراج كلمة المرور الأصلية من قاعدة البيانات أيضاً. هذا يعني أنه يجب استبدال "كلمات المرور المفقودة" بكلمة مرور جديدة للمستخدم. <b>ملاحظة</b> عند إدخال كلمة المرور في حقل كلمة المرور، تظهر في البداية بنص مقرُوء! وبعد الإنتقال من حقل كلمة المرور لمكان آخر، ستصبح كلمة المرور "غير مقروءة". <b>تغيير كلمة المرور للمستخدم</b> يمكن للمستخدمين تغيير كلمة المرور الخاصّة بهم من وحدة إعداد المُستخدم >
fr: Le mot de passe est requis. Avant que le mot de passe soit envoyé au serveur, il est encodé avec md5, de sorte que la valeur du mot de passe lui-même n'est pas transférée sur Internet. Ceci est vrai à la fois lors de l'édition du mot de passe et lorsque l'utilisateur se connecte. Bien que ce principe ne révèle pas le mot de passe brut, il n'est <i>pas</i> le même que le chiffrement réel. Si vous avez besoin du plus haut degré de sécurité, vous devez installer le backend TYPO3 sur un serveur sécurisé. Le mot de passe est stocké dans la base de données en tant que hash md5 et il n'est donc pas possible d'extraire le mot de passe original de la base de données. Cela signifie que les "mots de passe perdus" doivent être remplacés par un nouveau mot de passe pour l'utilisateur. <b>Avis</b> Lorsque vous entrez le mot de passe dans le champ mot de passe, il est initialement visible en texte clair ! Dès lors que le focus sur le champ "Mot de passe" est perdu, le mot de passe est affiché comme une "liste de points". <b>Changement de mot de passe de l'utilisateur</b> Les utilisateurs peuvent changer leur mot de passe depuis le module Utilisateur > Paramètres de l'utilisateur
it: È richiesta una password. Prima di inviare la password al server questa viene sottoposta ad un processo di trasformazione in hash-md5, affinché la password non venga trasferita in chiaro via internet. Questo accade anche quando la password viene modificata e quando l'utente fa login. Anche se la procedura non usa password in chiaro, questo <i>non</i> è una reale crittografia. Se hai bisogno di un grado più alto di sicurezza, devi installare il backend di TYPO3 in un server sicuro. La password è memorizzata in un database nella forma di un hash-md5 e quindi non è possibile estrarre la password originale dal campo del database. Questo significa che se una password viene smarrita, va sostituita rigenerando una nuova password per l'utente. <b>L'utente modifica la password</b> Gli utenti possono cambiare la propria password dal modulo "Impostazioni Utente"

# usergroup.description
source: Assign backend user groups to the user.
ar: تعييّن مجموعات جديدة لمُستخدم الواجهة الخلفية.
fr: Attribuez un groupe à l'utilisateur du backend.
it: Assegna gruppi di backend all'utente.

# usergroup.details
source: The backend user groups defines the permissions which the backend user will inherit. So unless the backend user is an 'Admin' user, he needs to be a member of one or more user groups in order to have practically any permissions assigned. The properties set in the user groups are mostly added together. The first (top) group in the list is the group which will, by default, be the owner of pages the user creates.
ar: تُحدد مجموعات مُستخدميّ الواجهة الخلفية الأُذُونات التي سيرثها مُستخدم الواجهة الخلفية. لذلك إذا لم يكن مُستخدم الواجهة الخلفية "مُشرفاُ" فإنه يحتاج إلى أن يكون عضواً في مجموعة مُستخدمين واحدة أو أكثر من أجل الحصول على أيّة أُذونات تم تعيينها. يتم في الغالب إضافة الخصائص التي تم تعيينها في مجموعات المستخدمين معاً. المجموعة الأولى (العُلوُية) في القائمة هي المجموعة التي ستكون، بشكل افتراضي مالك الصفحات التي يُنشئها المُستخدم.
fr: Les groupes d'utilisateurs backend définissent les permissions dont l'utilisateur backend héritera. Donc sauf si l'utilisateur backend est un utilisateur 'Admin', il doit être membre d'un ou plusieurs groupes d'utilisateurs afin d'avoir pratiquement toutes les permissions assignées. Les propriétés définies dans les groupes d'utilisateurs s'additionnent les unes aux autres. Le premier (en haut) groupe de la liste est le groupe qui sera, par défaut, le propriétaire des pages créées par l'utilisateur.
it: I gruppi utenti di backend definiscono i permessi che l'utente backend erediterà. Quindi, a meno che l'utente di backend non sia un utente 'Admin', ha bisogno di essere membro di uno o più gruppi utenti per avere permessi assegnati. Le proprietà, impostate nei vari gruppi utenti assegnati, verranno unite e assegnate all'utente di backend. Il primo gruppo, in cima alla lista, è il gruppo che verrà assegnato alle nuove pagine create dall'utente.

# db_mountpoints.description
source: Assign startpoints for the users page tree.
ar: تعيين نقاط البداية لشجرة صفحات المستخدمين.
fr: Assigne un point d'entrée pour l'arborescence utilisateur.
it: Assegna nodi dell'Albero delle Pagine.

# db_mountpoints.details
source: The page tree used my all Web-submodules to navigate must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a 'Database mount'. <strong>Notice</strong> that backend user groups also has DB mounts which can be inherited by the user. So if you want a group of users to share a page tree, you should probably mount the page tree in the backend user group which they share instead.
ar: يجب أن يكون لشجرة الصفحة التي تستخدمها جميع وحدات الويب الفرعية للتنقل بعض نقاط الدخول المحددة. هنا يجب عليك إدراج مرجع واحد أو أكثر إلى صفحة تمثل صفحة جذرية جديدة لشجرة الصفحة. وهذا ما يسمى "قاعدة البيانات". <strong>ملاحظة</strong> لاحظ أن مجموعات مُستخدميّ الواجهة الخلفية تحتوي أيضاً على قواعد قاعدة البيانات التي يمكن أن يرثها المُستخدم. لذلك إذا كنت تريد أن تشارك مجموعة من المستخدمين شجرة صفحة، فمن المُحتمل أن تقوم بتحميل شجرة الصفحة في مجموعات مُستخدميّ الواجهة الخلفية التي يشاركونها بدلاً من ذلك.
fr: L'arborescence des pages utilisée par tous les sous-modules Web doit avoir des points d'entrées pour fonctionner. Ici vous devriez insérer une ou plusieurs références à une page qui représentera alors une nouvelle page racine pour l'arborescence. Cela s'appelle un « montage de la base de données ». <strong>Remarquez</strong> que les groupes d'utilisateurs backend ont également des montages de la base de données qui peuvent être héritées par l'utilisateur. Donc, si vous voulez qu'un groupe d'utilisateurs partage une arborescence, vous devriez probablement monter l'arborescence des pages dans un groupe d'utilisateurs commun.
it: I Moduli dell'area Web si appoggiano sull'Albero delle Pagine, quindi, affinché possano correttamente funzionare, è necessario che vengano assegnati alcuni nodi dell'Albero delle Pagine. Qui dovresti inserire uno o più nodi dell'albero delle pagine, che, al lato pratico, figureranno come radici di sotto-alberi dell'Albero delle Pagine, visibili e accessibili dall'utente di backend. Ogni nodo dell'Albero delle Pagine assegnato all'utente, viene definito come 'DB Mount'. <strong>Nota</strong> che anche i gruppi utenti di backend hanno nodi, dell'Albero delle Pagine, assegnati; conseguentemente gli utenti, membri del gruppo, erediteranno tali nodi. Se hai la necessità di condividere gli stessi nodi, dell'Albero delle Pagine, fra più utenti di backend, dovresti assegnare tali nodi al gruppo e poi assegnare lo stesso gruppo ai vari utenti di backend.

# db_mountpoints.image_descr
source: A DB mount is assigned to the user. Users can only operate on pages and records which are inside their DB mounts! When a page is mounted for a user it will become the root of their page tree. The user must have access to the page through the regular page permissions set in the Web > Access module.
ar: يتم تعيين قاعدة بيانات للمُستخدم. يمكن للمُستخدمين العمل فقط على الصفحات والسجلات الموجودة داخل قواعد قاعدة البيانات الخاصة بهم! عندما يتم تحميل صفحة لمُستخدم ، فإنها ستصبح جذراً لشجرة صفحاتهم. يجب أن يكون لدى المستخدم حق الوصول إلى الصفحة من خلال أُذُونات الصفحة العادية المُحددة في الويب &gt؛ وحدة الوصول.
fr: Un montage BDD est assigné à l'utilisateur. Les utilisateurs ne peuvent opérer que sur des pages et des enregistrements qui se trouvent à l'intérieur de leurs montage BDD ! Lorsqu'une page est montée pour un utilisateur, elle deviendra la racine de son arborescence de pages. L'utilisateur doit également avoir accès à la page à travers les permissions définies dans le module Web > Accès.
it: Un nodo, dell'Albero delle Pagine, è assegnato all'utente. Gli utenti possono operare solo su pagine, e quindi sui relativi record, che sono nei loro "DB Mounts"! Quando un nodo è assegnato a un utente, tale nodo diventerà la radice si un sotto-albero delle pagine. L'utente deve avere accesso alla pagina attraverso le normali autorizzazioni di pagina impostate nel modulo Sistema>Accesso.

# file_mountpoints.description
source: Assign startpoints for the file folder tree.
ar: تعيين نقاط البداية لشجرة مجلّد الملفات.
fr: Assigne un point d'entrée pour l'arborescence de fichier.
it: Assegna nodi dell'Albero delle Cartelle.

# file_mountpoints.details
source: The file folder tree is used by all File-submodules to navigate between the file folders on the webserver. Notice as with 'DB mounts' the file folder mounts may be inherited from the member groups of the user. See Backend Groups for details
ar: يتم استخدام شجرة مُجلّد الملف بواسطة جميع الوحدات الفرعية للملف للتنقل بين مجلدات الملفات على خادم الويب. لاحظ أنه مع "تحميل قاعدة البيانات"، قد يتم توريث عمليات تحميل مُجلّد الملف من مجموعات الأعضاء الخاصة بالمستخدم. انظر مجموعات الواجهة الخلفية للحصول على التفاصيل
fr: L'arborescence des dossiers est utilisée par tous les sous-modules Fichiers pour naviguer dans les dossiers et les fichiers du serveur web. Notez que comme avec le 'Montage BDD', les montages de dossiers peuvent être hérités des groupes de l'utilisateur. Voir la gestion des groupes d'utilisateurs Backend pour plus de détails.
it: L'albero delle cartelle è utilizzato da tutti i moduli dell'area File, per navigare tra cartelle e file sul server web. Nota che i nodi inclusi nel 'DB mounts' possono essere ereditati dai gruppi utenti. Per i dettagli, vedi "Backend Groups" nella documentazione

# email.description
source: Enter the email address of the user.
ar: أدخل عنوان البريد الإلكتروني للمستخدم.
fr: Entrez l'adresse email de l'utilisateur.
it: Inserisci l'indirizzo email dell'utente.
