Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# history_entry.details
source: <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ar: <b>إشعار:</b> إذا كنت لا ترى قيم الاختلاف الأحمر / الأخضر، الخادم TYPO3 يعمل لا يدعم عرض الفرق أو أنه تم تكوينه بشكل غير صحيح لتوفير هذه الميزة.
fr: <b>Note:</b> Si vous ne voyez pas de différences en rouge/vert, le serveur sur lequel TYPO3 fonctionne ne supporte pas l'affichage des différences ou a été mal configuré pour fournir cette fonctionnalité.
it: <b>Nota:</b> se non vedi valori di differenza rosso/verde, il server, su cui viene eseguito TYPO3, non supporta la visualizzazione delle differenze o è stato configurato in modo errato per fornire questa funzionalità.

# TCEforms.alttitle
source: TYPO3 Editing Forms
ar: نماذج تعديل TYPO3
fr: Formulaires d'édition TYPO3
it: Form-modifica di TYPO3

# TCEforms.description
source: All records in TYPO3 is edited through a standardized form interface like the one you see here. No matter if you edit pages, content elements, guestbook items or user records you will use the same familiar interface.
ar: يتم تعديل جميع السجلات في TYPO3 عن طريق واجهة نموذج موحد مثل تلك التي تراها هنا. بِغضّ النظر إذا قمت بتعديل الصفحات، عناصر المحتوى، فقرات سجل الزوار أو سجلات المستخدم سوف تستخدم نفس الواجهة المألوفة.
fr: Tous les enregistrements dans TYPO3 sont édités dans une interface standard comme celle que vous pouvez voir ici. Que vous éditiez des pages, des éléments de contenu, des éléments du livre d'or ou des enregistrements d'utilisateurs, vous utiliserez le même genre d'interface.
it: Tutti i record di TYPO3 sono modificabili con un'interfaccia standard come quella che vedi qui. Non importa se stai modificando pagine, elementi di contenuto, record o utenti, userai sempre la stessa interfaccia.

# TCEforms.details
source: <b>Saving content</b> Just press one of the save-buttons in the top of bottom of the form. There are some variants allowing you to "Save and close document" or "Save document and View page". The latter will save the document and open a new window where the affected page is shown (be sure to disable pop-up blockers for this function!) <b>Editing multiple records at a time</b> From the Web>List module you can activate editing of multiple records at a time. This is done when you list a single table and enable multiple columns for display (see Web>List module for details) - then icons will link you to a form with multiple records displayed, possibly with only certain fields available for editing. <b>Frontend Editing</b> Another way of editing records in TYPO3 is using the website frontend. Depending on your user credentials you will see small pencil icons in the frontend. When you click these you will be guided to a form where you can also change the content. <b>Customize the forms [for Admins]</b> You can customize the TCEforms in many ways using User TSconfig and Page TSconfig. See links below.
ar: <b>حفظ المحتوى</b> فقط اضغط على واحدة من أزرار الحفظ في الجزء السفلي من النموذج. هناك بعض المتغيرات التي تسمح لك "حفظ وإغلاق الوثيقة" أو "حفظ المستند وعرض الصفحة". سيقوم الأخير بحفظ المستند وفتح نافذة جديدة حيث تظهر الصفحة المستهدفة (تأكد من تعطيل مانع المنبثقات لهذه الوظيفة! <b>تحرير سجلات متعددة في كل مرة</b> من وحدة القائمة>يمكنك تنشيط تحرير سجلات متعددة في كل مرة. يتم هذا عندما تقوم بقائمة جدول واحد وتفعيل عدة أعمدة للعرض (أنظر قائمة الويب>للحصول على التفاصيل) - ثم ستقوم الأيقونات بربطك بنموذج مع سجلات متعددة عرضة، ربما مع بعض الحقول فقط المتاحة للتحرير. <b>تعديل الواجهة الأمامية</b> طريقة أخرى لتعديل السجلات في TYPO3 هي استخدام واجهة الموقع الأمامية. اعتماداً على بيانات اعتماد المستخدم الخاصة بك سوف ترى أيقونات صغيرة في المقدمة. عند النقر فوقها سيتم توجيهك إلى نموذج حيث يمكنك أيضاً تغيير المحتوى. <b>تخصيص النماذج [للمشرفين]</b> يمكنك تخصيص أشكال TCEforms بعدة طرق باستخدام TSconfig و صفحة TSconfig. انظر الروابط أدناه.
fr: <b>Enregistrement du contenu</b> Il suffit d'appuyer sur l'un des boutons de sauvegarde en haut du formulaire. Il y a des variantes qui vous permettent de "Enregistrer et fermer le document" ou "Enregistrer le document et afficher la page". Ce dernier sauvegardera le document et ouvrira une nouvelle fenêtre où la page concernée sera affichée (assurez-vous de désactiver les bloqueurs de pop-up pour cette fonction ! <b>Édition de plusieurs enregistrements à la fois</b> À partir du module Web>Liste vous pouvez activer l'édition de plusieurs enregistrements à la fois. Ceci est possible lorsque vous listez une seule table et activez plusieurs colonnes à afficher (voir Web>Module Liste pour plus de détails) - les icônes vous mèneront alors à un formulaire avec plusieurs enregistrements affichés, avec éventuellement seulement certains champs disponibles pour l'édition. <b>Edition Frontend</b> Une autre façon de modifier les enregistrements dans TYPO3 est d'utiliser le frontend du site web. Selon vos permissions utilisateur, vous verrez de petites icônes de crayon dans le frontend. Lorsque vous cliquez sur ceux-ci, vous serez guidé vers un formulaire où vous pouvez également modifier le contenu. <b>Personnalisez les formulaires [pour les Admins]</b> Vous pouvez personnaliser les formulaires TCEforms de plusieurs façons en utilisant User TSconfig et Page TSconfig. Voir les liens ci-dessous.
it: <b>Salvare il contenuto</b> Per salvare le modifiche è sufficiente fare clic sul bottone "Salva", in alto nella form-modifica. <b>Modifica più record alla volta</b> Dal modulo Web>Lista è possibile attivare la modifica di più record alla volta. Questo viene fatto quando si entra in modalità singola-tabella, facendo clic su "Pagina" o sul nome di un elemento di contenuto, come "Contenuto di Pagina". È possibile modificare i campi visibili: tutte le colonne assieme o una singola colonna. La modifica sarà fatta su tutti i record visibili. Se si vuole modificare solo alcuni record, abilitare una clipboard numerata (es. "Clipboard #1"). <b>Modifica dal Frontend</b> Un altro modo di modificare i record in TYPO3 è utilizzare il frontend del sito. A seconda delle tue credenziali utente, vedrai le icone a matita piccole nel frontend. Facendo clic sull'icona di modifica, sarai guidato a una form-modifica per modificare direttamente il contenuto, senza dovere accedere al backend. <b>Personalizza i moduli [per amministratori]</b> Puoi personalizzare i moduli TCEform in molti modi utilizzando TSconfig Utente e TSconfig di Pagina. Vedi i collegamenti qui sotto.

# _TCEforms.seeAlso
source: Editing pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ Frontend Editing | http://typo3.org/documentation/document-library/doc_tut_quickstart/Frontend_editing/, xMOD_csh_corebe:list_module User TSconfig related to forms | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/ Page TSconfig related to forms | https://docs.typo3.org/typo3cms/CoreApiReference/Rte/Transformations/Tsconfig/ Linking to the edit forms [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/EditLinks/
ar: تعديل الصفحات <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ تعديل الواجهة الأمامية <unk> http://typo3.org/documentation/document-library/doc_tut_quickstart/Frontend_editing/ xMOD_csh_corebe:list_module المستخدم TSconfig ذي الصلة بالأشكال <unk> https://docs. ypo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/ صفحة TSconfig ذات الصلة بالنماذج <unk> https://docs.typo3.org/typo3cms/CoreApiReference/Rte/Transformations/Tsconfig/ ربط باستمارات التعديل [Technical] <unk> https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/examples/EditLinks/
fr: Pages d'édition | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ Edition Frontend | http://typo3.org/document-library/doc_tut_quickstart/Frontend_editing/, xMOD_csh_corebe:list_module User TSconfig lié aux formulaires | https://docs. ypo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/ Page TSconfig lié aux formulaires | https://docs.typo3.org/typo3cms/CoreApiReference/Rte/Transformations/Tsconfig/ Liaison aux formulaires d'édition [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Exemples/EditLinks/
it: Modificare le pagine | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ Modifica dal Frontend | http://typo3.org/documentation/document-library/doc_tut_quickstart/Frontend_editing/, xMOD_csh_corebe:list_module TSconfig Utente per form-modifica | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/ TSconfig di Pagina per form-modifica | https://docs.typo3.org/typo3cms/CoreApiReference/Rte/Transformations/Tsconfig/ Collegamento a una form-modifica [Tecnico] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/EditLinks/

# TCEforms.image_descr
source: This is how a typical record is edited in TYPO3. The form display is standardized for all types of records. You will always see the same buttons in the top for saving or closing. In the blue bar you will see the type of record (table name) and the ID number that each record has (uid). Here the record is a page with ID "2" and the title "Content Elements". The "additional fields" from the example above is located in a so called "palette". This is an example of three content elements being edited at the same time. You can edit multiple records by using the links from the Web>List module in single-table mode. Notice that not only are three records shown at the same time - it is also a limited number of fields shown for editing, here "Header" and "Hide". You can combine this almost any way you like. This is of course very useful if you need to edit only the header of multiple records.
ar: هذه هي الطريقة التي يتم بها تعديل سجل نموذجي في TYPO3. يتم توحيد عرض النموذج لجميع أنواع السجلات. سوف ترى دائماً نفس الأزرار في الأعلى للحفظ أو الإغلاق. في الشريط الأزرق سوف تشاهد نوع السجل (اسم الجدول) ورقم الهوية الذي يحمله كل سجل (uid). هنا السجل صفحة ذات معرف "2" والعنوان "عناصر المحتوى". "الحقول الإضافية" من المثال أعلاه موجودة في ما يسمى "Palette". وهذا مثال على ثلاثة عناصر محتوى يجري تعديلها في نفس الوقت. يمكنك تعديل سجلات متعددة باستخدام الروابط من ويب>وحدة القائمة في وضع جدول واحد. ملاحظة أن عدد الحقول المبينة للتعديل ليس فقط ثلاثة سجلات - بل هي أيضاً عدد محدود من الحقول هنا "العنوان" و "الاختفاء". يمكنك الجمع بين هذا تقريباً بأي طريقة تحب. هذا بالطبع مفيد جداً إذا كنت بحاجة إلى تعديل ترويسة سجلات متعددة فقط.
fr: Voici comment un enregistrement typique est édité dans TYPO3. L'affichage du formulaire est standardisé pour tous les types d'enregistrements. Vous verrez toujours les mêmes boutons en haut pour enregistrer ou fermer. Dans la barre bleue, vous verrez le type d'enregistrement (nom de la table) et le numéro d'identification que chaque enregistrement a (uid). Ici, l'enregistrement est une page avec l'ID "2" et le titre "Éléments de contenu". Les "champs supplémentaires" de l'exemple ci-dessus se trouvent dans une "palette". Ceci est un exemple de trois éléments de contenu en cours d'édition simultanée. Vous pouvez éditer plusieurs enregistrements en utilisant les liens du module Web>Liste en mode table unique. Notez que non seulement trois enregistrements sont affichés en même temps - il s'agit également d'un nombre limité de champs affichés pour l'édition, ici "En-tête" et "Masquer". Vous pouvez combiner cela comme vous le souhaitez. Ceci est bien sûr très utile si vous avez besoin de modifier seulement l'en-tête de plusieurs enregistrements.
it: Questo è il modo in cui viene modificato un record in TYPO3. La form-modifica è standardizzata per tutti i tipi di record. Vedrai sempre gli stessi bottoni nella parte superiore per salvare o chiudere. Sarà evidente anche il tipo di record (nome del tipo di contenuto) e il numero di ID di ogni record ([uid]). Qui il record è una pagina con ID "2" e il titolo "Content Elements". I "campi aggiuntivi", dall'esempio sopra, si trovano in una cosiddetta "tavolozza". Questo è un esempio di tre elementi di contenuto che vengono modificati contemporaneamente. È possibile modificare più record utilizzando i collegamenti dal modulo Web>Lista in modalità singola-tabella. Notare che non solo sono tre record mostrati allo stesso tempo, è anche un numero limitato di campi mostrati per la modifica, qui "Intestazione" e "Nascondi". È possibile combinare questo secondo le tue necessità. Questo è ovviamente molto utile se è necessario modificare solo l'intestazione di più record.

# TCEforms_cacheSelector.alttitle
source: Forms Menu
ar: قائمة النماذج
fr: Menu formulaire
it: Menù Form

# TCEforms_cacheSelector.description
source: This is alternative ways to select "Save"/"Close" operations for records. You can also select "clear-cache" operations if you are allowed access to them.
ar: هذا طرق بديلة لتحديد العمليات "حفظ"/"إغلاق" للسجلات. يمكنك أيضاً تحديد عمليات "clear-cache" إذا كان يسمح لك بالوصول إليها.
fr: C'est une méthode alternative à la sélection "Enregistrer"/"Fermer" pour les enregistrements. Vous pouvez sélectionner les opérations de vidage des caches si vous y avez accès.
it: Questo è un modo alternativo per selezionare le operazioni "Salva"/"Chiudi" per i record. Puoi anche selezionare le operazioni di svuotamento cache, se hai il permesso di accedervi.

# TCEforms_cacheSelector.details
source: Clearing the cache for pages and clearing all cache can be done from this menu as well. If you wonder why content on the frontend webpage seems to be different from what is in the database you might need to clear the page cache by using one of these options. If cache options are not available for you, you should ask your administrator to enable it for you. (Admins: See link below to TSconfig.)
ar: يمكن القيام بمسح ذاكرة التخزين المؤقت للصفحات ومسح جميع ذاكرة التخزين المؤقت من هذه القائمة أيضاً. إذا كنت تتساءل لماذا يبدو المحتوى في صفحة الواجهة الأمامية مُختلفاً عمّا هو في قاعدة البيانات. هذا لأنك تحتاج إلى مسح ذاكرة التخزين المؤقت للصفحة باستخدام أحد هذه الخيارات. إذا كانت خيارات ذاكرة التخزين المؤقت غير متوفرة لك، يجب عليك أن تطلب من المسؤول الخاص بك تمكينه لك. (المشرف: راجع الرابط أدناه إلى TSconfig.)
fr: Effacer le cache des pages et effacer tous les caches peut être effectué aussi de ce menu. Si vous ne comprenez pas pourquoi le contenu du site est différent de ce qu'il y a dans base de données, vous devriez effacer le cache de la page en utilisant une de ces options. Si les options de cache ne vous sont pas accessibles, vous devez demander à votre administrateur de vous les activer (Admin : voir les liens ci-dessous pour TSconfig).
it: Svuotare la cache delle pagine e svuotare tutta la cache, può essere fatto da questo menù. Se ti chiedi perché il contenuto sul frontend sembra essere diverso da quello che è nel database e ti aspetti, potrebbe essere necessario svuotare la cache della pagina utilizzando una di queste opzioni. Se le azioni sulla cache non sono disponibili per te, dovresti chiedere all'amministratore di abilitarla (Admin: Vedi il collegamento qui sotto a TSconfig.)

# _TCEforms_cacheSelector.seeAlso
source: User TSconfig (See "clearCache.pages/.all") | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Options/
ar: المستخدم TSconfig (انظر "clearCache.pages/.all") <unk> https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Options/
fr: User TSconfig (Voir "clearCache.pages/.all") | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Options/
it: TSconfig Utente (Vedi "clearCache.pages/.all") | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Options/

# perm_module.alttitle
source: Viewing page permissions
ar: عرض أذونات الصفحة
fr: Permissions de visibilité de page
it: Visualizzazione permessi pagina

# perm_module.description
source: This view will tell you about the page permissions in the page tree.
ar: هذا العرض سوف يخبرك عن أذونات الصفحة في شجرة الصفحة.
fr: Cette vue vous présente les permissions sur les pages dans l'arborescence.
it: Questo mostra i permessi della pagina nell'Albero delle Pagine.

# perm_module.details
source: There are two modes you can select: <b>User overview:</b> This will show you the permissions for <em>your</em> login. So the green/red indicators will reflect the combined user/group/everyone permissions that apply to your login! If there is a grey background behind the indicators it tells you that you are the owner of the page. <b>Permissions</b> Shows the permissions settings for owner / group / everybody. You will be able to edit these settings by clicking the edit icon next to the page title. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
ar: هناك وضعين يمكنك تحديدهما: <b>نظرة عامة للمستخدم:</b> هذا سيظهر لك أُذونات تسجيل الدخول <em>الخاص بك</em> . لذا فالإشارات الخضراء/الحمراء سوف تظهر أُذونات المستخدم/المجموعة/الجميع التي تنطبق على تسجيل الدخول الخاص بك! إذا كانت هناك خلفية رمادية وراء الإشارات فإنه يخبرك أنك مالك الصفحة. <b>الأذونات</b> يعرض إعدادات الأذونات للمالك / المجموعة / الجميع. ستتمكن من تعديل هذه الإعدادات بالنقر على أيقونة التحرير بجانب عنوان الصفحة. فقط مالك صفحة (أو "المشرف"-user) يمكنه تغيير الأذونات للصفحة.
fr: Il y a deux modes que vous pouvez sélectionner : <b>Utilisateur</b> Cela vous montrera les permissions pour <em>votre</em> login. Les indicateurs vert/rouge refléteront les permissions combinées utilisateur/groupe/tous qui s'appliquent à votre login. S'il y a un fond gris derrière les indicateurs, cela veut dire que vous êtes le propriétaire de la page. <b>Permissions</b> Montre les permissions pour le propriétaire/groupe/tous. Vous pourrez éditer ces paramètres en cliquant sur l'icône d'édition à côté du titre de la page. Seul le propriétaire de la page (ou l'utilisateur "Admin") peut changer les permissions d'une page.
it: Ci sono due modalità che puoi selezionare: <b>Panoramica utente</b> Questo ti mostrerà i permessi per il <em>tuo</em> account. Quindi gli indicatori verde/rosso rifletteranno i permessi combinati utente/gruppo/tutti che si applicano in fase di login! Se c'è uno sfondo grigio dietro gli indicatori, ti dice che sei il proprietario della pagina. <b>Permessi</b> Mostra le impostazioni dei permessi per proprietario / gruppo / tutti. Potrai modificare queste impostazioni facendo clic sull'icona di modifica accanto al titolo della pagina. Solo il proprietario della pagina (o un utente admin) può cambiare i permessi per la pagina.

# _perm_module.seeAlso
source: xMOD_csh_corebe:perm_module_setting, User Management How-to | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/ Permission system in TYPO3 [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/AccessControlOptions/, _MOD_user_setup:option_helpText
ar: xMOD_csh_corebe:perm_module_setting, إدارة المستخدم How-to <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/ نظام أذونات في TYPO3 [Technical] <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/AccessControlOptions/ _user_setuppoption_helpText
fr: xMOD_csh_corebe:perm_module_setting, Gestion des utilisateurs | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/ Système d'autorisations dans TYPO3 [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControlOptions/, _MOD_user_setup:option_helpText
it: xMOD_csh_corebe:perm_module_setting, Come gestire gli utenti | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/ Permessi in TYPO3 [Tecnico] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/AccessControlOptions/, _MOD_user_setup:option_helpText

# _perm_module.image
source: EXT:core/Resources/Public/Images/cshimages/core_43.png, EXT:core/Resources/Public/Images/cshimages/core_41.png,
ar: EXT:core/Resources/Public/Images/cshimages/core_20.png, EXT:core/Resources/Public/Images/cshimages/core_21.png,

# perm_module_setting.alttitle
source: Setting permissions for a page
ar: إعداد صلاحيات الصفحة
fr: Définition des permissions pour une page
it: Impostazione dei permessi per una pagina

# perm_module_setting.description
source: Select the owner user and group plus the permissions for each in the matrix. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
ar: حدد المستخدم المالك والمجموعة بالإضافة إلى الأذونات لكل في المصفوفة. فقط مالك صفحة (أو "المشرف"-user) يمكنه تغيير الأذونات للصفحة.
fr: Sélectionnez le propriétaire et le groupe, plus les permissions pour chaque dans le tableau. Seul le propriétaire d'une page (ou l'utilisateur "Admin") peut changer les permissions pour la page.
it: Seleziona proprietario e gruppo poi imposta i permessi, per ciascuno, nella matrice. Solo un proprietario di una pagina (o un utente admin) può cambiare i permessi per la pagina.
