Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_tca.xlf
Languages: ar

# file_mountpoints_edit_title
source: Edit filemount
ar: تعديل filemount

# file_mountpoints_add_title
source: Create new filemount
ar: إنشاء filemount جديد

# file_mountpoints_list_title
source: List filemounts
ar: قائمة filemounts

# mfa_providers
source: Allowed multi-factor authentication providers
ar: السماح لمُوفريْ المُصادَقَة المَتعدِدة

# allowed_languages
source: Limit to languages
ar: الاقتصار على اللغات

# allowed_languages.description
source: If no language is selected, all languages will be available by default.
ar: إذا لم يتم تحديد أيّة لغة، ستكون جميع اللغات مُتاحة بشكل افتراضي.

# category_perms
source: Category Mounts
ar: بناء الفئة

# workspace_perms
source: Workspace permissions
ar: أُذُونات مساحة العمل

# workspace_perms_live
source: Edit Live (Online)
ar: تعديل مباشر (مُتصل)

# be_users.username
source: Username
ar: اسم المستخدم

# be_users.password
source: Password
ar: كلمة المرور

# be_users.mfa
source: Multi-factor authentication
ar: المصادقة مُتعدِدة العوامل

# be_users.avatar
source: Avatar
ar: الصورة الرمزية

# be_users.usergroup
source: Group
ar: المجموعة

# be_users.usergroup_edit_title
source: Edit usergroup
ar: تعديل مجموعة المُستخدم

# be_users.usergroup_add_title
source: Create new group
ar: إنشاء مجموعة جديدة

# be_users.usergroup_list_title
source: List groups
ar: قائمة المجموعات

# be_users.admin
source: Admin (!)
ar: المُشرف (!)

# be_users.options
source: Mount from groups
ar: البناء من المجموعات

# be_users.fileoper_perms
source: Fileoperation permissions
ar: أذونات إدارة المِلَفّ

# be_users.file_permissions.files
source: Files
ar: الملفات

# be_users.file_permissions.files_read
source: Files: Read
ar: الملفات: قراءة

# be_users.file_permissions.files_write
source: Files: Write
ar: الملفات: كتابة

# be_users.file_permissions.files_add
source: Files: Add
ar: الملفات: إضافة

# be_users.file_permissions.files_rename
source: Files: Rename
ar: الملفات: إعادة تسمية

# be_groups.file_permissions.files_replace
source: Files: Replace
ar: الملفات: استبدل

# be_users.file_permissions.files_move
source: Files: Move
ar: الملفات: نقل

# be_users.file_permissions.files_copy
source: Files: Copy
ar: الملفات: نسخ

# be_users.fileoper_perms_unzip
source: Files: Unzip
ar: الملفات: فك ضغط

# be_users.file_permissions.file_delete
source: Files: Delete
ar: الملفات: حذف

# be_users.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ar: الملفات: تحميل،نسخ،نقل،حذف،إعادة تسمية،جديد،تعديل

# be_users.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ar: الدليل: نقل،حذف،إعادة تسمية،جديد

# be_users.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ar: الدليل: نسخ

# be_users.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ar: الدليل: حذف بشكل متكرر (rm -Rf)

# be_users.lang
source: User Interface Language
ar: لغة واجهة المستخدم

# be_users.languageItemGroups.default
source: Default
ar: افتراضي

# be_users.languageItemGroups.installed
source: Installed Languages
ar: اللغات المُثبّتة

# be_users.languageItemGroups.unavailable
source: Unavailable Languages
ar: اللغات غير المتاحة

# be_users.tabs.permissions
source: Permissions
ar: الأُذُونات

# be_users.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ar: البناء ومساحات العمل

# be_users.tabs.options
source: Options
ar: الخيارات

# be_users.tabs.extended
source: Extended
ar: مُوَسَّعْ "Extended"

# be_users.tabs.access
source: Access
ar: صَلاحِيَة الدخول

# be_users.tabs.personal_data
source: Personal Data
ar: البيانات الشخصية

# be_groups.tables_select
source: Tables (listing)
ar: الجداول (مُدرجة)

# be_groups.explicit_allowdeny
source: Explicitly allow field values
ar: السماح صراحة بقيم الحقل

# be_groups.custom_options
source: Custom module options
ar: خيارات الوُحدة المُخصصة

# be_groups.subgroup
source: Inherit settings from groups
ar: توريث الإعدادات من المجموعات

# be_groups.tabs.record_permissions
source: Record Permissions
ar: أُذُونات السجل

# be_groups.tabs.module_permissions
source: Module Permissions
ar: أُذُونات الوحدة

# be_groups.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ar: البناء ومساحات العمل

# be_groups.fileoper_perms
source: Fileoperation permissions
ar: أذونات إدارة المِلَفّ

# be_groups.file_permissions.folder
source: Directory
ar: الدليل

# be_groups.file_permissions.folder_read
source: Directory: Read
ar: الدليل: قراءة

# be_groups.file_permissions.folder_write
source: Directory: Write
ar: الدليل: كتابة

# be_groups.file_permissions.folder_add
source: Directory: Add
ar: الدليل: إضافة

# be_groups.file_permissions.folder_rename
source: Directory: Rename
ar: الدليل: إعادة التسمية

# be_groups.file_permissions.folder_move
source: Directory: Move
ar: الدليل: نقل

# be_groups.file_permissions.folder_copy
source: Directory: Copy
ar: الدليل: نسخ

# be_groups.file_permissions.folder_delete
source: Directory: Delete
ar: الدليل: حذف

# be_groups.file_permissions.folder_recursivedelete
source: Directory: Delete recursively
ar: الدليل: حذف بشكل مُتكرر

# be_groups.file_permissions.files
source: Files
ar: الملفات

# be_groups.file_permissions.files_read
source: Files: Read
ar: الملفات: قراءة

# be_groups.file_permissions.files_write
source: Files: Write
ar: الملفات: كتابة

# be_groups.file_permissions.files_edit
source: Files: Edit
ar: المِلَفّ: تعديل

# be_groups.file_permissions.files_add
source: Files: Add
ar: الملفات: إضافة

# be_groups.file_permissions.files_rename
source: Files: Rename
ar: الملفات: إعادة تسمية

# be_groups.file_permissions.files_move
source: Files: Move
ar: الملفات: نقل

# be_groups.file_permissions.files_copy
source: Files: Copy
ar: الملفات: نسخ

# be_groups.fileoper_perms_unzip
source: Files: Unzip
ar: الملفات: فك ضغط

# be_groups.file_permissions.files_delete
source: Files: Delete
ar: الملفات: حذف

# be_groups.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ar: الملفات: تحميل،نسخ،نقل،حذف،إعادة تسمية،جديد،تعديل

# be_groups.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ar: الدليل: نقل،حذف،إعادة تسمية،جديد

# be_groups.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ar: الدليل: نسخ

# be_groups.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ar: الدليل: حذف بشكل متكرر (rm -Rf)

# be_groups.tabs.options
source: Options
ar: الخيارات

# be_groups.tabs.extended
source: Extended
ar: مُوَسَّعْ "Extended"

# sys_filemounts.tabs.users
source: Users
ar: المستخدمين

# sys_filemounts.tabs.mountpoints
source: Mountpoints
ar: نقطة البناء

# sys_filemounts.tabs.publishing
source: Publishing
ar: النشر

# sys_filemounts.tabs.other
source: Other
ar: أخر

# sys_filemounts.identifier
source: Entry point
ar: نقطة الدخول

# sys_filemounts.title
source: Label
ar: تسمية

# sys_filemounts.read_only
source: Read-only
ar: للقراءة فقط

# sys_history
source: System History
ar: تاريخ النظام

# sys_log
source: System Log
ar: سجل النظام

# sys_news
source: System News
ar: أخبار النظام

# sys_news.tabs.access
source: Access
ar: صَلاحِيَة الدخول

# sys_workspace.adminusers
source: Owners
ar: المالك

# sys_workspace.members
source: Members
ar: الأعضاء

# sys_workspace.publish_time
source: Publish
ar: نشر

# sys_workspace.freeze
source: Freeze Editing
ar: تجميد التعديل

# sys_workspace.live_edit
source: Allow "live" editing of records from tables without versioning
ar: السماح بتعديل السجلات "المباشرة" من الجداول دون الإِصدار

# sys_workspace.review_stage_edit
source: Allow members to edit records in "Review" stage
ar: السماح للأعضاء بتعديل السجلات في مرحلة "المُراجعة"

# sys_workspace.disable_autocreate
source: Disable auto-versioning when editing
ar: تعطيل الإصدار التلقائي عند التعديل

# sys_workspace.publish_access
source: Publish access
ar: نشر صَلاحِيَة الدخول

# sys_workspace.stagechg_notification
source: Stage change notification by email
ar: مرحلة تغيير الإِشعار عن طريق البريد الإلكتروني

# pages
source: Page
ar: الصفحة

# pages.hidden_toggle
source: Page visible
ar: الصفحة مرئية

# pages.hidden_toggle_formlabel
source: Page visible
ar: الصفحة مرئية

# pages.nav_hide
source: Page not enabled in menus
ar: الصفحة غير مُفعَّلة في القوائم

# pages.nav_hide_toggle
source: Page enabled in menus
ar: الصفحة مُفعَّلة في القوائم

# pages.nav_hide_toggle_formlabel
source: Page enabled in menus
ar: الصفحة مُفعَّلة في القوائم

# doktype.I.0
source: Standard
ar: قياسي

# doktype.I.folder
source: Folder
ar: مُجلّد

# title
source: Page title
ar: عنوان الصفحة

# php_tree_stop
source: Hide child pages in page tree
ar: إخفاء الصفحات الفرعية في شجرة الصفحة

# is_siteroot
source: Is root of website
ar: جذر الموقع

# pages.slug
source: URL Segment
ar: مقطع URL

# pages.description
source: Description for search engines
ar: الوصف من اجل محركات البحث

# be_users
source: Backend user
ar: مُستخدم الواجهة الخلفية

# be_groups
source: Backend usergroup
ar: مجموعة مُستخدمي الواجهة الخلفية

# sys_filemounts
source: Filemount
ar: Filemounts

# sys_file_storage
source: File Storage
ar: تخزين الملفات

# sys_file_storage.type
source: Entry point
ar: نقطة الدخول

# sys_file_storage.name
source: Name
ar: الاسم

# sys_file_storage.hidden
source: Hide from listings
ar: إخفاء من القوائم

# sys_file_storage.is_online
source: Is online?
ar: مُتصل؟

# sys_file_storage.is_default
source: Is default storage?
ar: هل التخزين الافتراضي؟

# sys_file_storage.is_browsable
source: Is browsable?
ar: هل يمكن التصفّح؟

# sys_file_storage.is_public
source: Is publicly available?
ar: هل مُتاح للعامّة؟

# sys_file_storage.is_writable
source: Is writable?
ar: هل قابل للكتابة؟

# sys_file_storage.auto_extract_metadata
source: Automatically extract metadata after upload
ar: استخراج البيانات الوَصفيّة تلقائياً بعد التحميل

# sys_file_storage.capabilities
source: Capabilities
ar: المُؤَهّلات

# sys_file_storage.processingfolder
source: Folder for manipulated and temporary images etc.
ar: مُجلد للصور المتداولة والمؤقتة، إلخ.

# sys_file_storage.driver
source: Driver
ar: السواقة

# sys_file_storage.driver.local
source: Local Filesystem
ar: نظام الملفات المحلية

# sys_file_storage.configuration
source: Driver Configuration
ar: تكوين السواقة

# sys_file
source: File
ar: ملف

# sys_file.storage
source: Storage
ar: التخزين

# sys_file.identifier
source: Identifier
ar: المُعَرِّف

# sys_file.name
source: Filename
ar: اسم الملف

# sys_file.title
source: Title
ar: عنوان

# sys_file.type
source: File Type
ar: نوع الملف

# sys_file.type.unknown
source: Unknown
ar: غير معروف

# sys_file.type.text
source: Text
ar: نص

# sys_file.type.image
source: Image
ar: صورة

# sys_file.type.audio
source: Audio
ar: صوت

# sys_file.type.video
source: Video
ar: فيديو

# sys_file.type.software
source: Software
ar: برمجية

# sys_file.mime_type
source: Mime Type
ar: نوع Mime

# sys_file.size
source: Size
ar: الحجم

# sys_file.usage_count
source: Usage Count
ar: عدد الاستخدامات

# sys_file.description
source: Description
ar: الوَصف

# sys_file.alternative
source: Alternative Text
ar: النص البديل

# sys_file.alternative.description
source: Images must have text alternatives that describe the information or function represented by them. This should only be empty for purely decorative images.
ar: يجب أن تحتوي الصور على بدائل نَصيّة تصف المعلومات أو الدلالة التي تُمثلها. يمكن أن يكون هذا الحقل فارغاً فقط للصور الزخرفية البحتة.

# sys_file.missing
source: Marked as missing
ar: تحديدُه كمفقود

# sys_file.metadata
source: Metadata records
ar: سجلات البيانات الوَصفيّة

# file.width
source: Width
ar: العرض

# file.height
source: Height
ar: الإرتفاع

# sys_file_metadata
source: File Metadata
ar: البيانات الوَصفيّة للملف

# sys_file_reference
source: File Reference
ar: مِلَفّ المرجع

# sys_file_reference.uid_local
source: File
ar: ملف

# sys_file_reference.uid_foreign
source: Used by content elements
ar: تستخدم بواسطة عناصر المحتوى

# sys_file_reference.tablenames
source: Table name
ar: اسم الجدول

# sys_file_reference.fieldname
source: Foreign Field
ar: حقل غريب

# sys_file_reference.sorting_foreign
source: Sorting foreign
ar: فرز غريب

# sys_file_reference.basicoverlayPalette
source: File Metadata
ar: البيانات الوَصفيّة للملف

# sys_file_reference.imageoverlayPalette
source: Image Metadata
ar: البيانات الوَصفيّة للصورة

# sys_file_reference.audioOverlayPalette
source: Audio Metadata
ar: البيانات الوَصفيّة للصوت

# sys_file_reference.videoOverlayPalette
source: Video Metadata
ar: البيانات الوَصفيّة للفيديو

# sys_file_reference.title
source: Title
ar: العنوان

# sys_file_reference.description
source: Description (Caption)
ar: الوصف (شرح)

# sys_file_reference.downloadname
source: Download Name
ar: اسم ملف التنزيل

# sys_file_reference.alternative
source: Alternative Text
ar: النص البديل

# sys_file_reference.link
source: Link
ar: الرابط

# sys_file_reference.crop
source: Image manipulation
ar: معالجة الصور

# sys_file_reference.autoplay
source: Autoplay
ar: تشغيل تلقائي

# sys_file_collection
source: File collection
ar: مجموعة الملفات

# sys_file_collection.files
source: Files
ar: الملفات

# sys_file_collection.title
source: Title
ar: العنوان

# sys_file_collection.type
source: Type
ar: النوع

# sys_file_collection.type.0
source: Static selection of files
ar: اختيار ثابت للملفات

# sys_file_collection.type.1
source: Folder from Storage
ar: مجلد من التخزين

# sys_file_collection.type.2
source: Select by category
ar: حدد حسب الفئة

# sys_file_collection.storage
source: File Storage
ar: تخزين الملفات

# sys_file_collection.folder
source: Folder
ar: مُجلّد

# sys_file_collection.recursive
source: Recursive
ar: مُتكرر

# sys_file_collection.category
source: Category
ar: الفئة

# sys_workspace
source: Workspace
ar: مساحة العمل

# editlock
source: Restrict editing by non-Admins
ar: تقييد التعديل من قبل غير المُشرفين

# sys_category
source: Category
ar: فئة

# sys_category.title
source: Title
ar: العنوان

# sys_category.parent
source: Parent
ar: الأصل

# sys_category.items
source: Items
ar: عناصر

# sys_category.categories
source: Categories
ar: الفئات

# sys_category.tabs.category
source: Categories
ar: الفئات

# sys_category.tabs.items
source: Items
ar: العناصر
