Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_sysfilestorage.xlf
Languages: ar, fr, it

# .description
source: File storage, which acts as an entry root point to a file-based structure. See it like a drive or a hard drive volume in your local machine.
ar: مكان تخزين الملفات، الذي يعمل كنقطة دخول جذور للهيكل القائم على المِلَفّ. يمكن تشبيهه كمحرك أقراص أو محرك أقراص صلبة في حاسوبك المنزلي.
fr: Stockage de fichiers, qui agit comme un point d'entrée vers une structure basée sur des fichiers. Voyez-le comme un lecteur ou un volume de disque dur sur votre ordinateur local.
it: Lo Storage è la radice di una struttura ad albero di cartelle e file. Da intendere come un disco, un volume del disco rigido o una cartella del file system.

# hidden.description
source: Unchecking this option results in removing of the storage from any listings in the backend. Existing file relations will still exist.
ar: سيؤدي تعطيل وحدة التخزين إلى إزالتها من أي قوائم في الواجهة الخلفية. ستظل علاقات الملفات الموجودة متاحة.
fr: Décocher cette option entraîne la suppression du stockage de toutes les listes dans le backend. Les relations de fichiers existantes existeront toujours.
it: Deselezionando quest'opzione si rimuove temporaneamente lo Storage dagli elenchi nel backend. Le relazioni esistenti tra file non vengono alterate.

# hidden.details
source: If you set up a file storage, it will show up on any folder lists, thus allowing to basically browse through the files in this file repository. If you set this checkbox, this storage will be excluded from any listings in the backend. Any existing file references will still exist further.
ar: إذا قمت بإعداد تخزين مِلَفّ، فإنه سيظهر في أي قوائم المجلدات، ومن ثم السماح بالتصفح بواسطة الملفات الموجودة في مستودع الملفات هذا. إذا قمت بتعيين مربع الاختيار هذا، سيتم استبعاد هذا التخزين من أي قوائم في الواجهة الخلفية. أي مراجع للملفات الحالية ستظل موجودة أكثر.
fr: Si vous configurez un stockage de fichiers, celui-ci apparaîtra sur toutes les listes de dossiers, permettant ainsi de parcourir les fichiers de ce référentiel de fichiers. Si vous cochez cette case, cet espace de stockage sera exclu de toute liste du backend. Toute référence de fichier existante, existera toujours.
it: Se imposti uno Storage, verrà visualizzato su qualsiasi elenco dell'Albero delle Cartelle, permettendo così di navigare attraverso cartelle e file. Se spunti questa opzione, questo Storage sarà escluso da qualsiasi elenco dell'Albero delle Cartelle nel backend. Comunque. eventuali riferimenti a file esistenti continueranno ad esistere.

# name.description
source: The visible identifier for this file storage.
ar: المُعرّف المرئي لتخزين هذا المِلَفّ.
fr: L'identifiant visible pour ce stockage de fichier.
it: Il nome visibile per questo Storage.

# name.details
source: The label entered here will be shown as the name for the entry point in the TYPO3 Backend. Be sure to make it descriptive and logical for your editors.
ar: سيتم عرض التسمية التي تم إدخالها هنا كاسم لنقطة الدخول في الواجهة الخلفية لـ TYPO3. تأكّد من جعلها وصفية ومنطقية للمحررين الخاص بك.
fr: Le libellé entré ici sera affiché comme le nom du point d'entrée dans le backend de TYPO3. Assurez-vous de le rendre descriptif et logique pour vos éditeurs.
it: L'etichetta inserita qui sarà utilizzata come nome nell'elenco degli Storage disponibili, durante la creazione/modifica di un Filemount, nel Backend TYPO3. Assicurati di renderlo descrittivo e logico.

# description.description
source: A description of this storage.
ar: وصف لهذا التخزين.
fr: Une description de ce stockage.
it: Una descrizione per questo Storage.

# description.details
source: This description field is used to explain e.g. the location of the storage, also what this storage is meant for or what it contains.
ar: يُستخدم حقل الوصف هذا لِشرح موقع التخزين على سبيل المثال، أيضاً يشرح ما المقصود بهذا التخزين أو ما يحتوي عليه.
fr: Ce champ de description est utilisé pour expliquer, par exemple, l'emplacement du stockage, également ce à quoi ce stockage est destiné ou ce qu'il contient.
it: Questo campo descrizione è usato per spiegare, ad esempio, la locazione dello Storage, la sua finalità o il suo contenuto.

# driver.description
source: Choose the driver as the technical backbone of the storage. Once you've chosen a driver, and saved it, additional configuration will show up.
ar: اختر قرص التخزين كقاعدة أساسية تقنية للتخزين. بمجرد اختيار القرص المناسب، وحفظه، ستظهر إعدادات إضافية.
fr: Choisissez le pilote comme moyen de connexion au stockage. Une fois que vous avez choisi un pilote, et sauvegardé, une configuration supplémentaire s'affichera.
it: Il Driver è il contenitore fisico dello Storage. Una volta scelto un driver, ed effettuato il salvataggio, verrà visualizzata una configurazione aggiuntiva.

# driver.details
source: The driver is the technical background of a storage, and thus also defines whether the location of the storage is local (= on the same machine as this TYPO3 installation) or remote like a WebDAV server connection. Search for extensions in the TYPO3 Extension Repository that extend this driver list.
ar: قرص التخزين هو الخلفية التقنية للتخزين، وإنه يحدد أيضاً ما إذا كان موقع التخزين محلياً (= على نفس الجهاز الذي يعمل بها هذا التثبيت TYPO3) أو بعيد مثل اتصال خادم WebDAV. البحث عن إضافات في مستودع إضافة TYPO3 الذي يوسع قائمة المُشغل هذه.
fr: Le pilote le moyen de connexion à un stockage, et donc définit si l'emplacement du stockage est local (= sur la même machine que cette installation de TYPO3) ou distant comme une connexion de serveur WebDAV. Recherchez des extensions dans le dépôt d'extension TYPO3 qui étendent la liste des pilotes.
it: Il Driver è il "contenitore" fisico di uno Storage: la posizione, del Driver e quindi dello Storage, può essere locale (sullo stesso server di questa installazione TYPO3) o remota (come una connessione server WebDAV). Cerca estensioni nel TYPO3 Extension Repository che aggiungono driver disponibili.

# processingfolder.description
source: Defines the directory on this storage to be used to save temporary files like resized images.
ar: حدد الدليل في مكان التخزين هذا لاستخدامه لحفظ الملفات المؤقتة مثل الصور التي تم تغيير حجمها.
fr: Définit le répertoire de ce stockage à utiliser pour enregistrer des fichiers temporaires comme des images redimensionnées.
it: Definisce la cartella, di questo Storage, da utilizzare per salvare i file temporanei, come, ad esempio, la elaborazione delle immagini: compressione, ridimensionamento.

# is_browsable.description
source: If set, backend users can browse through this storage. Otherwise it will show up as a unselectable item in the list.
ar: إذا تم تعيينه، يمكن للمستخدمين في الواجهة الخلفية التصفح من خلال هذا التخزين. وإلا فإنه سيظهر كعنصر غير قابل للتحديد في القائمة.
fr: Si défini, les utilisateurs backend peuvent naviguer à travers ce stockage. Sinon, il apparaîtra comme un élément non sélectionnable dans la liste.
it: Se impostato, gli utenti di backend possono navigare questo Storage. Altrimenti verrà visualizzato come un elemento non selezionabile nell'elenco.

# is_public.description
source: If set, then the files in this storage can be linked directly from the outside world. If this is not set, make sure to provide additional possibilities to access the files in this storage.
ar: في حالة الضبط، يمكن ربط الملفات الموجودة في هذا التخزين مباشرةً من العالم الخارجي. إذا لم يتم تعيين هذا، تأكد من توفير إمكانيات إضافية للوصول إلى الملفات في هذا التخزين.
fr: Si défini, alors les fichiers de ce stockage peuvent être liés directement à partir du monde extérieur. Si cette option n'est pas définie, assurez-vous de fournir des possibilités supplémentaires pour accéder aux fichiers de ce stockage.
it: Se impostato, i file in questo Storage possono essere collegati direttamente dall'esterno. Se questo non è impostato, assicurati di fornire ulteriori possibilità di accesso ai file in questo Storage.

# is_writable.description
source: If set, then users are allowed to modify, add, delete files/folders on this storage.
ar: إذا تم تعيينه، فسيسمح للمستخدمين بتعديل وإضافة وحذف الملفات/المجلدات على هذه التخزين.
fr: Si défini, alors les utilisateurs sont autorisés à modifier, ajouter, supprimer des fichiers/dossiers sur ce stockage.
it: Se impostato, gli utenti possono modificare, aggiungere, eliminare file/cartelle su questo Storage.

# is_online.description
source: This flag is usually set. If TYPO3 cannot connect to this storage (because it maybe temporary down), then the flag will be checked, and the storage will behave like it is non-browsable in the TYPO3 backend. The admin needs to manually activate it again if it was offline.
ar: عادة ما يتم تعيين هذا العلم. إذا تعذّر على TYPO3 الاتصال بوحدة التخزين هذه (لأنه ربما مُتوقف مؤقتاً)، سيتم التحقق من العلم، وسوف تتصرف وحدة التخزين كأنها غير قابلة للتصفح في الواجهة الخلفية لـ TYPO3. يحتاج المشرف إلى تفعيله يدوياً مرة أخرى إذا كان غير متصل.
fr: Ce flag est généralement défini. Si TYPO3 ne peut pas se connecter à ce stockage (parce qu'il est peut-être temporairement en panne), alors le flag sera inactivé, et le stockage se comportera comme non navigable dans le backend de TYPO3. L'administrateur a besoin de l'activer manuellement s'il était déconnecté.
it: Solitamente questa opzione è spuntata. Nel caso in cui TYPO3 non riesca a connettersi a questo Storage (es. perché remoto e temporaneamente non raggiungibile), l'opzione sarà attiva, ma lo Storage sarà non navigabile nel backend di TYPO3. L'amministratore deve riattivarlo manualmente se era non raggiungibile.
