Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_*_users.xlf
Languages: ar, fr, it

# email.details
source: This address is rather important to enter because this is where messages from the system is sent. <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
ar: هذا العنوان مُهم إدخاله، لأنه هذا هو المكان الذي يتم فيه ارسال رسائل من النظام. <strong>تنبيه</strong> يستطيع المستخدم تغيير هذه القيمة بنفسه من داخل وحدة إعداد المستخدم>.
fr: Il est assez important d'entrer l'adresse email de l'utilisateur car c'est sur celle-ci que les messages systèmes sont envoyés. <strong>Notez</strong> que l'utilisateur peut modifier cette adresse par lui-même via le module Utilisateur>Configuration.
it: E' importante inserire questo indirizzo perché è quello verso il quale vengono inviati i messaggi di sistema. <strong>Nota</strong> che l'utente può modificare questo valore in autonomia utilizzando il modulo Impostazioni Utente.

# realName.description
source: Enter the ordinary name of the user, eg. John Doe.
ar: أدخل الاسم العادي للمستخدم، على سبيل المثال: فلان الفلاني.
fr: Entrez le nom de l'utilisateur, par ex. Brice Bernard ou David Pachot.
it: Inserisci il nome ordinario dell'utente, es. Mario Rossi.

# realName.details
source: <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
ar: <strong>ملاحظة</strong> يمكن للمستخدم تغيير هذه القيمة بنفسه من خلال وحدة إعداد(Setup module) المستخدم>.
fr: <strong>Notez</strong> que l'utilisateur peut modifier cette adresse par lui-même via le module Utilisateur>Configuration.
it: <strong>Nota</strong> che l'utente può modificare questo valore in autonomia utilizzando il modulo Impostazioni Utente.

# disable.description
source: Unchecking this option will temporarily disable the user from logging in.
ar: عدم تفعيل هذا الخيار سيؤدي بشكل مؤقت الى عدم امكانية المستخدم من تسجيل الدخول.
fr: Décocher cette option empêchera temporairement l'utilisateur de se connecter.
it: La deselezione di questa opzione disabiliterà temporaneamente l'utente dal login.

# admin.description
source: 'Admin' users have TOTAL access to the system!
ar: "المشرفين أو المدراء " هم مستخدمون لديهم الصلاحية الكاملة للوصول إلى النظام!
fr: Les utilisateurs 'Admin' ont un accès TOTAL au système!
it: Gli utenti 'Admin' hanno accesso TOTALE al sistema!

# admin.details
source: 'Admin' can do anything TYPO3 allows and this kind of user should be used only for administrative purposes. All daily handling should be done with regular users. 'Admin' users don't need to be members of any backend user groups. However you should be aware that any page created by an admin user without a group will not have any owner-group assigned and thus it will probably be invisible for other users. If this becomes a problem you can easily solve it by assigning a user group to the 'Admin' user anyway. This does of course not affect the permissions since they are unlimited, but the first group listed is by default the owner group of newly created pages. 'Admin' users are easily recognized as they appear with a red icon instead of the ordinary blue user-icon. You should probably not assign any other users than yourself as an 'Admin' user.
ar: يستطيع "المُشرف" فعل أي شيء يسمح به TYPO3 ويجب استخدام هذا النوع من المستخدمين للأغراض الإدارية فقط. يجب أن يتم التعامل اليومي فقط مع المستخدمين العاديين. لا يحتاج المستخدمون "المُشرفون" إلى أن يكونوا أعضاء في مجموعات مّستخدمي الواجهة الخلفية. ومع ذلك، يجب أن تدرك أن أي صفحة تم إنشاؤها بواسطة مُستخدم إداري بدون مجموعة، لن يتم تعيين أي مجموعة مالكة لها، وبالتالي من المُحتمل أن تكون هذه الصفحة غير مرئية للمستخدمين الآخرين. إذا كان ذلك يسبب مشكلة لك، يمكنك حلها بسهولة عن طريق تعيين مجموعة مستخدمين للمستخدم المُشرف على أي حال. هذا بالطبع لا يؤثر على الأُذُونات لأنها غير مُحددة، ولكن المجموعة الأولى المُدرجة هي بشكل افتراضي مجموعة المالك للصفحات المُنشأة حديثاً. يمكن التعرف على المُستخدمين "المُشرفين" بسهولة، حيث يظهرون بأيقونة حمراء بدلاً من أيقونة المستخدم الزرقاء العادية. ربما لا ينبغي عليك تعيين أيّة مستخدمين آخرين غيرك كمستخدم "مُشرف".
fr: 'Admin' peut faire tout ce que TYPO3 permet et ce type d'utilisateur ne doit être utilisé qu'à des fins administratives. Toute la gestion quotidienne doit être effectuée avec des utilisateurs non-admins. Les utilisateurs 'Admin' n'ont pas besoin d'être membres d'un groupe d'utilisateurs backend. Cependant, vous devez être conscient que toute page créée par un utilisateur admin sans groupe n'aura aucun groupe de propriétaire assigné et qu'elle sera donc probablement invisible pour les autres utilisateurs. Si cela devient un problème, vous pouvez facilement le résoudre en assignant un groupe d'utilisateurs à l'utilisateur 'Admin'. Cela n'affecte bien sûr pas ses permissions car elles sont illimitées, mais le premier groupe répertorié est par défaut le groupe propriétaire des pages nouvellement créées. Les utilisateurs 'Admin' sont facilement reconnus car ils apparaissent avec une icône rouge au lieu de l'icône utilisateur bleue ordinaire. Vous ne devriez probablement pas assigner d'autres utilisateurs que vous en tant qu'utilisateur 'Admin'.
it: L'utente 'Admin' può fare tutto ciò che TYPO3 permette e questo tipo di utente dovrebbe essere utilizzato solo per scopi di amministrazione. Tutte le attività quotidiane dovrebbero essere effettuate con utenti ordinari. Gli utenti 'Admin' non hanno bisogno di essere membri di alcun gruppo di utenti di backend. Tuttavia, si dovrebbe essere consapevoli che qualsiasi nuova pagina creata da un utente amministratore senza un gruppo, non avrà alcun gruppo assegnato e quindi sarà, probabilmente, invisibile agli altri utenti ordinari. Se questo diventa un problema puoi facilmente risolverlo assegnando un gruppo all'utente 'Admin'. Questo naturalmente non influisce sui permessi, in quanto sono illimitati, ma il primo gruppo elencato sarà il gruppo delle nuove pagine create. Gli utenti 'Admin' sono facilmente riconoscibili perché hanno un'icona rossa, invece dell'icona blu dell'utente ordinario. Probabilmente non dovresti assegnare altri utenti, se non te, come utente 'Amministratore'.

# options.description
source: Select if the user should inherit page tree or folder tree mountpoints from member groups.
ar: حدد ما إذا كان يجب على المُستخدم أن يرِث صفحة شجرة أو مجلدات نطاقات الشجرة من مجموعات الأعضاء.
fr: Sélectionnez si l'utilisateur doit hériter des points de montage BDD ou de dossiers depuis ses groupes.
it: Spunta queste opzioni se l'utente deve ereditare l'Albero delle Pagine e/o l'Albero delle Cartelle dai gruppi utenti.

# options.details
source: It's a great advantage to let users inherit mountpoints from membergroups because it makes administration of the same mountpoints for many users extremely easy. If you don't check these options, you must make sure the mount points for the page tree and file folder tree is set specifically for the user.
ar: إنها ميزة رائعة للسماح للمستخدمين بوراثة نقاط التوصيل (mountpoints) من المجموعات الأعضاء، لأنها تجعل إدارة نفس نقاط التحميل للعديد من المستخدمين أمرًا سهلاً للغاية. إذا لم تتحقق من هذه الخيارات، يجب أن تتأكد من تعيين نقاط التوصيل (mountpoints) لشجرة الصفحات وشجرة مجلد الملفات خصيصاً للمستخدم.
fr: C'est un grand avantage de laisser les utilisateurs hériter des points de montage des groupes de membres car cela rend extrêmement facile l'administration des mêmes points de montage pour de nombreux utilisateurs. Si vous ne cochez pas ces options, vous devez vous assurer que les points de montage pour l'arborescence des pages et l'arborescence des dossiers sont définis spécifiquement pour l'utilisateur.
it: È un vantaggio consentire agli utenti di ereditare nodi dell'Albero (Pagine / Cartelle) direttamente dai gruppi, perché rende l'amministrazione estremamente facile. Se non selezioni queste opzioni, è necessario che ti assicuri che i nodi dell'Albero (Pagine / Cartelle), necessari al corretto operato degli utenti di backend, siano impostati per ogni singolo utente.

# _options.seeAlso
source: be_users:db_mountpoints, be_users:file_mountpoints
ar: be_users:db_mountpoint be_users:file_mountpoint

# file_permissions.description
source: Select file operation permissions for the user.
ar: حدد أُذُونات أو صلاحيات عمليات الملف للمستخدم.
fr: Sélectionnez les permissions sur les manipulations de fichiers pour l'utilisateur.
it: Imposta i permessi delle operazioni su cartelle e file per l'utente.

# file_permissions.details
source: These settings relate to the functions found in the File>List module as well as general upload of files. <strong>Notice</strong> that backend user groups also have file operation permissions which automatically apply to the user if he's member of an accordant group. So if you want a group of users share identical file operation permissions, you should probably define them in a backend user group instead.
ar: هذه الإعدادات تتعلق بالوظائف الموجودة في الملف>وحدة القائمة بالإضافة إلى التحميل العام للملفات. <strong>إشعار</strong> أن مجموعات مستخدمي الواجهة الخلفية لديها أيضاً أُذُونات تشغيل الملفات التي تنطبق تلقائياً على المستخدم إذا كان عضواً في مجموعة متفقة. لذا إذا كنت ترغب في مشاركة مجموعة من المستخدمين أُذُونات عملية الملفات المتطابقة، ربما يجب تعريفها في مجموعة مستخدمي الواجهة الخلفية بدلاً من ذلك.
fr: Ces paramètres concernent les fonctions trouvées dans le module Fichier>Liste ainsi que le téléchargement général de fichiers. <strong>Remarquez</strong> que les groupes d'utilisateurs backend ont également des permissions d'opération de fichier qui s'appliquent automatiquement à l'utilisateur s'il est membre d'un groupe approprié. Donc, si vous voulez qu'un groupe d'utilisateurs partagent les mêmes permissions d'opération de fichiers, vous devriez à la place les ajouter à un groupe d'utilisateurs backend commun.
it: Queste impostazioni si riferiscono alle funzionalità trovate nel modulo "File>Lista File" così come il caricamento generale dei file. <strong>Nota</strong> che i gruppi di utenti di backend hanno anche i permessi di operazione di file che si applicano automaticamente all'utente se è membro di un gruppo. Quindi, se si desidera che un gruppo di utenti condivida i permessi per le operazioni su cartelle e file, si dovrebbe definirli in un gruppo utente di backend.

# fileoper_perms.description
source: Select file operation permissions for the user.
ar: حدد أُذُونات عمليات الملف للمستخدم.
fr: Sélectionnez les permissions d'opération de fichier pour l'utilisateur.
it: Imposta i permessi delle operazioni su cartelle e file per l'utente.

# fileoper_perms.details
source: These settings relate to the functions found in the File>List module as well as general upload of files. <strong>Notice</strong> that backend user groups also have file operation permissions which automatically apply to the user if he's member of an accordant group. So if you want a group of users share identical file operation permissions, you should probably define them in a backend user group instead.
ar: هذه الإعدادات تتعلق بالوظائف الموجودة في الملف>وحدة القائمة بالإضافة إلى التحميل العام للملفات. <strong>ملاحظة</strong> تحتوي مجموعات مُستخدمي الواجهة الخلفية أيضاً على أُذُونات تشغيل الملفات التي تنطبق تلقائياً على المستخدم إذا كان عُضواً في مجموعة مُتوافقة. لذلك إذا كنت تريد أن تشارك مجموعة من المستخدمين أُذُونات تشغيل ملف مُتطابقة، فمِن المُحتمل أن تُحددها في مجموعة مستخدمي الواجهة الخلفية بدلاً من ذلك.
fr: Ces paramètres concernent les fonctions trouvées dans le module Fichier>Liste ainsi que le téléchargement général de fichiers. <strong>Remarquez</strong> que les groupes d'utilisateurs backend ont également des permissions d'opération de fichier qui s'appliquent automatiquement à l'utilisateur s'il est membre d'un groupe approprié. Donc, si vous voulez qu'un ensemble d'utilisateurs partagent les mêmes permissions d'opération de fichiers, vous devriez probablement les associer à un groupe d'utilisateurs backend à la place.
it: Queste impostazioni si riferiscono alle funzionalità trovate nel modulo "File>Lista File" così come il caricamento generale dei file. <strong>Nota</strong> che i gruppi di utenti di backend hanno anche i permessi di operazione di file che si applicano automaticamente all'utente se è membro di un gruppo. Quindi, se si desidera che un gruppo di utenti condivida i permessi per le operazioni su cartelle e file, si dovrebbe definirli in un gruppo utente di backend.

# starttime.description
source: Enter the date from which the account is active.
ar: أدخل تاريخ تفعيل الحساب.
fr: Entrez la date à partir de laquelle le compte devient actif.
it: Inserisci la data a partire dalla quale l'account è attivo.

# endtime.description
source: Enter the date from which the account is disabled.
ar: أدخل تاريخ تعطيل الحساب.
fr: Entrez la date à partir de laquelle le compte devient inactif.
it: Inserisci la data a partire dalla quale l'account è disabilitato.

# lastlogin.description
source: This field shows the user's last log in date.
ar: يعرض هذا الحقل آخر سِجل للمستخدم بحسب التاريخ.
fr: Ce champ affiche la date de dernière connexion de l'utilisateur.
it: Questo campo mostra l'ultima data di login dell'utente.

# lang.description
source: Select the <i>default</i> language.
ar: حدد لغة <i>الإفتراضية</i>.
fr: Sélectionnez la langue par <em>défaut</em>
it: Seleziona la lingua <i>predefinita</i>.

# lang.details
source: This determines the language of the backend interface for the user. All mainstream parts available for regular users are available in the system language selected. 'Admin'-users however will experience that the 'Admin'-only parts of TYPO3 is in english. This includes all submodules in "Tools" and the Web>Template module. <b>Notice</b> this is only setting the default language. As soon as the user has logged in the language must be changed through the User>Setup module. Also you will have to install the corresponding language pack which can be found as an extension on TYPO3.org with the prefix "csh_XX" where XX is the TYPO3 language key.
ar: يحدد هذا الخيار لُغة الواجهة الخلفية للمستخدم. تتوفر جميع الأقسام المُتاحة للمستخدمين العاديين بلغة النظام المُحددة. سوف تُلاحظ أن الأقسام المُتاحة للـ "المشرف" فقط من TYPO3 ستكون باللغة الإنكليزية. وهذا يشمل جميع الوحدات الفرعية في "الأدوات" ووحدة قالب>الويب. <b>مُلاحظة</b> هذا فقط تعيين اللغة الإفتراضية. بمُجرّد أن يقوم المستخدم بتسجيل الدخول، يجب عليه تغيير اللغة من خلال>وحدة الإعدادات. أيضاً، سَيَتعينُ عليك تثبيت حزمة اللغة المقابلة التي يمكن العثور عليها كامتداد على TYPO3.org بالبادئة "csh_XX" حيث XX هو مفتاح لغة TYPO3 المطلوبة.
fr: Ceci détermine la langue de l'interface d'administration pour l'utilisateur. Toutes les parties accessibles aux utilisateurs standards sont disponibles dans la langue système sélectionnée. Les utilisateurs 'Admin' cependant verront que les parties 'Admin' de TYPO3 sont en anglais. Ceci inclut tous les sous-modules dans "Outils" et le module Web>Gabarits. <b>Avis</b> ceci n'est que la langue par défaut. Dès que l'utilisateur est connecté, la langue doit être changée via le module Utilisateur>Paramètres. Vous devrez également installer le pack de langue correspondant qui peut être trouvé sous la forme d'une extension sur TYPO3.org avec le préfixe "csh_XX" où XX est la clé de langue TYPO3.
it: Definisce la lingua dell'interfaccia di backend per l'utente. Tutte le parti più ricorrenti sono disponibili nella lingua di sistema selezionata. Le parti a solo accesso Admin sono solo in inglese. Questo include tutti i moduli dell'Install Tools in "Strumenti Admin". <b>Nota</b> che prima di poter impostare la lingua per il backend, deve essere installata. Le lingue sono gestite dal modulo "Manutenzione>Manage Language Pack". La lingua del backend, per il singolo utente, è modificabile dal modulo "Impostazioni Utente".

# userMods.description
source: Select available backend modules for the user.
ar: حدد وُحدات الواجهة الخلفية المُتاحة للمستخدم.
fr: Choisissez les modules backend disponibles pour cet utilisateur.
it: Selezionare i moduli di backend disponibili per l'utente.

# userMods.details
source: This determines which 'menu items' are available for the user in the backend. Notice that the same list of modules may be configured for the backend user groups and that these will be inherited by the user in addition to the modules you select here. It's highly likely that you should not set any modules for the user himself but rather select the modules in the backend groups he's a member of. However this list provides a great way to add a single module for specific users.
ar: يحدد هذا "عناصر القائمة" المُتاحة للمستخدم في الواجهة الخلفية. لاحظ أنه قد يتم تكوين نفس قائمة الوحدات النمطية لمجموعات مستخدمي الواجهة الخلفية، وأن المستخدم سيرث هذه المجموعات بالإضافة إلى الوحدات التي تحددها هنا. من المحتمل جداً أنه لا يجب عليك تعيين أي وحدات للمستخدم نفسه، بل عليك تحديد الوحدات في مجموعات الواجهة الخلفية التي ينتمي إليها. ومع ذلك، توفر هذه القائمة طريقة رائعة لإضافة وحدة واحدة لمستخدمين محددين.
fr: Ceci détermine quels « liens de menu » sont disponibles pour l'utilisateur dans le backend. Notez que la même liste de modules peut être configurée pour les groupes d'utilisateurs backend et que ceux-ci seront hérités par l'utilisateur en plus des modules que vous sélectionnez ici. Il est très probable que vous ne définissiez aucun module pour l'utilisateur lui-même, mais que vous sélectionniez plutôt les modules du backend dont il est membre. Cependant, cette liste fournit un excellent moyen d'ajouter un module unique pour des utilisateurs spécifiques.
it: Definisce quali 'voci di menù' sono disponibili per l'utente nel backend. Notare che la stessa lista di moduli può essere configurata per i gruppi utente di backend e che questi saranno ereditati dall'utente in aggiunta ai moduli che selezioni qui. È molto probabile che tu non debba impostare alcun modulo qui, ma piuttosto selezionare i moduli nei gruppi di cui è membro. Tuttavia questo elenco offre un ottimo modo per aggiungere un singolo modulo per utenti specifici.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
ar: أدخل TSconfig إضافية للمستخدم (المتقدم).
fr: Entrez un TSconfig additionnel pour l'utilisateur (avancé).
it: Inserisci TSconfig aggiuntivo per l'utente (avanzato).

# TSconfig.details
source: This field allows you to extend the configuration of the user in severe details. A brief summary of the options include a more detailed configuration of the backend modules, setting of user specific default table field values, setting of Rich Text Editor options etc.
ar: يسمح لك هذا الحقل بتوسيع إعدادات المستخدم بتفاصيل دقيقة. يتضمن مُلخصاً مُوجزاً للخيارات تكويناً أكثر تفصيلاً لوحدات الواجهة الخلفية، وإعداد قيم حقل الجدول الافتراضي الخاصة بالمستخدم، وإعداد خيارات محرر النص المتن، إلخ.
fr: Ce champ vous permet d'étendre la configuration de l'utilisateur en détail. Un bref résumé des options inclut une configuration plus détaillée des modules d'arrière-plan, paramétrage des valeurs de champs de table par défaut spécifiques à l'utilisateur, paramétrage des options de l'éditeur de texte riche, etc.
it: Questo campo consente di estendere la configurazione dell'utente in dettaglio. Una configurazione più dettagliata dei moduli del backend, l'impostazione dei valori predefiniti dei campi di una tabella specifica per l'utente, l'impostazione delle opzioni RTE e così via. È richiesta competenza avanzata.

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
ar: حدد لغات التسجيل التي يقتصر تحريرها على أعضاء المجموعة.
fr: Choisissez les langues pour lesquelles le groupe à les droits d'éditions.
it: Seleziona a quali lingue i membri del gruppo sono limitati nella modifica.

# allowed_languages.details
source: You can also limit users to specific languages with user group settings. Please see the same field for backend user groups for more details.
ar: يمكنك أيضاً تقييد المستخدمين بلغات معينة من خلال إعدادات مجموعة المستخدمين. يرجى الاطلاع على نفس الحقل لمجموعات المستخدمين الخلفية لمزيد من التفاصيل.
fr: Vous pouvez également limiter les utilisateurs à des langues spécifiques avec les paramètres de groupe d'utilisateurs. Veuillez consulter le même champ pour les groupes d'utilisateurs backend pour plus de détails.
it: Puoi limitare gli utenti a lingue specifiche con le impostazioni del gruppo. Vedi lo stesso campo per i gruppi utenti di backend per maggiori dettagli.
