Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_pages.xlf
Languages: ar, it

# subtitle.details
source: Whether this field is used or not depends on the template. In most cases it's not used.
ar: إذا كان هذا الحقل يستخدم أم لا يعتمد على القالب. في معظم الحالات لا يستخدم.
it: L'utilizzo di questo valore, nel sito web, dipende dal Template TypoScript o anche da qualche plugin, che preveda l'utilizzo di questo campo, inserito nella pagina.

# url.description
source: Enter the URL this page redirects to.
ar: أدخل عنوان URL هذه الصفحة إعادة توجيهه.
it: Inserisci l'URL a cui questa pagina reindirizza.

# url.details
source: For example, 'http://www.typo3.org'. This option is used only if the page 'Type' is set to 'Link to External URL.'
ar: على سبيل المثال، 'http://www.typo3.org'. يُستخدم هذا الخِيار فقط إذا تم تعيين الصفحة 'Type' إلى 'رابط إلى عنوان URL الخارجي'
it: Per esempio 'http://www.typo3.org'. Questa opzione viene usata solo se il tipo di pagina scelto è 'Collegamento a URL Esterno'.

# shortcut.description
source: Select a page to act as the Shortcut Target. When the current page is requested in the Frontend, it will be redirected to the Shortcut Target.
ar: حدد صفحة لتكون هدف الاختصار. عندما تكون الصفحة الحالية مطلوبة في الجبهة سوف يعاد توجيهها إلى هدف الاختصار.
it: Seleziona una pagina per definire la destinazione della scorciatoia. Quando la pagina corrente è richiesta nel frontend, verrà reindirizzata alla destinazione.

# shortcut.details
source: Click the 'Browse for Records' icon and a new window will appear in which you can easily select a page to act as the Shortcut Target. This option is used only if the page 'Type' is set to 'Shortcut.'
ar: انقر فوق أيقونة "تصفح للتسجيلات" وستظهر نافذة جديدة حيث يمكنك بسهولة اختيار صفحة لتكون هدف الاختصار. يتم استخدام هذا الخِيار فقط إذا تم تعيين الصفحة 'Type' إلى 'اختصار.'
it: Fai clic sull'icona 'Sfoglia record' per visualizzare una finestra in cui è possibile selezionare facilmente una pagina per definire la destinazione della scorciatoia. Questa opzione è usata solo se il 'Tipo' della pagina è 'Scorciatoia'.

# shortcut.image_descr
source: Select a Shortcut Target page with the Element Browser.
ar: حدد صفحة هدف الاختصار مع مستعرض العناصر.
it: Seleziona una pagina di destinazione della Scorciatoia con il "Selettore record".

# keywords.description
source: Enter keywords for the page separated by commas. You may also use short phrases.
ar: أدخل الكلمات الرئيسية للصفحة مفصولة بفواصل. يمكنك أيضا استخدام عبارات قصيرة.
it: Inserisci le parole chiave (keywords) per la pagina, separate da virgola. È possibile utilizzare anche brevi frasi.

# keywords.details
source: Most TYPO3 websites use these keywords in a meta-tag on the page, but you may have to setup the appropriate TypoScript template yourself. To optimize your page for search engines like Google you should not use more than 3 to 6 keywords. You should also make sure that the keywords are found in the content of the page. Note that search engine extensions for TYPO3 such as Indexed Search can also be configured to make use of the keywords. The keywords can also be used to create a menu of related pages. Create a Content Element of type 'Sitemap' and then choose the menu type <i>Related pages (based on keywords)</i>.
ar: معظم مواقع TYPO3 تستخدم هذه الكلمات الرئيسية في علامة التعريف على الصفحة، ولكن قد تضطر إلى إعداد قالب TypoScript المناسب بنفسك. لتحسين صفحتك لمحركات البحث مثل غوغل لا يجب عليك استخدام أكثر من 3 إلى 6 كلمات مفتاحية. يجب عليك أيضاً التأكد من أن الكلمات الرئيسية موجودة في محتوى الصفحة. لاحظ أن إضافات محرك البحث لـ TYPO3 مثل البحث المفهرس يمكن أيضاً تكوينها لاستخدام الكلمات الرئيسية. يمكن استخدام الكلمات الرئيسية أيضاً لإنشاء قائمة من الصفحات ذات الصلة. قم بإنشاء عنصر محتوى من نوع 'sitemap' ثم اختر نوع القائمة <i>الصفحات ذات الصلة (استنادًا إلى الكلمات الرئيسية)</i>.
it: La maggior parte dei siti web TYPO3 usa queste parole chiave in una meta-tag della pagina, ma potresti dover configurare tu stesso il Template TypoScript appropriato. Per ottimizzare la tua pagina per i motori di ricerca, come Google, dovresti usare da 3 a 6 parole chiave. Devi anche assicurarti che le parole chiave si trovino nel contenuto della pagina. Nota che le estensioni, per TYPO3, per il motore di ricerca, come la ricerca indicizzata, possono essere configurate per fare uso delle parole chiave. Le parole chiave possono essere usate anche per creare un menù di pagine correlate: crea un Elemento di Contenuto di tipo <i>Pagine correlate</i>.

# description.description
source: Enter a short description of the page. It will be displayed in the result lists of most search engines.
ar: أدخل وصفاً موجزاً للصفحة. سيتم عرضه في قوائم النتائج لمعظم محركات البحث.
it: Inserisci una breve descrizione della pagina. Verrà visualizzata nella lista dei risultati della maggior parte dei motori di ricerca.

# description.details
source: Most websites insert this description in a meta-tag on the page, but you may have to configure this yourself in your TypoScript template. Most search engines will display the description in their result list. Thus, the text should be short (about 160 characters maximum), and its wording should make sense when it shows up in the result list. In addition, the description will be displayed if you create a Content Element of type 'Sitemap' and then choose the menu type <i>Menu of subpages to these pages (with abstract)</i>. If an abstract exists for the page, it will be used instead of the description. <b>Note:</b> Some search engines only use the description if the text is not found elsewhere in the content. So do not just repeat yourself.
ar: تدرج معظم مواقع الويب هذا الوصف في علامة التعريف على الصفحة، ولكن قد تضطر إلى تكوين هذا بنفسك في قالب TypoScript الخاص بك. ستعرض معظم محركات البحث الوصف في قائمة نتائجها. وعلى هذا، ينبغي أن يكون النص قصيراً (حوالي 160 حرفا كحد أقصى)، وينبغي أن تكون صياغته منطقية عندما تظهر في قائمة النتائج. إضافة إلى ذلك، سيتم عرض الوصف إذا قمت بإنشاء عنصر محتوى من نوع 'sitemap' ثم قم باختيار نوع القائمة <i>قائمة للصفحات الفرعية إلى هذه الصفحات (مع تجريد)</i>. إذا كان هناك خلاصة للصفحة، فسيتم استخدامها بدلاً من الوصف. <b>ملاحظة:</b> لا تستخدم بعض محركات البحث الوصف إلا إذا كان النص غير موجود في مكان آخر من المحتوى. لا تكتفي بتكرار نفسك.
it: La maggior parte dei siti web inserisce questa descrizione in un meta-tag della pagina, ma potrebbe essere necessario configurare questo via Template TypoScript. La maggior parte dei motori di ricerca mostrerà la descrizione nella loro lista dei risultati. Pertanto, il testo dovrebbe essere corto (circa 160 caratteri al massimo) e la sua formulazione dovrebbe avere senso quando compare nell'elenco dei risultati. <b>Nota:</b> alcuni motori di ricerca usano la descrizione solo se il testo non è trovato altrove nel contenuto. Quindi non ripeterti soltanto.

# abstract.description
source: Enter an abstract of the contents. It may be displayed in an overview of articles.
ar: أدخل وصفاً مُختصراً عن المحتويات. يمكن عرضها على شكل نظْرة عامة على المقالات.
it: Inserisci un abstract dei contenuti. Potrà essere visualizzato in una anteprima degli articoli. Usato anche nell'Elemento di Contenuto di tipo "Abstract".

# abstract.details
source: An abstract is a short description of the page content that might be a little longer than the one in the <i>Description</i> field. Unlike the description, the abstract is not meant for display in search engine result lists, but is instead intended for you own use. If you create a Content Element of type <i>Sitemap</i> and then choose <i>Menu of subpages to these pages (with abstract)</i> an overview of pages will be created. If an abstract is available for a page it will be used instead of the description. <b>Note:</b> You do not have to enter the text of the description into the <i>Abstract field</i> again. Admins can also make custom use of this field via their TypoScript templates.
ar: المُلخّص: هو وصف قصير لمحتوى الصفحة التي قد تكون أطول قليلا من المحتوى الموجود في حقل <i>الوصف</i> خلافاً للوصف، فإن الخلاصة ليست مخصصة للعرض في قوائم نتائج محرك البحث، ولكنها مخصصة بدلاً من ذلك للاستخدام الخاص. إذا قمت بإنشاء عنصر محتوى من نوع <i>خريطة الموقع</i> ثم اختر <i>قائمة للصفحات الفرعية لهذه الصفحات (مع خلاصة)</i> سيتم إنشاء نظرة عامة للصفحات. إذا كانت الخلاصة متاحة لصفحة ما، فسيتم استخدامها بدلاً من الوصف. <b>ملاحظة:</b> ليس عليك إدخال نص الوصف في <i>حقل الخلاصة</i> مرة أخرى. يمكن للمشرفين أيضاً استخدام هذا الحقل بشكل مخصص من خلال قوالب TypoScript الخاصة بهم.
it: Un abstract è una breve descrizione del contenuto della pagina che potrebbe essere leggermente più lungo di quello nel campo <i>Descrizione</i>. Al contrario della descrizione, l'abstract non è pensato per essere utilizzato dall'elenco dei risultati dei motori di ricerca, ma è destinato per uso personale. Se crei un Elemento di Contenuto di tipo <i>Abstract</i>, verrà creata un'anteprima dei contenuti utilizzando il testo del campo Abstract, se disponibile. <b>Nota:</b> non devi inserire di nuovo il testo della descrizione anche nel <i>campo Abstract</i>. Gli Amministratori possono fare un uso personalizzato di questo campo nei loro Template TypoScript.

# newUntil.description
source: Enter the date at which this page is no longer considered new.
ar: أدخل التاريخ الذي لم تعد فيه هذه الصفحة تعتبر جديدة.
it: Inserisci la data a partire dalla quale la pagina non sarà più considerata come 'nuova'.

# newUntil.details
source: The 'New Until' date of the page has no effect on the display of the webpage. This value is instead for internal use as a reminder of the date when the content of this page should be revised. If the content of the page will become outdated on a certain day, you could set this value to that approximate date. To get an overview of when pages will be outdated, use the 'Pagetree overview' in the 'Web>Info' Module.
ar: التاريخ "جديد حتى" للصفحة ليس له أي تأثير على عرض صفحة الويب. هذه القيمة بدلاً من ذلك للاستخدام الداخلي كتذكير بالتاريخ الذي يجب فيه تنقيح محتوى هذه الصفحة. إذا كان محتوى الصفحة سيصبح قديماً في يوم معين، يمكنك تعيين هذه القيمة إلى ذلك التاريخ التقريبي. للحصول على نظرة عامة عن الوقت الذي ستكون فيه الصفحات قديمة، استخدم 'نظرة عامة للصفحة' في وحدة 'Web>Info'.
it: La data "Considera come 'Nuovo' Fino al" della pagina non ha effetto sulla visualizzazione della pagina web. Questo valore è invece per uso interno come promemoria della data in cui il contenuto di questa pagina dovrebbe essere rivisto. Se il contenuto della pagina diventerà obsoleto in un certo giorno, è possibile impostare questo valore a quella data approssimativa. Per avere una panoramica di quando le pagine saranno obsolete, usa la panoramica 'Panoramica Albero delle Pagine' nel modulo 'Web>Info'.

# newUntil.syntax
source: See Page / Publication Date (click below)
ar: انظر الصفحة / تاريخ النشر (انقر أدناه)
it: Vedi Pagina / Data di Pubblicazione (clicca sotto)

# lastUpdated.description
source: Enter the date and time of the most recent update to this page.
ar: أدخل تاريخ ووقت أحدث تحديث لهذه الصفحة.
it: Inserisci la data e l'ora dell'aggiornamento più recente a questa pagina.

# lastUpdated.details
source: How the value of this field is used is determined by the TypoScript template of the website. 'Last Update' content needs to be inserted on the pages and the TypoScript template must be configured to use this value. The most common use is to display the date from the automatically updated 'tstamp' field <em>unless</em> the 'Last Update' field is set. In this case, the date in 'Last Update' is used.
ar: كيفية استخدام هذا الحقل يتم تحديده بواسطة قالب TypoScript للموقع. يجب إدراج محتوى "آخر تحديث" في الصفحات ويجب تكوين قالب TypoScript لاستخدام هذه القيمة. الاستخدام الأكثر شيوعاً هو عرض التاريخ من الحقل 'tstamp' المحدث تلقائياً <em>إلا إذا</em> تم تعيين الحقل 'أخر تحديث'. في هذه الحالة، يستخدم التاريخ في "آخر تحديث".
it: Il modo in cui viene utilizzato il valore di questo campo è determinato dal Template TypoScript. Il contenuto 'Ultimo Aggiornamento' deve essere inserito nelle pagine e il Template TypoScript deve essere configurato per utilizzare questo valore. L'uso più comune è quello di visualizzare la data dal campo "tstamp" aggiornato automaticamente <em>a meno che</em> il campo 'Ultimo Aggiornamento' sia impostato. In questo caso, viene utilizzata la data in 'Ultimo Aggiornamento'.

# lastUpdated.syntax
source: The format is HH:MM DD-MM-YYYY or HH:MM MM-DD-YYYY depending on your TYPO3 configuration. If you insert a 'd' the current time and date is inserted. You can also append any value in the field with a number lie '+10' which will add 10 days to the current value.
ar: التنسيق HH:MM DD-MM-YYYY أو HH:MM-DD-YYYY يعتمد على تكوين TYPO3 الخاص بك. إذا قمت بإدراج 'd' يتم إدخال الوقت الحالي والتاريخ الحالي. يمكنك أيضاً إلحاق أي قيمة في الحقل مع رَقَم '+10' الذي سيضيف 10 أيام إلى القيمة الحالية.
it: Il formato è HH:MM DD-MM-YYYY oppure HH:MM MM-DD-YYYY a seconda della tua configurazione di TYPO3. Inserendo 'd' viene inserita la data e ora corrente. È possibile aggiungere un numero, alla fine di qualsiasi valore del campo, come ad esempio '+10', che aggiunge 10 giorni al valore corrente.

# nav_hide.description
source: With this option the page will appear in menus in the Frontend. If unchecked, the page can still be viewed if linked by going directly to its URL.
ar: مع هذا الخيار، لن تظهر الصفحة في القوائم في الواجهة الأمامية. لا يزال من الممكن عرض الصفحة إذا تم ربطها مباشرة بالرجوع إلى عنوان URL الخاص بها.
it: Con quest'opzione la pagina comparirà nei menù di Frontend. Se non selezionata, la pagina sarà visualizzabile se collegata direttamente con il suo URL.

# nav_title.description
source: Alternative Navigation Title for menu items in the Frontend. When set, this value is used instead of the Page Title.
ar: عنوان التصفّح البديل لعناصر القائمة في الواجهة الأمامية. عند التعيين، يتم استخدام هذه القيمة بدلاً من عنوان الصفحة.
it: Titolo di navigazione alternativo per le voci di menù nel frontend. Se impostato, viene utilizzato al posto del Titolo della Pagina.

# content_from_pid.description
source: If set, this is an alternative page to select Content Elements from. Whether this field is used depends on the website's TypoScript template.
ar: في حالة الضبط، هذه صفحة بديلة لتحديد عناصر المحتوى منها. ما إذا كان هذا الحقل يستخدم يعتمد على قالب TypoScript للموقع.
it: Se impostata, questa è una pagina alternativa da cui selezionare gli elementi di contenuto. L'utilizzo di questo campo dipende dal Template TypoScript.

# shortcut_mode.description
source: Select a Shortcut Mode. By default the shortcut page must have a Shortcut Target to jump to. Other options are to go to the first subpage, to a random subpage, or back up to the parent page.
ar: حدد وضع الاختصار. بشكل افتراضي يجب أن يكون لصفحة الاختصار هدف الاختصار للقفز إليه. الخيارات الأخرى هي الذَّهاب إلى الصفحة الفرعية الأولى، أو صفحة فرعية عشوائية، أو العودة إلى الصفحة الأصلية.
it: Seleziona una modalità di scorciatoia. La pagina 'Scorciatoia' deve avere una destinazione a cui saltare. Altre opzioni sono di andare alla prima sottopagina, a una sottopagina casuale o tornare alla pagina 'padre'.

# mount_pid.description
source: Mount this page. If set, subpages of this page come from the Mounted Page instead.
ar: قم ببناء هذه الصفحة. في حالة الضبط، الصفحات الفرعية من هذه الصفحة تأتي من صفحة متقطعة بدلاً من ذلك.
it: Monta la pagina selezionata. Se impostata, le sottopagine, di questa pagina, saranno quelle della pagina montata.

# mount_pid.details
source: In the Frontend this is done by adding a new variable, &MP, to the URL. This links the mounted branch to the main branch by pairing page ids.
ar: يتم القيام بذلك في الواجهة الأمامية بإضافة متغير جديد، &، إلى عنوان URL. هذا يربط الفرع المثبت بالفرع الرئيس عن طريق إقران معارف الصفحة.
it: Nella Frontend questo viene fatto aggiungendo una nuova variabile, &MP, alla URL. Questo collega il ramo montato al ramo principale associando gli id della pagina.

# mount_pid_ol.description
source: Show content for the current page or replace it completely with the Mounted Page.
ar: إظهار المحتوى للصفحة الحالية أو استبداله بالكامل بالصفحة المبنية.
it: Mostra il contenuto della pagina corrente o lo sostituisce completamente con la Pagina Montata.

# title.description.+
source: This is normally shown in the website navigation.
ar: ويظهر هذا عادةً في تصفح الموقع.
it: Utilizzato, normalmente, nella navigazione del sito web, ossia nei menù del sito web.

# TSconfig.details.+
source: <strong>Example:</strong> The 'Web>Page' module lets you create content in four columns, Left, Normal, Right, Border if the template has been configured to use this option. (However, most websites use only one or two columns so some of these content columns are just taking up space and confusing users.) If you enter this string in the 'TSConfig' field, the 'Web>Page' Module will only show the 'Normal' and 'Border' column! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Must be entered in a single line!)
ar: <strong>مثال:</strong> تتيح لك وحدة 'Web>Page' إنشاء محتوى في أربعة أعمدة، يسار، عادي، يمين، حدد إذا تمت تهيئة النموذج لاستخدام هذا الخِيار. (ومع ذلك، فإن معظم مواقع الويب تستخدم عمودًا واحدًا أو عمودين فقط، لذا فإن بعض أعمدة المحتوى هذه تشغل مساحة وتسبب إرباكًا للمستخدمين.) إذا أدخلت هذه السلسلة في الحقل "TSConfig"، فإن الوحدة النمطية 'Web>Page' ستعرض فقط العمود "عادي" و "الحدود"! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (يجب إدخاله في سطر واحد!)
it: <strong>Esempio</strong> Il modulo 'Web>Pagina' ti permette di posizionare i contenuti su più colonne, previa creazione di un record "Layout di Backend", da assegnare ad una Pagina, con il campo "Aspetto::Layout di Backend". Supponiamo che il record "Layout di Backend" preveda 3 colonne; Sinistra (1), Centro (0) e Destra (2). Se inserisci questa stringa nel campo TSConfig di Pagina, il modulo 'Web>Pagina' mostrerà solo le colonne Sinistra e Centro! <em>mod.SHARED.colPos_list = 0,1</em> Deve essere inserito in una singola riga!

# l18n_cfg.description
source: Affect availability of pages in the various languages.
ar: يؤثر ذلك على توافر الصفحات بمختلف اللغات.
it: Influenza la disponibilità delle pagine nelle varie lingue

# l18n_cfg.details
source: <b>Hide default language of page</b> If set, the page is only available in translated versions and not in the default language. Any attempt to access the page in the default language will result in an error message. <b>Hide page if no translation for current language exists</b> If set, any attempt to access the page in a translation that does not exist will result in an error message. By default, accessing an untranslated page will just show the default language instead.
ar: <b>إخفاء اللغة الافتراضية للصفحة</b> إذا تم تعيينها. الصفحة متاحة فقط في النسخ المُترجمة وليس في اللغة الافتراضية. أي محاولة للوصول إلى الصفحة باللغة الافتراضية ستؤدي إلى رسالة خطأ. <b>إخفاء الصفحة إذا لم توجد تَرْجَمَة للغة الحالية</b> إذا تم تعيينها، أي محاولة للوصول إلى الصفحة في تَرْجَمَة غير موجودة ستؤدي إلى رسالة خطأ. بشكل افتراضي، الوصول إلى صفحة غير مترجمة سيظهر فقط اللغة الافتراضية بدلا من ذلك.
it: <b>Nascondi la lingua predefinita della pagina</b> Se impostata, la pagina è disponibile solo nelle versioni tradotte e non nella lingua predefinita. Qualsiasi tentativo di accedere alla pagina nella lingua predefinita comporterà un messaggio di errore. <b>Nascondi la pagina se non esiste la traduzione per la lingua corrente</b> Se impostata, qualsiasi tentativo di accedere alla pagina in una traduzione che non esiste, risulterà in un messaggio di errore. Per impostazione predefinita, l'accesso a una pagina non tradotta mostra la lingua predefinita.
