Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_pages.xlf
Languages: ar, it

# layout.description
source: The Frontend Layout can change the way a page design appears.
ar: شكل الواجهة الأمامية يمكن أن يغير الطريقة التي تظهر بها تصميم الصفحة.
it: Il Layout di Frontend può cambiare l'aspetto di una pagina.

# layout.details
source: This option may not have any impact on the Frontend page design since it depends on whether the Frontend template uses it. Most templates do not use it.
ar: قد لا يكون لهذا الخِيار أي تأثير على تصميم صفحة الواجهة الأمامية، لأنه يعتمد على ما إذا كان قالب الواجهة الامامية يستخدمه أم لا. معظم القوالب لا تستخدمه.
it: Questa opzione potrebbe non avere alcun impatto sull'aspetto della pagina di Frontend in quanto dipende dal fatto che il template di Frontend lo utilizzi. La maggior parte dei template non lo utilizza.

# doktype.description
source: Page Type determines whether the page is normal webpage, a shortcut to another webpage, or used in other internal ways.
ar: نوع الصفحة يحدد ما إذا كانت الصفحة صفحة ويب عادية، أو اختصار لصفحة ويب أخرى، أو مُستخدمة بطرق داخلية أخرى.
it: Il "Tipo" della Pagina determina il "comportamento" della pagina stessa: una normale pagina web, un collegamento ad una pagina web esterna o un collegamento ad una pagina interna.

# doktype.details
source: 'Standard' is the most common Page Type and is used for normal webpages. 'Backend User Section' is an option which creates pages that are only visible in the Frontend for Backend users who are logged in. <b>Link</b> 'Shortcut' pages jump to another page in the Pagetree. 'Mount Point' pages bring content from another branch of the Pagetree into the current branch. 'Link to External URL' is similar to 'Shortcut' but points to external URLs instead of TYPO3 pages. <b>Special</b> 'Folder' is a page type which is not shown as a webpage but is instead stores records of your choice. 'Recycler' is a garbage can. Pages and records in the Recycler are not visible in the Frontend. 'Menu Separator' is only useful if your Frontend menus are programmed to use it. It does not represent a page with content but is intended to be an unclickable placeholder in the menu. <b>Notice</b> Each Page Type is represented by a unique icon. The available page types can be restricted for users so all of the options described above may not be visible. Finally, particular record types may only be allowed on certain page types, but any record can be placed in a 'Folder.'
ar: 'قياسي' هو نوع الصفحة الأكثر شيوعاً ويستخدم لصفحات الويب العادية. 'قسم مستخدم الواجهة الخلفية' هو خيار ينشئ صفحات مرئية فقط في الواجهة الأمامية لمستخدمي الواجهة الخلفية الذين تم تسجيل دخولهم. <b>الرابط</b> صفحات "اختصار" تعيد التوجيه إلى صفحة أخرى في شجرة الصفحات. صفحات "Mount Point" تجلب محتوى من فرع آخر من فروع شجرة الصفحات إلى الفرع الحالي. 'رابط إلى عنوان URL الخارجي' مماثل لصفحات 'الاختصار' ولكن يشير إلى عناوين URL خارجية بدلاً من صفحات TYPO3. <b>مميز </b> 'مجلد' هو نوع صفحة لا تظهر كصفحة ويب ولكنه يقوم بتخزين السجلات التي تختارها. "إعادة التدوير" هي عبارة عن سلة مهملات. ستصبح الصفحات والسجلات في "إعادة التدوير" غير موجودة في الواجهة الأمامية. "فاصل القائمة" مفيد فقط إذا كانت مذكرة الواجهة الخاصة بك مبرمجة لاستخدامها. لا يمثل صفحة ذات محتوى ولكن القصد منه أن يكون نائب غير قابل للنقر في القائمة. <b>إشعار</b> كل نوع صفحة ممثلة برمز فريد. يمكن تقييد أنواع الصفحات المتاحة للمستخدمين حتى لا تكون جميع الخيارات الوارد وصفها أعلاه ظاهرة. وأخيرا، يمكن السماح للسجل الخاص فقط على أنواع معينة من الصفحات، ولكن يمكن وضع أي سجل في 'مجلد.'
it: <b>Pagina</b> 'Standard' è il tipo di Pagina più comune ed è utilizzato per le pagine web normali. 'Sezione Utente di Backend' è un'opzione che crea pagine visibili dal Frontend solo per gli utenti backend che hanno effettuato l'accesso. <b>Collegamento</b> 'Scorciatoia' consente di saltare a un'altra pagina nell'albero delle pagine. Le pagine 'Punto di Montaggio' portano il contenuto di un altro ramo, dell'albero delle pagine, nel ramo corrente. 'Collegamento a URL Esterno' è simile a 'Scorciatoia', ma punta a URL esterni invece che a pagine TYPO3. <b>Speciale</b> 'Cartella' è un tipo di pagina che non è mostrata nel sito web, ma ha la funzione di memorizzare record a tua scelta. 'Cestino' è un contenitore di elementi eliminati. Pagine e record nel Cestino non sono visibili nel Frontend. 'Separatore Menù' è utile solo se i tuoi menù di Frontend sono programmati per usarli. Non rappresenta una pagina con contenuto, ma è inteso come un segnaposto grafico, non cliccabile, nel menù. <b>Nota</b> che ogni tipo di pagina è rappresentato da un'icona unica. I tipi di pagina disponibili possono essere limitati per gli utenti: tutte le opzioni sopra descritte potrebbero non essere visibili. Infine, alcuni tipi di record possono essere creati solo su specifici tipi di pagina, ma qualsiasi record può essere creato in una 'Cartella'.

# hidden.description
source: If this is checked, the page will be visible on the website.
ar: إذا تم تحديد هذا الخِيار، سيتم تعطيل الصفحة على الموقع.
it: Se questo è selezionato, la pagina sarà disponibile nel fornire contenuti e dati. Per esempio, per una pagina Standard, i suoi contenuti saranno visibili nel frontend; per una pagina Cartella, invece, i record in essa contenuti saranno disponibili e utilizzabili dai Template TypoScript.

# hidden.details
source: The 'Disable,' 'Start,' 'Stop,' and 'Access' options are all about limiting access to pages and are thus related in functionality. When a page is not visible due to one of these options, the page will not show up in the site navigation. Notice, these options are related <em>only</em> to the page for which they are set. If you want their effect to cover the subpages as well, you must enable the 'Extend to Subpages' option. When you're logged in as a Backend user you can preview disabled pages if you have read access to them.
ar: الخيارات 'تعطيل،' 'بدء' 'إيقاف' و 'الوصول' كلها تتعلق بالحد من الوصول إلى الصفحات، وعلى هذا فهي مرتبطة بالوظائف. عندما تكون الصفحة غير مرئية بسبب أحد هذه الخيارات، لن تظهر الصفحة في التنقل في الموقع. تنبيه، هذه الخيارات مرتبطة <em></em> فقط بالصفحة التي تم تعيينها لها. إذا كنت تريد أن يغطي تأثيرها الصفحات الفرعية أيضاً، يجب عليك تفعيل خِيار 'توسيع إلى الصفحات الفرعية'. عند تسجيل الدخول كمستخدم في الواجهة الخلفية، يمكنك معاينة الصفحات المُعطلة إذا كان لديك حق الوصول إلى القراءة.
it: Le opzioni 'Abilitato', 'Data di Pubblicazione', 'Data di Scadenza', e 'Diritti di Accesso Gruppo' riguardano esclusivamente la limitazione dell'accesso alle pagine e sono quindi correlate nella funzionalità. Quando una pagina non è abilitata, a causa di una di queste opzioni, la pagina non verrà, ad esempio, visualizzata nella navigazione del sito oppure i record in essa presenti non saranno disponibili. Nota che queste opzioni sono correlate <em>solo</em> alla pagina per la quale sono impostate. Se vuoi che il loro effetto copra anche le sottopagine, devi abilitare l'opzione 'Estendi alle Sottopagine'. Quando sei nel Backend, puoi comunque accedere e visualizzare in anteprima le pagine disabilitate, se hai i permessi di lettura.

# hidden.image_descr
source: The page icon of a disabled page is dimmed and a red X is added. If you view a page that is hidden and you are logged in into the Backend you will still be able to see the page. The red "Preview" box will tell you that this page is visible to you because of this special circumstance.
ar: أيقونة الصفحة المُعطلة يتم تعديلها ويتم إضافة X. إذا عُرضت الصفحة المَخفية، و قمت بتسجيل الدخول إلى الواجهة الخلفية، فستبقى قادراً على رؤية الصفحة. مربع "المعاينة" الأحمر سوف يخبرك أن هذه الصفحة مرئية لك بسبب هذا الظرف الخاص.
it: L'icona di una pagina disabilitata è identificabile da una icona rossa. Se è presente una pagina nascosta e sei nel Backend, puoi comunque vedere la pagina. L'avviso di "Anteprima" ti dice che la pagina è visibile solo a te, in quanto amministratore del sito.

# starttime.description
source: The Publish Date determines when the page will be visible online. If the Publish Date is not set, the page will be available immediately.
ar: تاريخ النشر يُحدد متى ستكون الصفحة مرئية على الإنترنت. إذا لم يتم تعيين تاريخ النشر، ستكون الصفحة مُتاحة فوراً.
it: La Data di Pubblicazione determina quando la pagina sarà disponibile: ad esempio, i contenuti su una pagina Standard saranno visibili nel frontend. Se la Data di Pubblicazione non viene indicata, la pagina sarà disponibile immediatamente.

# starttime.syntax
source: The Publish Date Format is either DD-MM-YYYY or MM-DD-YYYY depending on how TYPO3 is configured. There are also several shortcuts you can use when entering the date. If you insert a 'd' the current date will be inserted. You can also append any value in the field with a number such as '+10' which will add 10 days to the current value. For example, entering 'd+10' would result in a date 10 days from now.
ar: تنسيق تاريخ النشر إما DD-MM-YYYY أو MM-DD-YYYY تبعاً لكيفية تكوين TYPO3. هناك أيضاً العديد من الاختصارات التي يمكنك استخدامها عند إدخال التاريخ. إذا إدراجت 'd' سيتم إدراج التاريخ الحالي. يمكنك أيضاً إلحاق أي قيمة في الحقل بعدد مثل '+10' الذي سيضيف 10 أيام إلى القيمة الحالية. على سبيل المثال، الدخول إلى 'd+10' سيؤدي إلى تاريخ 10 أيام من الْآنَ.
it: Il formato della Data di Pubblicazione può essere GG-MM-AAAA oppure MM-GG-AAAA: dipende da come è configurato TYPO3. Ci sono inoltre diverse comandi per inserire una data. Se inserisci una 'd' verrà inserita la data odierna. Puoi anche appendere un qualsiasi valore nel campo con un numero, come '+10': aggiungerà 10 giorni alla data odierna. Ad esempio, se inserisci 'd+10' il risultato sarà 10 giorni dalla data odierna.

# endtime.description
source: The Expiration Date specifies when the page will no longer be visible online.
ar: تاريخ انتهاء الصَّلاحِيَة يحدد متى لن تكون الصفحة مرئية على الإنترنت.
it: La Data di Scadenza specifica quando la pagina non sarà più disponibile.

# endtime.syntax
source: See Page / Publication Date (click below)
ar: انظر الصفحة / تاريخ النشر (انقر أدناه)
it: Vedi Pagina / Data di Pubblicazione (clicca sotto)

# fe_group.description
source: If Usergroup Access Rights is set to a usergroup name, only website users who are members of the selected usergroup will be able to view the page. The special option 'Hide at Login' means the page will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the page visible for any logged in Frontend user.
ar: إذا تم تعيين حقوق الوصول مجموعة المستخدم إلى اسم مجموعة المستخدم، فقط مستخدمي الموقع الذين هم أعضاء في مجموعة المستخدم المحددة سيكونون قادرين على عرض الصفحة. الخِيار الخاص 'إخفاء عند تسجيل الدخول' يعني أن الصفحة <em>لن تكون</em> مرئية لأي مستخدمين للموقع تم تسجيل الدخول. وبالمثل، فإن "إظهار في أي تسجيل دخول" سيجعل الصفحة مرئية لأي مستخدم مسجل الدخول في الواجهة.
it: Se i Diritti di Accesso Gruppo Utenti FE sono impostati su un gruppo utenti, solo gli utenti del sito web che sono membri del gruppo utenti selezionato, saranno in grado di visualizzare la pagina. L'opzione speciale 'Nascondi al login' significa che la pagina <em>non</em> sarà visibile agli utenti del sito web che hanno effettuato l'accesso. Allo stesso modo "Mostra al login" renderà la pagina visibile solo agli utenti autenticati nel Frontend.

# _fe_group.image
source: EXT:frontend/Resources/Public/Images/cshimages/fegroups_4.png
ar: EXT:frontend/resourcesces/Public/Images/cshimages/fegroups_4.png

# extendToSubpages.description
source: By default the Publication Date, Expiration Date, Usergroup Access Rights, and Page Visibility options <em>only</em> affect the page where they are set. If the option 'Extend to Subpages' is checked for the page, then all subpages are affected as well.
ar: بشكل افتراضي، تاريخ النشر، تاريخ انتهاء الصَّلاحِيَة، حقوق وصول مجموعة المستخدم، وخيارات رؤية الصفحة <em></em> فقط تؤثر على الصفحة التي يتم تعيينها. إذا تم التحقق من الخِيار 'توسيع إلى الصفحات الفرعية' للصفحة، فإن جميع الصفحات الفرعية تتأثر أيضاً.
it: Di base le opzioni Abilitato, Data di Pubblicazione, Data di Scadenza e Diritti di Accesso Gruppo hanno effetto <em>solo</em> sulla pagina su cui vengono impostate. Se l'opzione "Estendi alle Sottopagine" è spuntata, tutte le sottopagine erediteranno le stesse impostazioni.

# extendToSubpages.details
source: Consider a scenario where you want to create a section of subpages that are only visible for logged in users. Setting the Usergroup Access Rights for the top page in the section would remove the page from menus if no user was logged in. However, the subpage could still be accessed by guessing the ID number of the page and entering it manually in the URL. Setting the 'Extend to Subpages' option would extend the Usergroup Access Rights from the top page through all subpages as well.
ar: فكر في سيناريو حيث تريد إنشاء قسم من الصفحات الفرعية التي تكون مرئية فقط للمستخدمين المسجلين فيها. سيؤدي تعيين حقوق وصول مجموعة المستخدم إلى الصفحة العليا في القسم إلى إزالة الصفحة من القوائم إذا لم يتم تسجيل دخول أي مستخدم. ومع ذلك، لا يزال من الممكن الوصول إلى الصفحة الفرعية عن طريق تخمين رَقْم الهُوِيَّة في الصفحة وإدخالها يدوياً في عنوان URL. تعيين خِيار 'توسيع إلى الصفحات الفرعية' سيوسع حقوق الوصول لمجموعة المستخدم من الصفحة العليا عبر جميع الصفحات الفرعية أيضاً.
it: Considera uno scenario in cui vuoi creare una sezione di sottopagine che sia visibile solo per gli utenti loggati. Impostando i 'Diritti di Accesso Gruppo' per una pagina, al livello superiore della sezione, rimuoverebbe la pagina dai menù, se nessun utente fosse collegato. Tuttavia è possibile accedere alla sottopagina specificando l'ID della pagina e inserendola manualmente nell'URL. Abilitando l'opzione 'Estendi alle Sottopagine' estenderebbe i diritti di accesso del gruppo utente, dalla pagina a livello superiore a tutte le sottopagine.

# extendToSubpages.image_descr
source: This page has access restricted to a certain group and has "Extend to Subpages" set as well. This is reflected in the way the page icon has changed.
ar: هذه الصفحة لها حق الوصول إلى مجموعة معينة و لديها "توسيع إلى الصفحات الفرعية" تم تعيينها أيضاً. يظهر هذا في الطريقة التي تغيرت بها أيقونة الصفحة.
it: Questa pagina ha accesso limitato a un certo gruppo e ha impostato anche "Estendi alle Sottopagine". Questo si riflette nel modo in cui l'icona della pagina è cambiata.

# target.description
source: This sets the default Link Target for menu items linking to this page. Can also used to open the page as a popup window.
ar: هذا يعين الرابط الافتراضي لعناصر القائمة المرتبطة بهذه الصفحة. يمكن أيضاً استخدامها لفتح الصفحة كنافذة منبثقة.
it: Questo imposta il 'target' del collegamento per le voci di menù a questa pagina. Può anche essere usato per aprire la pagina in popup.

# target.details
source: The Link Target overrides the default Link Target behavior, which should already be configured correctly for most pages in the website TypoScript template. There are additional options available by using the Link Target field Setting an integer value at the beginning of the field sets it as the default type for the page. For example, if an RSS feed is configured in TypoScript as typeNum=100, setting the Link Target to 100 could be used to add an RSS link in the menu. The following syntax is used to open the page in a popup window: 400x200 - Opens the page in a 400x200 popup window. 230x450:resizable=0,location=1 - Opens the page in a 230x450 popup window that is not resizable and has an address bar. Combined: 100 600x350 - Opens the page in a 600x350 popup with type=100 2 _blank - Opens the page with target "_blank" and type=2
ar: يتخطى هدف الرابط السلوك الهدف الافتراضي للرابط، والذي يجب أن يتم تكوينه بشكل صحيح لمعظم الصفحات في قالب TypoScript للموقع. هناك خيارات إضافية متاحة باستخدام حقل الهدف الرابط تعيين قيمة عدد صحيح في بداية الحقل يعينها كالنوع الافتراضي للصفحة. على سبيل المثال، إذا تم تكوين تغذية RSS في TypoScript كـ typeNum=100، يمكن استخدام تعيين هدف الرابط إلى 100 لإضافة رابط RSS في القائمة. يتم استخدام الجملة التالية لفتح الصفحة في نافذة منبثقة: 400x200 - يفتح الصفحة في نافذة منبثقة 400x200. 230x450:resizable=0,location=1 - يفتح الصفحة في نافذة منبثقة 230x450 لا يمكن تغيير حجمها ولها شريط عناوين. مجتمعة: 100 600x350 - يفتح الصفحة في نافذة منبثقة 600x350 مع نوع =100 2 _blank - يفتح الصفحة مع الهدف "_blank" و type=2
it: Il Target del Collegamento sovrascrive il comportamento di default di un collegamento, il quale dovrebbe essere già configurato per la maggior parte dei Template TypoScript. Usando il campo Target del Collegamento si accede ad ulteriori opzioni. Usando un valore intero, come primo valore, si definisce l'attributo 'type' per il collegamento alla pagina. Per esempio, se un RSS feed è configurato in TypoScript come typeNum=100, è necessario definire il Target del Collegamento con 100: può essere usato per aggiungere un RSS al menù. La sintassi che segue è usata per aprire la pagina in una finestra popup: 400x200 - apre la pagina in un popup di 400x200. 320x450:resizable=0,location=1 - apre la pagina in una finestra popup di 320x450 che non è ridimensionabile e non ha la barra dell'indirizzo. Combinato: 100 600x350 - apre la pagina in una finestra popup di 600x350 usando type=100 2 _blank - apre la pagina con target "_blank" e type=2

# cache_timeout.description
source: Sets the Cache Lifetime for the page.
ar: يعين مدة صَلاحِيَة التخزين المؤقت للصفحة.
it: Imposta la Durata della Cache per la pagina.

# cache_timeout.details
source: By default, pages are cached for 24 hours. After 24 hours, the page is constructed again and rewritten to the cache. Depending on your configuration, the cache may be cleared at midnight. When specific pages need a longer or shorter cache lifetime than the default, this option can be used.
ar: بشكل افتراضي، يتم تخزين الصفحات بشكل مؤقت لمدة 24 ساعة. بعد 24 ساعة، يتم بناء الصفحة مرة أخرى وإعادة كتابتها إلى ذاكرة التخزين المؤقت. تبعاً لإعداداتك، يمكن مسح ذاكرة التخزين المؤقت في منتصف الليل. عندما تحتاج صفحات محددة إلى فترة تخزين مؤقت أطول أو أقصر من الافتراضي، يمكن استخدام هذا الخِيار.
it: Per default le pagine durano in cache per 24 ore. Dopo 24 ore la pagina viene rigenerata e scritta nuovamente in cache. Dipende dalla configurazione del tuo sito; la cache può essere cancellata a mezzanotte. Puoi usare questa opzione per pagine specifiche che necessitano di una permanenza in cache superiore al tempo di <i>default</i>.

# no_search.description
source: If enabled, this option includes the page in searching operations on the website.
ar: في حالة التمكين، يستبعد هذا الخيار الصفحة من البحث عن العمليات على الموقع.
it: Se abilitata, quest'opzione include la pagina nelle operazioni di ricerca sul sito web.

# php_tree_stop.description
source: If enabled, this option excludes the subtree from rendering in the backend.
ar: في حالة التفعيل، يستبعد هذا الخِيار الشجرة الفرعية من التقديم في الواجهة الخلفية.
it: Se abilitata, questa opzione inibisce la diretta e immediata visualizzazione del sottoalbero nel backend: sarà comunque possibile visualizzare il sottoalbero con un semplice clic sull'icona "+".

# author.description
source: Enter the page author's name.
ar: أدخل اسم مُنشئ الصفحة.
it: Inserisci il nome dell'autore della pagina

# author.details
source: Whether the author name is used or not depends on the setup of your TypoScript template. - You may use it in a meta-tag. - If you're using TYPO3 pages as 'articles' then you could use this field to display the name of the page (article) author.
ar: إذا ما كان اسم المؤلف يستخدم أم لا يعتمد على إعداد قالب TypoScript الخاص بك. - يمكنك استخدامه في علامة التعريف (meta-ta). - إذا كنت تستخدم صفحات TYPO3 كـ 'مقالات' فيمكنك استخدام هذا الحقل لعرض اسم الصفحة (مقال).
it: L'utilizzo del nome dell'autore dipende da opzioni di configurazione passate dal Template Typoscript. - Puoi usarlo nei metadati - Se stai utilizzando pagine di TYPO3 come 'articoli', puoi usare questo campo per visualizzare il nome dell'autore dell'articolo, configurando adeguatamente il tuo Template.

# author_email.description
source: Enter the page author's email address.
ar: أدخل عنوان البريد الإلكتروني لمُنشئ الصفحة.
it: Inserisci l'indirizzo email dell'autore della pagina.

# module.description
source: Define the page as containing a Frontend plugin.
ar: تعريف الصفحة على أنها تحتوي على إضافة الواجهة الأمامية.
it: Definisce la pagina come contenitore per un plugin di Frontend.

# module.details
source: Setting this option lets the Backend knows this page contains specific content or has a specific purpose, such as containing a forum or acting as the root page of a shop section on the website. Based on this setting the Backend is able to display a shortcut list as well as relevant functionality in the 'Web>Modules' module. The Frontend display is largely not affected. Marking a page as containing a 'Shop' plugin simply means it'll show up in the shortcut list of modules in the backend. For additional details on this option, refer to the administration documentation. It's recommended that only admin-users have access to this field!
ar: إعداد هذا الخِيار يتيح للواجهة الخلفية معرفة أن هذه الصفحة تحتوي على محتوى مُحدد، أو لها غرض محدد، مثل احتواء المنتدى أو العمل كصفحة جذرية لقسم المتجر على الموقع. استناداً إلى هذا الإعداد، يمكن للواجهة الخلفية عرض قائمة مختصرة بالإضافة إلى الوظائف ذات الصلة في وحدة "الويب>الوحدات". ولا يتأثر عرض الجبهة إلى حد بعيد. وضع علامة على الصفحة بأنها تحتوي على إضافة 'Shop' يعني ببساطة أنها ستظهر في قائمة الاختصارات من الوحدات النمطية في الواجهة الخلفية. لمزيد من التفاصيل حول هذا الخِيار، يرجى الرجوع إلى وثائق الإدارة. من المستحسن أن يكون للمستخدمين المسؤولين فقط الوصول إلى هذا الحقل!
it: L'impostazione di questa opzione consente al Backend di sapere che questa pagina ha contenuti specifici o ha uno scopo specifico, come contenitore di un forum o funziona come pagina root della sezione shop del sito. Sulla base di questa impostazione, il Backend è in grado di visualizzare un elenco di scorciatoie così come funzionalità importanti nel modulo 'Web>Moduli'. La visualizzazione di Frontend non è in gran parte influenzata. Contrassegnare una pagina come contenente il plug-in "Shop" significa semplicemente che verrà visualizzato nell'elenco di collegamenti dei moduli nel backend. Per ulteriori dettagli su questa opzione, fai riferimento alla documentazione di amministrazione. Si raccomanda che solo gli utenti admin abbiano accesso a questo campo!

# media.description
source: Attach media files related to the page.
ar: إرفاق ملفات الوسائط ذات الصلة بالصفحة.
it: Allega file multimediali relativi alla pagina.

# media.details
source: This field allows you to attach various files to the page, but how these files are used depends on your template. As an example the template could be use this field to allow a logo to be attached to the page or it might expect the first file to be an image used as a link in the navigation menu. Remember, this totally depends on how the template is programmed.
ar: هذا الحقل يسمح لك بإرفاق ملفات مختلفة إلى الصفحة، ولكن كيفية استخدام هذه الملفات تعتمد على قالبك. على سبيل المثال يمكن استخدام القالب هذا الحقل للسماح بإرفاق شعار للصفحة أو قد يتوقع أن يكون المِلَفّ الأول صورة تستخدم كرابط في قائمة التنقل. تذكر أن هذا يعتمد كلياً على كيفية برمجة القالب.
it: Questo campo permette di allegare diversi file alla pagina; tuttavia il comportamento nel frontend dipende dal Template Typoscript. Per esempio, il Template potrebbe utilizzare questo campo come logo per la pagina oppure utilizzare il primo file, di tipo immagine, nel collegamento del menù di navigazione. In ogni caso, l'utilizzo di queste informazioni dipende esclusivamente dal Template TypoScript.

# subtitle.description
source: Enter a subtitle if needed.
ar: أدخل عنوان فرعي إذا لزم الأمر.
it: Inserisci un sottotitolo, se necessario.
