Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# list_module.image_descr
source: Here the page "Cameras" has been clicked in the page tree and in the right frame the Web>List module shows the contents of the page. Here a single content element (Shop Plugin) is inserted in order to display the other items on the page which are three product records in this case. If you enable "Extended mode" and the "Clipboard" you will get additional buttons in the interface to operate on the records shown here. Also notice how you can click any record icon to get a "Clickmenu" for the element. Here you see the single-table mode active for the "Page content" table (Content Elements). In the fieldbox the "Hide" field is selected to be included in the listing. If you click any of the edit icons (marked with red border) you will be able to edit [from left to right] a) all listed fields (here "Header" and "Hide"), b) full record or c) a single field (eg. "Hide") for <u>only</u> the selected records (defined by the checkboxes seen).
ar: هنا تم النقر على الصفحة "Cameras" في شجرة الصفحة، وفي الإطار الأيسر تظهر وحدة الويب> القائمة محتويات الصفحة. هنا يتم إدخال عنصر محتوى واحد (Shop plugin) من أجل عرض العناصر الأخرى في الصفحة التي هي ثلاث سجلات في هذه الحالة. إذا فعّلت "الوضع المُوسّع" و "الحافظة" ستحصل على أزرار إضافية في الواجهة لتعمل على السجلات المعروضة هنا. لاحظ أيضاً كيف يمكنك النقر على أيقونة التسجيل للحصول على "Clickmenu" للعنصر. هنا ترى وضع جدول واحد ناشطٌ لجدول "محتوى الصفحة" (عناصر المحتوى). في مربع الحقول يتم تحديد حقل "إخفاء" لإدراجه في القائمة. إذا نقرت على أي من أيقونات التعديل (مُعلّمة بالحدود الحمراء) ستتمكن من تحرير [من اليسار إلى اليمين] a) جميع الحقول المُدرجة (هنا "الرأس" و "الإخفاء")، (b) السجل الكامل أو (ج) حقل واحد (على سبيل المثال. "إخفاء") ل <u>فقط</u> السجلات المحددة (معرفة بواسطة خانات الاختيار المشاهدة ).
fr: Ici la page a été cliquée dans l'arborescence et dans le cadre droit, le module WEB>Liste affiche les contenus de la page. Ici un élément de contenu unique (plugin Shop) est inséré pour afficher les autres éléments sur la page, qui sont trois produits dans ce cas. Si vous activez le mode "Vue étendue" et le "Presse-papier", vous aurez des boutons supplémentaires dans l'interface pour agir sur les enregistrements affichés ici. Notez aussi comment vous pouvez cliquer sur un icône d'enregistrement pour avoir un menu contextuel pour cet élément. Ici vous voyez le mode table unique activé pour la table "Pagecontent" (éléments de contenu). Dans le champ texte, le champ "caché" est sélectionné pour être inclus dans le listing. Si vous cliquez sur n'importe quel bouton d'édition (marqué avec la bordure rouge), vous pourrez éditer (de gauche à droite) a> tous les champs listés (ici "Header" et "Hide"), b) enregistrement complet ou c) un seul champ (ex "Hide") <u>seulement</u> pour les enregistrements sélectionnés (définis par les cases à cocher).
it: Qui la pagina "Cameras" è stata cliccata nell'Albero delle Pagine e nel riquadro destro il modulo Web>Lista mostra i contenuti della pagina. Qui viene inserito un singolo elemento di contenuto (Plugin Shop) al fine di visualizzare gli altri elementi sulla pagina che sono tre record di prodotto, in questo caso. Se abiliti "Vista estesa" e "Clipboard", otterrai ulteriori pulsanti nell'interfaccia, per operare sui singoli record mostrati qui. Nota anche che puoi cliccare sull'icona del record per ottenere un menù contestuale, per ogni singolo elemento. Qui vedi la modalità singola-tabella attiva per gli Elementi di Contenuto. È stato selezionato il campo "Hide" per essere incluso nella lista. Se clicchi su una delle icone di modifica (evidenziati in rosso) potrai modificare [da sinistra a destra] a) tutti i campi elencati (qui "Header" e "Hide"), b) record completo o c) un unico campo (ad es. "Hide") per i <u>soli</u> record selezionati (definiti dalle checkbox viste).

# list_module_noId.alttitle
source: Web>List module with no ID given
ar: ويب>قائمة الوحدة بدون ID
fr: Le module Web>Liste sans ID spécifié
it: Modulo Web>Lista senza alcun ID dato

# list_module_noId.description
source: The Web>List module must have a page ID passed to it before it can display any content. Please click a page title in the Page Tree.
ar: يجب أن تحتوي وحدة الويب>القائمة على ID الصفحة قبل أن تتمكن من عرض أي محتوى. الرجاء النقر على عنوان الصفحة في شجرة الصفحة.
fr: Le module Web>Liste doit avoir reçu l'ID d'une page avant d'afficher un contenu. Cliquez sur le titre d'une page dans l'arborescence.
it: Il modulo "Web>Lista" deve avere un ID di pagina che viene passato prima di visualizzare qualsiasi contenuto. Clicca su un titolo di una pagina nell'Albero delle Pagine.

# list_module_root.alttitle
source: Root of the Page Tree
ar: جذر شجرة الصفحة
fr: Racine de l'Arborescence des Pages
it: Root dell'Albero delle Pagine

# list_module_root.description
source: The root of the Page Tree is having id 0 (zero = no page) and the special circumstance is that records in the page tree root can be accessed and edited <i>only</i> by "Admin" users.
ar: جذر شجرة الصفحة هو وجود ID 0 (صفر = لا صفحة) والظرف الخاص هو أنه يمكن الوصول إلى السجلات في صفحة جذر شجرة الصفحة وتحريرها <i>فقط</i> من قبل المستخدمين "المشرف".
fr: La racine de l'Arborescence des Pages a l'id 0 (zero = aucune page) et le truc un peut spécial c'est que les enregistrements de la racine ne peuvent être accessible et éditable <i>uniquement</i> par les utilisateurs "Admin".
it: La root dell'Albero delle pagine ha id=0 (zero = nessuna pagina) e la circostanza speciale è che i record nella radice dell'albero delle pagine possono essere accessibili e modificati <i>solo</i> dagli utenti "Admin".

# list_module_root.details
source: Only records from certain database tables are allowed to be created in the page tree root. This includes Backend Users, Backend Groups, File Mount records, Language records etc., and you cannot create Content Elements or Frontend Users in the root of the Page Tree. It also works the other way around; For example you cannot create Backend Users anywhere in the page tree. Usually records that are located in the page tree root are somehow "global" for the whole TYPO3 installation and doesn't make sense inside a specific branch of the page tree.
ar: يُسمح فقط بإنشاء سجلات من جداول قاعدة بيانات معينة في جذر شجرة الصفحة. يتضمن ذلك مُستخدمي الواجهة الخلفية ومجموعات الواجهة الخلفية وسجلات تحميل الملفات وسجلات اللغة وما إلى ذلك، ولا يمكنك إنشاء عناصر المحتوى أو مستخدمي الواجهة الأمامية في جذر شجرة الصفحة. كما أنه يعمل في الاتجاه المعاكس؛ على سبيل المثال، لا يمكنك إنشاء مستخدمي الواجهة الخلفية في أي مكان في شجرة الصفحة. عادةً ما تكون السجلات الموجودة في جذر شجرة الصفحة "عامة" إلى حد ما لتثبيت TYPO3 بالكامل ولا يكون لها معنى داخل فرع معين من شجرة الصفحة.
fr: Seuls les enregistrements de certaines tables de la base de données peuvent être créé dans l'arborescence. Cela inclut les utilisateurs backend, les groupes backend, les enregistrements de points de montage, les enregistrements de langues, etc..., et vous ne pouvez pas créer des éléments de contenu ou des utilisateurs du frontend à la racine de l'arborescence. Cela marche aussi dans l'autre sens. Par exemple, vous ne pouvez pas créer d'utilisateurs du backend n'importe où dans l'arborescence. Habituellement, les enregistrements qui sont à la racine de l'arborescence sont "globaux" pour toute l'installation TYPO3 et ne font pas sens à l'intérieur d'une branche spécifique de l'arborescence.
it: Solo i record di alcune tabelle del database possono essere creati nella root dell'Albero delle Pagine. Questo include utenti di backend, gruppi utenti di backend, Filemount, record di lingua, ecc. Non puoi creare elementi di contenuto o utenti Frontend nella root dell'albero pagine. Viceversa, non è possibile creare utenti di backend da nessuna parte dell'Albero delle Pagine, se non nella root. Di solito i record, che si trovano nella radice dell'albero delle pagine, sono, in qualche modo, "globali" all'intera installazione di TYPO3 e non ha senso definirli su un ramo specifico dell'albero delle pagine.

# _list_module_root.seeAlso
source: xMOD_csh_corebe:list_module The List module ("Inside TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/
ar: xMOD_csh_corebe:list_module وحدة القائمة ("داخل TYPO3") <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/
fr: xMOD_csh_corebe:list_module Le module Liste ("Inside TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/
it: xMOD_csh_corebe:list_module Il modulo Lista ("Inside TYPO3") | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/CoreModules/ListModule/

# list_module_root.image_descr
source: Example of records in the page tree root; Backend users, groups, filemounts and website languages. When "Admin"-users wants to create a new record in the page tree root they will see a limited number of record types to create. This reflects which tables are configured to be created in the page tree root.
ar: مثال على السجلات في صفحة شجرة الجذر؛ مستخدمي الواجهة الخلفية، المجموعات، الملفات ولغات الموقع. عندما يريد "المُشرف" إنشاء سجل جديد في جذر صفحة الشجرة سوف يرون عدداً محدوداً من أنواع السجلات لإنشائها. هذا يظهر الجداول التي تم تكوينها لإنشائها في صفحة جذر الشجرة.
fr: Exemple d'enregistrements à la racine de l'arborescence : utilisateurs du backend, groupes, points de montage de fichiers et langues du site. Quand des utilisateurs "Admin" veulent créer un enregistrement à la racine de l'arborescence, ils verront un nombre limité de type d'enregistrement à créer. Cela reflète les tables configurées pour pouvoir créer des enregistrements à la racine.
it: Esempio di record nella root (nodo-TYPO3) dell'Albero delle Pagine: utenti di backend, gruppi, filemount e lingue del sito web. Quando gli utenti admin vogliono creare un nuovo record nella root dell'Albero delle Pagine, vedranno un numero limitato di tipi di record da creare: ossia quelle tabelle che sono configurate per essere (e devono essere) create nella root dell'Albero delle Pagine.

# list_clipboard.alttitle
source: TYPO3 Clipboard
ar: حافظة TYPO3
fr: Presse-papier TYPO3
it: Clipboard di TYPO3

# list_clipboard.description
source: The clipboard is an internal registry where records and files can be "stored" temporarily. Usually the clipboard is used for copy/cut/paste operations internally of one or more elements.
ar: الحافظة هي سجل داخلي حيث يمكنك "تخزين" السجلات والملفات مُؤقتاً. وتستخدم الحافظة عادة لعمليات النسخ/القص/اللصق داخليا لعنصر واحد أو أكثر.
fr: Le presse-papier est un registre interne dans lequel les enregistrements et fichiers peuvent être "enregistrés" temporairement. D'habitude le presse-papier est utilisé pour les opérations internes de copier/couper/coller de un ou plusieurs éléments.
it: La clipboard è un registro interno dove i record e i file possono essere "memorizzati" temporaneamente. Di solito la clipboard è usata per le operazioni interne di copia/taglia/incolla/ relativamente ad uno o più elementi.

# list_clipboard.image_descr
source: Whenever you use the copy/cut/paste functions in the clickmenus you will actually use the clipboard to store the element internally in TYPO3. If you select one of the numeric clipboard pads you will be able to store more than a single element on the clipboard at a time. In the record listings you will then see checkboxes next to the elements by which you can select/deselect elements for the clipboard.
ar: كلما استخدمت وظائف النسخ/القص/اللصق في قوائم النقر، ستستخدم الحافظة لتخزين العنصر داخلياً في TYPO3. إذا حددت إحدى لوحات الحافظة الرقمية، فستتمكن من تخزين أكثر من عنصر واحد في الحافظة في وقت واحد. في قوائم السجلات، سترى بعد ذلك مربعات اختيار بجوار العناصر التي يمكنك من خلالها يمكنك تحديد/ إلغاء تحديد عناصر للحافظة.
fr: À chaque fois que vous utilisez les fonctions copier/couper/coller dans les menus contextuels, vous utilisez en fait le presse-papier pour les enregistrer dans la mémoire cache de TYPO3. Si vous utilisez un des presse-papier numéroté, vous aurez la possibilités de mettre en cache plusieurs éléments à la fois. Dans la liste des enregistrements vous verrez des cases à cocher qui permettent de les sélectionner/désélectionner pour le presse-papier.
it: Ogni volta che usi le funzioni di copia/taglia/incolla, dai menù contestuali, utilizzerai la clipboard per memorizzare internamente, in TYPO3, l'elemento. Se selezioni una delle clipboard numerate, potrai memorizzare più di un singolo elemento alla volta. Nelle liste di record vedrai quindi delle checkbox, in corrispondenza degli elementi, con le quali puoi selezionare/deselezionare gli elementi da copiare nella clipboard.

# list_searchbox.alttitle
source: Search Box
ar: مربع البحث
fr: Boîte de Recherche
it: Riquadro per le ricerca

# list_searchbox.description
source: By this search box you can do a free text search in all the listed records. You can also search recursively in sub-pages by selecting a number of levels to search in the selector box to the right of the search field.
ar: من خلال مربع البحث هذا، يمكنك القيام ببحث نصّي مجاني في جميع السجلات المدرجة في القائمة. يمكنك أيضاً البحث بشكل متكرر في الصفحات الفرعية عن طريق اختيار عدد من المستويات للبحث في مربع الانتقاء إلى يمين حقل البحث.
fr: Grâce à la boîte de recherche vous pouvez faire une recherche en texte libre sur tous les enregistrements listés. Vous pouvez aussi effectuer une recherche récursive sur les sous-pages en choisissant la profondeur de recherche dans le sélecteur à la droite du champ de recherche.
it: Qui puoi inserire qualsiasi testo per effettuare una ricerca in tutti i record elencati. La ricerca può essere anche ricorsiva, selezionando il livello di profondità. Il "Numero massimo risultati" definisce il limite massimo dei record del risultato della ricerca.

# list_options.alttitle
source: List module options
ar: خيارات وحدة القائمة
fr: Options du module Liste
it: Opzioni del modulo Lista

# list_options.description
source: Enable additional options like the "Extended view" mode to see additional control buttons for each record in the listing or the "Clipboard" to see the clipboard and its content.
ar: تمكين خيارات إضافية مثل وضع "العرض المُوسّع" لرؤية أزرار تحكم إضافية لكل سجل في القائمة أو "الحافظة" لرؤية الحافظة ومحتوياتها.
fr: Activer le mode "Vue étendue" pour voir des boutons de contrôle supplémentaires pour chaque enregistrement de la liste. "Afficher le presse-papier" pour voir le presse-papier et ses contenus.
it: Abilita la "Vista estesa" per vedere tutti i bottoni delle azioni di ogni record della lista. Abilita "Mostra clipboard" per vedere e gestire tutte le clipboard e i relativi contenuti.

# list_options.image_descr
source: The options checkboxes. Selecting "Extended view" will enable the control buttons in the record lists.
ar: الخيارات المتاحة لمُربعات الاختيار. سيؤدي تحديد "عرض مُوسّع" إلى تمكين أزرار التحكم في قوائم التسجيلات.
fr: Les cases à cocher d'options. Sélectionner "Vue étendue" activera les boutons de contrôle dans la liste d'enregistrements.
it: Le opzioni del modulo Web>Lista. Attivando la "Vista estesa" i bottoni delle azioni sui record saranno tutti immediatamente accessibili.

# pagetree_overview.alttitle
source: Pagetree Overview
ar: نظرة عامة على شجرة الصفحة
fr: Aperçu de l'arborescence
it: Panoramica Albero delle Pagine

# pagetree_overview.description
source: The Pagetree Overview shows information related to pages for a branch of the page tree. This includes start- and stop-times, cache settings etc.
ar: تُظهر النظرة العامة على شجرة الصفحة المعلومات المُتعلقة بالصفحات الفرعية في شجرة الصفحة. يتضمن ذلك أوقات البَدْء والإيقاف وإعدادات ذاكرة التخزين المؤقت وما إلى ذلك.
fr: La vue d'ensemble de l'arborescence affiche des informations relatives aux pages d'une branche de l'arborescence. Cela inclut les temps de début et d'arrêt, les paramètres de cache, etc.
it: La (Web>info) "Panoramica Albero delle Pagine" mostra dettagliate informazioni relative alle singole pagine di un ramo dell'albero delle pagine. Ciò include data/ora di inizio e fine pubblicazione, lo stato della cache, panoramica dei record, impostazioni per i social media, ecc.

# pagetree_overview.image_descr
source: One of the features of the Pagetree Overview module is that you can see what types of records are found on pages in a branch. Here record counts are shown for a page tree branch 2 levels down.
ar: إحدى ميزات الوحدة "Pagetree Overview" هي أنه يمكنك رؤية أنواع السجلات الموجودة على الصفحات في فرع ما. هنا تظهر إحصائيات السجل لمستويات الفرع الثاني من شجرة الصفحة لأسفل.
fr: L'une des fonctionnalités du module Aperçu des pages est que vous pouvez voir quels types d'enregistrements sont trouvés sur les pages d'une branche. Ici les compteurs d'enregistrements sont affichés pour une branche d'arborescence de pages de 2 niveaux de profondeur.
it: Una delle caratteristiche della Panoramica Albero delle Pagine, del modulo Web>Info, è che puoi vedere quali tipi di record si trovano nelle pagine di un ramo. Qui, il numero dei record sono mostrati per un singolo ramo, dell'Albero delle Pagine, fino a 2 livelli di profondità.

# new_regular.alttitle
source: Create new record
ar: إنشاء سجل جديد
fr: Créer un nouvel enregistrement
it: Crea nuovo record

# new_regular.description
source: This list shows the types of records (database tables) you can create on the page. Click a table name to select the type.
ar: تظهر هذه القائمة أنواع السجلات (جداول قاعدة البيانات) التي يمكنك إنشاؤها على الصفحة. انقر على اسم الجدول لتحديد النوع.
fr: La liste affiche les types d'enregistrements (tables de la base) que vous pouvez créer sur cette page. Cliquez sur le nom d'une table pour sélectionner le type.
it: Questa lista mostra i tipi di record (tabelle di database) che tu puoi creare in una pagina. Clicca sul nome della tabella per scegliere il tipo.

# _new_regular.seeAlso
source: xMOD_csh_corebe:new_ce, xMOD_csh_corebe:new_pages
ar: xMOD_csh_corebe:new_ce, xMOD_csh_corebe:new_page

# new_regular.image_descr
source: The selection of records a user can create on this particular page. The selection depends on the user's permissions and the page type. For example a Folder page type can contain any kind of record while regular pages can contain only some types (like Content Elements).
ar: اختيار السجلات التي يمكن للمستخدم إنشاؤها في هذه الصفحة بالذات. يعتمد الاختيار على أُذُونات المستخدم ونوع الصفحة. على سبيل المثال: يمكن أن يحتوي نوع صفحة المجلد على أي نوع من السجلات بينما يمكن للصفحات العادية أن تحتوي على بعض الأنواع فقط (مثل عناصر المحتوى).
fr: La sélection des enregistrements qu'un utilisateur peut créer sur cette page. La sélection dépend des permissions de l'utilisateur et du type de page. Par exemple, un type de page Dossier peut contenir n'importe quel type d'enregistrement, alors que les pages Standard ne peuvent contenir que certains types (comme les éléments de contenu).
it: I record che un utente può creare in questa particolare pagina. La disponibilità dipende dalle autorizzazioni dell'utente e dal tipo di pagina. Ad esempio, una pagina 'Cartella' può contenere qualsiasi tipo di record, mentre una pagina 'Standard' può contenere solo alcuni tipi (come il Contenuto di Pagina).

# new_pages.alttitle
source: Create new page wizard
ar: إنشاء معالج صفحة جديد
fr: Assistant de création de page
it: Procedura guidata per creazione nuova Pagina

# new_pages.description
source: Creating a new page means you have to find a position for it in the page tree. This wizard helps you find this position easily by clicking the flashing arrow pointing to the position you want.
ar: إنشاء صفحة جديدة يعني أنه يجب عليك العثور على مكان لها في شجرة الصفحة. هذا المعالج يساعدك على العثور على هذا الموضع بسهولة بالنقر على السهم الملفوف مع الإشارة إلى الموضع الذي تريده.
fr: Créer une nouvelle page signifie que vous devez lui trouver une place dans l'arborescence des pages. Cet assistant vous aide à trouver facilement la position en cliquant sur les flèches pointant la position désirée.
it: Quando si crea una nuova pagina, è necessario posizionarla correttamente, secondo le proprie esigenze, nell'Albero delle Pagine. Questa procedura guidata ti aiuta a trovare facilmente la posizione facendo clic sulla freccia che punta alla posizione desiderata.

# _new_pages.seeAlso
source: xMOD_csh_corebe:new_regular, xMOD_csh_corebe:new_ce, How to create a new page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
ar: xMOD_csh_corebe:new_regularar, xMOD_csh_corebe:new_ce, كيفية إنشاء صفحة جديدة <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
fr: xMOD_csh_corebe:new_regular, xMOD_csh_corebe:new_ce, Comment créer une nouvelle page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
it: xMOD_csh_corebe:new_regular, xMOD_csh_corebe:new_ce, Come creare una nuova pagina | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/

# new_pages.image_descr
source: Between each page in the tree you find small icons that point out a place for a new page. Select a position by clicking one of these icons. To access the "Create new page wizard" in the first place, just click the link in the Create new record dialog.
ar: بين كل صفحة في الشجرة تجد أيقونات صغيرة تشير إلى مكان لصفحة جديدة. حدد موضع عن طريق النقر على أحد هذه الأيقونة. للوصول إلى "إنشاء معالج صفحة جديدة" في المقام الأول، فقط انقر فوق الرابط في إنشاء مربع حوار سجل جديد.
fr: Entre chaque page de l'arborescence, vous trouverez de petites icônes qui pointent la place de la nouvelle page. Sélectionnez une position en cliquant sur l'une de ces icônes. Pour accéder à l'assistant de création de page, cliquez sur le lien dans la boîte de dialogue de création d'un nouvel enregistrement.
it: Tra ogni pagina dell'albero si trovano piccole icone che indicano il posto per una nuova pagina. Seleziona una posizione facendo clic su una di queste icone. Per accedere alla Procedura guidata per la creazione di una nuova pagina, fai clic sulla voce "Crea nuova pagina::Pagina (seleziona posizione)" nella sezione "Nuovo record".

# new_ce.alttitle
source: Create new Content Element Wizard
ar: إنشاء معالج عنصر محتوى جديد
fr: Assistant de création de contenu
it: Procedura guidata per creazione nuovo Elemento di Contenuto

# new_ce.description
source: Content Elements come in many flavors and inserting new content on a page means you have to select the right element type. This wizard helps you to pick a main type of element before you actually begin to enter content.
ar: عناصر المحتوى تأتي في العديد من الأنواع، وإدراج محتوى جديد في الصفحة يعني أنه يجب عليك تحديد نوع العنصر الصحيح. هذا المعالج يساعدك على اختيار نوع رئيس من العناصر قبل أن تبدأ في إدخال المحتوى.
fr: Les éléments de contenus ont différentes propriétés et insérer un élément de contenu sur une page implique que vous devez choisir le bon type d'élément. Cet assistant vous aide à choisir un type d'élément avant de commencer à entrer le contenu.
it: Gli Elementi di Contenuto sono molto eterogenei e l'inserimento, di nuovi contenuti in una pagina, implica la necessità di selezionare, innanzitutto, il tipo di elemento giusto. Questa procedura guidata ti aiuta a scegliere il tipo di elemento più consono alle tue necessità, prima di iniziare effettivamente a inserire il contenuto.
