Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_core.xlf
Languages: ar, it

# cm.disallowedFileExtensions
source: Disallowed file extensions
ar: مِلَفّ الإضافات غير المسموح بها
it: Estensioni file non consentite

# cm.allowedEditableTextFileExtensions
source: Allowed editable text file extensions
ar: السماح بقابلية تعديل إضافات الملف النصّي
it: Estensioni file per documenti di testo modificabili

# cm.allowEmbedSources
source: Allowed media sources
ar: مصادر الوسائط المسموح بها
it: Sorgenti multimediali consentite

# cm.allowedRelations
source: Allowed relations
ar: العلاقات المسموح بها
it: Relazioni consentite

# CM_history
source: History/Undo
ar: التاريخ/تراجع
it: Cronologia/Annulla

# cm.transferToClipboard
source: Transfer to clipboard
ar: التحويل إلى الحافظة
it: Trasferisci nella clipboard

# cm.removeFromClipboard
source: Remove from clipboard
ar: إزالة من الحافظة
it: Rimuovi dalla clipboard

# sortable.dragmove
source: Drag to move
ar: اسحب للنقل
it: Trascina per spostare

# tree.searchTermInfo
source: Enter search term
ar: أدخل مصطلح البحث
it: Inserire il termine di ricerca

# warning.file_deny_pattern
source: The value of fileDenyPattern is not set to its default:%s If TYPO3 is running on Apache, a customized value might enable backend or frontend users to execute malicious php scripts.
ar: لم يتم تعيين قيمة ملف DenyPatpattern إلى الافتراضي:%s إذا كان TYPO3 يعمل على Apache، قيمة مخصصة قد تمكن المستخدمين الخلفية أو الواجهة لتنفيذ برامج php الضارّة.
it: La variabile fileDenyPattern non è configurata al valore di default: %s. Se TYPO3 sta girando sotto Apache, un valore diverso potrebbe permettere ad utenti backend o frontend di eseguire script php maliziosi.

# warning.file_deny_pattern_partsNotPresent
source: Security Risk! The new value of fileDenyPattern misses parts of its default:%s If TYPO3 is running on Apache, a customized value might enable backend or frontend users to execute malicious php scripts.
ar: خطر أمني! القيمة الجديدة لملف "fileDenyPattern" تفتقد لأجزاء من القيمة الإفتراضية الخاصة بها: %s إذا كان TYPO3 يعمل على Apache، قيمة مخصصة قد تمكن مستخدمي الواجهة الخلفية أو الأمامية لتنفيذ برامج php الضارّة.
it: Pericolo sicurezza! Il nuovo valore di fileDenyPattern non contiene alcuni dei valori predefiniti: %s. Se TYPO3 è eseguito da Apache, questa configurazione personalizzata potrebbe consentire ad utenti di backend o frontend di eseguire script PHP dannosi.

# warning.file_deny_htaccess
source: The current value of fileDenyPattern allows to upload/create files with the name ".htaccess". If TYPO3 is running on Apache, this enables backend or frontend users to create and execute php scripts. Please reset the value of fileDenyPattern to its default.
ar: القيمة الحالية لـ "fileDenyPattern" يسمح بتحميل/إنشاء ملفات باسم ".htaccess". إذا كان TYPO3 يعمل على Apache، فهذا يُمكّن مستخدمي الواجهة الخلفية أو الأمامية من إنشاء وتنفيذ البرامج النصية لـ php. الرجاء إعادة تعيين قيمة "fileDenyPattern" إلى القيمة الإفتراضية الخاصّة بها.
it: Il valore corrente di fileDenyPattern consente di caricare/creare file con nome ".htaccess". Se TYPO3 viene eseguito da Apache, questo consente a utenti di backend o frontend di creare ed eseguire script php. Per favore reimpostare il valore di fileDenyPattern al valore predefinito.

# warning.install_enabled
source: The Install Tool is permanently enabled. Delete the file "%s" when you have finished setting up TYPO3.
ar: أداة التثبيت مُفعّلة بشكل دائم. احذف الملف"%s" عند الإنتهاء من إعداد TYPO3.
it: I'Install Tool è attivo. Elimina il file "%s" quando hai finito di configurare questa installazione di TYPO3.

# warning.install_enabled_cmd
source: Click to remove the file now!
ar: انقر لإزالة الملف الآن!
it: Clicca qui per rimuovere il file ora!

# warning.install_trustedhosts
source: The trusted hosts pattern check is disabled. Please define the allowed hosts in the [SYS][trustedHostsPattern] section of the Install Tool.
ar: تم تعطيل أسلوب فحص المُضيفين الموثوقين. يرجى تحديد المُضِيفين المسموح بهم في قسم [SYS][trustedHostsPattern] أداة التثبيت.
it: Il controllo degli host affidabili è disabilitato. Definisci gli host consentiti nella sezione [SYS][trustedHostsPattern] dell'Install Tool.

# warning.install_update
source: This installation is not configured for the TYPO3 version it is running. If you did so intentionally, this message can be safely ignored. If you are unsure, visit the Upgrade Wizard section of the %sInstall Tool%s to see how TYPO3 would change.
ar: لم يتم تكوين إعدادات هذا التثبيت لإصدار TYPO3 الحالي. إذا فعلت ذلك عمداً، يمكنك تجاهل هذه الرسالة بأمان. إذا كنت غير مُتأكّد من ذلك، قم بزيارة قسم ترقية معالج أداة التثبيت %s%s لمعرفة التغيرات على TYPO3.
it: Questa installazione non è configurata per la versione di TYPO3 che è in esecuzione. Se lo hai fatto intenzionalmente, questo messaggio può essere ignorato in sicurezza. Se non sei sicuro, visita la sezione 'Upgrade Wizard' dell'%sInstall Tool%s per vedere come TYPO3 cambierebbe.

# warning.header
source: Important Notice!
ar: إشعار مهم!
it: Nota Importante!

# warning.backend_reference
source: The Reference Index table is empty which is likely the result of a recent TYPO3 upgrade. Please go to %sTools>DB Check%s and update the reference index.
ar: جدول الفهرس المَرجِعي فارغ، من المُرجّح أن يكون هذا نتيجةً لترقية TYPO3 مؤخراً. الرجاء الذهاب إلى %sأدوات>فحص DB%s وتحديث الفهرس المَرجِعي.
it: La tabella dell’Indice dei Riferimenti è vuota; questo è probabilmente dovuto a un aggiornamento di TYPO3 eseguito di recente. Vai in %sSistema>Verifica DB%s e aggiorna l'indice dei riferimenti (prima della v7 questo può essere trovato su Strumenti>Database).

# warning.backend_reference_index
source: The Reference Index table is empty which is likely the result of a recent TYPO3 upgrade. The Reference Index was last updated on %3$s. Please go to %sSystem>DB Check%s and update the reference index.
ar: جدول الفهرس المَرجِعي فارغ، من المُرجّح أن يكون هذه نتيجةً لترقية TYPO3 مؤخراً. آخر تحديث لجدول الفِهْرِس المَرجِعي كان في %3$s. الرجاء الذَّهاب إلى %s أدوات >DB فحص %s وقم بتحديث الفِهْرِس المَرجِعي.
it: La tabella dell'Indice dei Riferimenti è vuota: probabilmente il risultato di un recente aggiornamento di TYPO3. L'Indice dei Riferimenti è stato aggiornato l'ultima volta il %3$s. Vai a %sSistema>Verifica DB%s e aggiorna l'indice dei riferimenti.

# warning.memcache_not_usable
source: Memcache is configured, but connection to memcached failed with these configuration(s)
ar: تم تكوين Memcache، ولكن الإتصال بذاكرة التخزين المؤقت فشل مع هذا الإعداد(ات)
it: Memcached è configurata, ma la connessione a memcached non è riuscita con questa configurazione(i)

# warning.file_missing
source: File is missing!
ar: الملف مفقود!
it: File mancante!

# warning.file_missing_text
source: This file is marked as missing
ar: تم تحديد هذا الملف على أنه مفقود
it: Questo file è contrassegnato come mancante

# warning.header.storage_is_no_public
source: Storage is not public
ar: التخزين ليس عام
it: Lo Storage non è pubblico

# warning.message.storage_is_no_public
source: The storage has been marked to be "publicly available" but is not detected as such by the driver. The setting has been reverted.
ar: تم وضع علامة على أن التخزين "مُتاح للجمهور" ولكن لم يتم اكتشافه بهذه الصفة من قبل المشرف. تم عكس الإعداد.
it: Lo Storage è stato configurato come "disponibile pubblicamente", ma non viene rilevato come tale dal Driver. L'impostazione è stata annullata.

# warning.inline_use_combination
source: This record will be modified globally.
ar: سيتم تصحيح هذا السجل بشكل إجمالي.
it: Questo record verrà modificato globalmente.

# warning.tableDisplayOrder.message
source: The TSconfig setting for "mod.web_list.tableDisplayOrder" contains a circular dependency and cannot be resolved.
ar: إعدادات TSconfig لـ "mod.web_list.tableDisplayOrder" تحتوي على تَبَعِيّة دائرية ولا يمكن حَلّها.
it: L'impostazione di TSconfig per "mod.web_list.tableDisplayOrder" contiene una dipendenza circolare e non può essere risolta.

# warning.tableDisplayOrder.title
source: Circular table ordering detected
ar: تم اكتشاف طلب جدول دائري
it: Rilevato ordinamento tabella circolare

# error.formProtection.tokenInvalid
source: Validating the security token of this form has failed. Please reload the form and submit it again.
ar: فشل التحقق من صحة رمز الأمان لهذا النموذج. الرجاء إعادة تحميل النموذج وتعبئته وإرساله مرة أُخرى.
it: È fallita la validazione del token di sicurezza. Ricarica e riprova.

# extension.not.installed
source: Extension "%s" is not installed.
ar: لم يتم تثبيت الإضافة "%s".
it: L'estensione %s" non è installata.

# link.to.filefile.correctly
source: Please, do not link to this page.
ar: الرجاء عدم الإرتباط بهذه الصفحة.
it: Non creare collegamenti a questa pagina.

# error.database_schema_mismatch
source: A SQL error occurred. This may indicate a schema mismatch between TCA and the database. Try running database compare in the Install Tool.
ar: حدث خطأ في SQL. قد يُشير هذا إلى عدم توافق مخطط بين TCA وقاعدة البيانات. حاول تشغيل مُقارنْ قاعدة البيانات في أداة التثبيت.
it: Si è verificato un errore SQL. Questo potrebbe indicare una discordanza di schema tra TCA e il database. Prova ad eseguire il confronto del database in Manutenzione>Analyze Database Structure, nell'Install Tool.

# error.database_schema_mismatch_title
source: Database Error
ar: خطأ في قاعدة البيانات
it: Errore Database

# error.items_proc_func_error
source: An error occurred trying to process items for field "%1$s" (%2$s).
ar: حدث خطأ أثناء محاولة معالجة العناصر التابعة للحقل "%1$s" (%2$s).
it: Si è verificato un errore cercando di elaborare gli elementi per il campo "%1$s" (%2$s).

# error.invalidEmail
source: "%s" is not a valid e-mail address.
ar: "%s" ليس عُنوان بريد إلكتروني صالح.
it: "%s" non è un indirizzo email valido.

# error.adminCanNotChangeSystemMaintainer
source: Only system maintainers can change the admin flag and password of other system maintainers. The value has not been updated.
ar: يمكن فقط للقائمين على صيانة النظام تغيير علامة الإشراف وكلمة المرور لمشرفي صيانة النظام الآخرين. لم يتم تحديث القيمة.
it: Solo i manutentori del sistema possono modificare l'opzione 'Admin (!)' e la password di altri manutentori del sistema. Il valore non è stato aggiornato.

# formEngine.beUser.admin.information.userIsSystemMaintainer
source: This user is a system maintainer
ar: هذا المستخدم هو مُشرف النظام
it: Quest'utente è un manutentore del sistema

# formEngine.beUser.admin.information.userWillBecomeSystemMaintainer
source: This user is in the list of allowed system maintainers and will gain system level access if enabling admin access.
ar: هذا المُستخدم موجود في قائمة مشرفي النظام، وسوف يحصل على مستوى الوصول الكامل للنظام في حالة تمكين خيار "السماح للمشرف".
it: Quest'utente è nell'elenco dei manutentori di sistema consentiti e guadagnerà accesso a livello di sistema se si abilita l'accesso Admin.

# formEngine.beUser.admin.information.userAdminAndPasswordChangeNotAllowed
source: This user is a system maintainer. Changing the admin flag and changing password is denied.
ar: هذا المُستخدم هو مشرف على النظام. يتم رفض تغيير علامة الإشراف وتغيير كلمة المرور.
it: Quest'utente è un manutentore del sistema. La modifica del flag Admin (!) e della password è negata.

# formEngine.pages.backendLayout.information.inheritedFromParentPage
source: This page will most likely use backend layout "%s", inherited from a parent page.
ar: هذه الصفحة ستستخدم على الأرجح تخطيط الواجهة الخلفية "%s"، الموروثة من الصفحة الأصلية.
it: Questa pagina userà, molto probabilmente, il layout di backend "%s", ereditato da una pagina padre.

# formEngine.pages.backendLayout.information.inheritFromParentPage
source: This page is currently using backend layout "%s", inherited from a parent page.
ar: هذه الصفحة تستخدم على الأرجح تخطيط الواجهة الخلفية "%s"، الموروثة من الصفحة الأصلية.
it: Questa pagina sta attualmente usando il layout di backend "%s", ereditato da una pagina padre.

# error.backendUserGroupListTypeError.header
source: Possible misconfiguration detected
ar: تم اكتشاف خطأ في التكوين
it: Possibile errata configurazione rilevata

# error.backendUserGroupListTypeError.message
source: Editing of at least one plugin was enabled but editing the page content type "Insert Plugin" is still disallowed. Group members won't be able to edit plugins unless you activate editing for the content type.
ar: تم تمكين تعديل مُكون إضافي واحد على الأقل، ولكن تعديل نوع محتوى الصفحة "إدراج مُكون إضافي" لا يزال غير مسموح به. لن يتمكن أعضاء المجموعة من تعديل الإضافات إلا إذا قمت بتفعيل التحرير لنوع المحتوى.
it: La modifica di almeno un plugin è stata abilitata, ma la modifica del tipo di contenuto di pagina "Inserisci Plugin" è ancora non consentita. I membri del gruppo non saranno in grado di modificare i plugin a meno che non si attivi la modifica per il tipo di contenuto.

# error.missingLanguageIsocode
source: Missing ISO code for language "%s" (UID %d), please edit the language record and set it.
ar: رمز ISO مفقود للغة"%s" (UID %d)، يرجى تعديل سجل اللغة وتعيينه.
it: Codice ISO mancante per la lingua "%s" (UID %d). Modificare il record di lingua e impostarlo.

# error.misconfiguredPasswordRules
source: No password could be generated due to misconfigured password rules.
ar: لا يمكن إنشاء كلمة المرور بسبب قواعد كلمة المرور المُكوّنة بشكل خاطئ.
it: Nessuna password può essere generata a causa di regole di password mal impostate.

# labels.deleteTitle
source: Revert to default Constant
ar: العودة إلى الوضع الإفتراضي
it: Ripristina la Costante al valore predefinito

# labels.editTitle
source: Edit this Constant
ar: تعديل هذا الثابت
it: Modifica questa Costante

source: Page Translation
ar: ترجمة الصفحة
it: Traduzione della pagina

# filestorage.invalidpathexception.title
source: Error in Path
ar: خطأ في المسار
it: Errore nel percorso

# filestorage.invalidpathexception.message
source: You entered an invalid path for this File Storage. Note that "../" and "//" are not allowed when using an absolute path.
ar: لقد قمت بإدخال مسار غير صالح لتخزين الملفات هذا. لاحظ أن "../" و "//" غير مسموح بهما عند استخدام المسار الكامل.
it: Hai inserito un percorso base non valido per questo Storage. Nota che "../" e "//" non sono consentiti quando si utilizza un percorso assoluto.

# iframe.listFrame
source: List frame (content area) to create and modify pages, content and records
ar: إطار القائمة (مجال المحتوى) لإنشاء وتعديل الصفحات والمحتوى والسجلات
it: Riquadro d'elenco (area contenuti) per creare e modificare pagine, contenuti e record

# message.confirmation
source: Are you sure?
ar: هل أنت متأكد؟
it: Sei sicuro?

# labels.datepicker.today
source: Today
ar: اليوم
it: Oggi

# labels.inputfield.clearButton.title
source: Clear input
ar: مسح المُدخلات
it: Svuota

# labels.contextMenu.open
source: Open context menu
ar: فتح قائمة السِياق
it: Apri il menù contestuale

# labels.contextMenu.open.recordLabel
source: Open context menu for record: %s
ar: فتح قائمة السِياق للسِجل: %s
it: Apri menù contestuale per il record: %s

# labels.noMatchingValue
source: INVALID VALUE ("%s")
it: VALORE NON VALIDO (%s)

# labels.noMatchingLabel
source: MISSING LABEL ("%s")
it: ETICHETTA MANCANTE ("%s")

# show_item.php.refUid
source: Ref Uid
it: Rif Uid

# show_item.php.ftp_area
source: FTP AREA
it: Area FTP
