Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# file_rename.description
source: You can rename files or folders in TYPO3 quite easily. Just notice that certain characters are not allowed. So use a-z, numbers, underscores and don't make the names too long. If you enter invalid characters it will be automatically corrected.
ar: يمكنك إعادة تسمية الملفات أو المجلدات في TYPO3 بسهولة. فقط لاحظ أن بعض الأحرف غير مسموح بها. لذا استخدم a-z والأرقام والشرطات السفلية ولا تجعل الأسماء أطول مما ينبغي. إذا أدخلت أحرف غير صالحة، فسيتم تصحيحها تِلْقائياً.
fr: Vous pouvez renommer des fichiers ou des dossiers dans TYPO3 très facilement. Notez cependant que certains caractères ne sont pas permis. Utilisez donc a-z, chiffres, underscores et ne mettez pas des noms trop longs. Si vous entrez des caractères invalides, ils seront automatiquement corrigés.
it: Puoi rinominare file o cartelle in TYPO3 abbastanza facilmente. Nota, però, che alcuni caratteri non sono consentiti. Quindi usa a-z, numeri, trattino-basso (underscore) e non inserire nomi troppo lunghi. Se inserisci caratteri non validi, verranno automaticamente corretti.

# file_rename.image_descr
source: To rename a file (or folder for that sake) just click the icon of it, select "Rename" and enter the new name. Notice that restrictions may apply on filenaming, for instance ".php" is usually not a valid extension of a filename for security reasons.
ar: لإعادة تسمية مِلَفّ (أو مجلد لهذا السجل) فقط انقر فوق أيقونة ذلك، حدد "إعادة التسمية" وأدخل الاسم الجديد. الإشعار بأن القيود قد تطبق على تسمية الملفات، على سبيل المثال ".php" إنه في العادة ليست إضافة صالحة لاسم المِلَفّ لأسباب أمنية.
fr: Pour renommer un fichier (ou un dossier), cliquez sur son icône, sélectionner "Renommer" et entrer le nouveau nom. Notez que des restrictions peuvent s'appliquer sur le nom du fichier, par exemple ".php" est normalement invalide pour des raisons de sécurité.
it: Per rinominare un file (o una cartella) devi fare clic sull'icona, selezionare "Rinomina", dal menù contestuale, e inserire il nuovo nome. Ci sono delle restrizioni applicate al nome file, come, ad esempio, ".php": non è un'estensione valida in un nome di file, per motivi di sicurezza.

# file_upload.alttitle
source: Uploading files.
ar: جارِ تحميل المِلَفّات.
fr: Envoyer un fichier
it: Caricamento file.

# file_upload.description
source: Here you can upload one or more files to the server. Start by selecting the number of files to upload, then you begin to select files from your local computer to upload.
ar: هنا يمكنك رفع مِلَفّ واحد أو أكثر إلى الخادم. ابدأ باختيار عدد الملفات المراد تحميلها، ثم تبدأ في تحديد الملفات من جهاز الحاسوب المحلي الخاص بك لرفعها.
fr: Ici vous pouvez un ou plusieurs fichiers au serveur. Commencez par sélectionner le nombre de fichier à envoyer, puis sélectionnez les fichiers de votre ordinateur à envoyer.
it: Puoi caricare uno o più file, contemporaneamente, sul server. Fai clic su sfoglia, seleziona i file dal computer locale (tasto Ctrl per la selezione multipla) e fai clic sul bottone "Carica file".

# file_upload.details
source: If the filenames you upload exist already they will be renamed with a numeric suffix, eg. "file_01.jpg". However you can avoid this behaviour if you select "Overwrite existing files" before pressing the "Upload" button. Normally there is a limit to the size of files you can upload. By default PHP will allow you to upload around 2MB. TYPO3 is configured to allow 10MB internally by default. These settings can be changed by your server administrator if you need them changed. Notice that file uploads may take a significant amount of time, even if you have fast internet access via DSL etc. If you have large amount of files you want to upload - or if the files are very large - you should consider using an FTP client instead. It depends not on TYPO3 but on the webserver whether this is an options for you.
ar: إذا كان اسم المِلَفّ الذي تقوم بتحميله موجود فعلًا. سيتم إعادة تسميته مع لاحقة رقمية، على سبيل المثال "file_01.jpg". ومع ذلك، يمكنك تجنب هذا السلوك إذا حددت "الكتابة فوق الملفات الموجودة" قبل الضغط على زر "التحميل". عادةً ما يكون هناك حد لحجم الملفات التي يمكنك تحميلها. بشكل افتراضي يسمح لك PHP برفع حوالي 2MB. يتم تكوين TYPO3 للسماح لـ 10MB داخلياً بشكل افتراضي. يمكن تغيير هذه الإعدادات بواسطة مسؤول الخادم الخاص بك إذا كنت بحاجة إلى تغييرها. لاحظ أن تحميل الملفات قد يستغرق قدراً كبيراً من الوقت، حتى لو كان لديك وصول سريع إلى الإنترنت عبر DSL وما إلى ذلك. إذا كان لديك كَمّيَّة كبيرة من الملفات التي تريد تحميلها - أو إذا كانت الملفات كبيرة جداً - يجب أن تفكر في استخدام عميل FTP بدلا من ذلك. لا يعتمد على TYPO3 ولكن على خادم الويب ما إذا كان هذا الخيار لك.
fr: Si le nom du fichier existe déjà, le fichier sera renommé avec un suffixe numérique, par exemple "file_01.jpg". Cependant, vous pouvez outrepasser ce fonctionnement si vous sélectionnez "Écraser les fichiers existants" avant d'appuyer sur le bouton d'envoi. Normalement, il y a une limite à la taille des fichiers que vous pouvez envoyer. Par défaut PHP permet l'envoi de fichiers d'environ 2Mo. TYPO3 est configuré pour permettre 10Mo par défaut. Ces configurations peuvent être changé par votre administrateur si besoin. Notez que l'envoi de fichiers peut prendre beaucoup de temps, même avec une connexion internet rapide genre DSL, etc … Si vous avez beaucoup de fichiers à envoyer - ou si les fichiers sont très gros - considérer l'utilisation d'un client FTP. Cela ne dépend pas de TYPO3 mais du serveur où l'option doit être installé pour vous.
it: Se i nomi dei file caricati esistono già, saranno rinominati con un suffisso numerico, es. "file_01.jpg". Tuttavia, è possibile evitare questo comportamento se si seleziona "Sovrascrivi i file esistenti" prima di premere il pulsante "Carica file". Normalmente c'è un limite alla dimensione dei file che puoi caricare. Per impostazione predefinita, PHP ti permette di caricare circa 2MB. TYPO3 è configurato, di default, per consentire fino a 10MB. Queste impostazioni possono essere modificate dall'amministratore del server, se ne hai bisogno. Nota che i file caricati possono richiedere una quantità significativa di tempo, anche se si dispone di accesso veloce a internet. Se si dispone di una grande quantità di file da caricare, o se i file sono molto grandi, dovresti prendere in considerazione l'utilizzo di un client FTP. Eventuali limitazioni nel caricamento, non dipendono da TYPO3, ma dal server web.

# _file_upload.seeAlso
source: xMOD_csh_corebe:filelist_module, How-to upload files | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/
ar: xMOD_csh_corebe:filelist_module, كيفية تحميل الملفات <unk> https://docs.typo3.org/typo3cms/GettingStartedtutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/
fr: xMOD_csh_corebe:filelist_module, Comment télécharger des fichiers | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheFileModuleOrImageArchives/UploadingImagesToTheArchive/

# file_upload.image_descr
source: To upload files, first click the folder icon where you want to upload to. From the clickmenu you select "Upload files". In the next screen you select the number of files and click the "Browse..." buttons to select files from your computer. Finally you click the "Upload files" button to start the upload process (which might take some minutes with large files!)
ar: لتحميل الملفات، اضغط أولاً على أيقونة المجلد حيث تريد رفعه. من القائمة النقر يمكنك تحديد "تحميل الملفات". في الشاشة التالية يمكنك تحديد عدد الملفات وانقر فوق "تصفح". أزرار لتحديد الملفات من جهاز الحاسوب الخاص بك. أخيرا انقر على زر "تحميل الملفات" لبدء عملية التحميل (التي قد تستغرق بعض الدقائق مع الملفات الكبيرة!)
fr: Pour envoyer des fichiers, cliquez sur l'icône du dossier dans lequel vous voulez faire l'envoi. Dans le menu contextuel, sélectionnez "Envoyer des fichiers". Dans l'écran suivant, sélectionnez le nombre de fichiers et cliquez sur le bouton "Naviguer…" pour sélectionner les fichiers de votre ordinateur. Finalement, cliquez sur le bouton "Envoyer les fichiers" pour commencer le processus d'envoi (qui peut prendre quelques minutes avec de gros fichiers! ).
it: Per caricare i file, fai clic sull'icona della cartella in cui desideri caricare. Dal menù contestuale seleziona "Carica file". Fai clic su "Sfoglia" per selezionare i file dal computer. Infine fai clic sul pulsante "Carica file" per avviare il processo di caricamento (che potrebbe richiedere alcuni minuti con file di grandi dimensioni!)

# wizard_table_wiz.alttitle
source: Table wizard
ar: معالج الجدول
fr: Assistant de table
it: Procedura Guidata Tabella

# wizard_table_wiz.description
source: The table wizard helps you create tables that are normally stored in the database by XML or a syntax where each line represents a row and each cell is divided by a vertical line sign, "|". This wizard makes it transparent for you.
ar: معالج الجدول يساعدك على إنشاء الجداول التي يتم تخزينها عادةً في قاعدة البيانات بواسطة XML أو بناء الجملة حيث يمثل كل سطر صف ويتم تقسيم كل خلية على علامة خط عمودي، "<unk> ". هذا المعالج يجعله شفافاً بالنسبة لك.
fr: L'assistant de table vous aide à créer des tables qui sont normalement enregistrées dans la base de données en XML ou dans une syntaxe où chaque ligne représente une ligne de la table et chaque cellule est divisé par le signe de ligne verticale "|". Cet assistant vous rend cela transparent.
it: La procedura guidata della tabella aiuta a creare tabelle che sono normalmente memorizzate, nel database, in formato XML o in una sintassi in cui ogni riga rappresenta una riga e ogni cella è divisa da un simbolo grafico verticale, "|". Questa procedura guidata rende trasparente, qualunque esso sia, il formato di memorizzazione.

# wizard_table_wiz.details
source: The wizard is quite simple. By the buttons to the left and in the bottom you can add, delete and move columns and rows in the table. You can also disable the setting "Small fields" below the wizard if you want larger textarea fields for the editing.
ar: المعالج بسيط جداً. بواسطة الأزرار إلى اليسار وفي الأسفل يمكنك إضافة وحذف ونقل الأعمدة والصفوف في الجدول. يمكنك أيضاً تعطيل الإعداد "الحقول الصغيرة" أسفل المعالج إذا كنت تريد حقول نصية أكبر للتحرير.
fr: Cet assistant est simple. Avec les boutons à gauche et en bas, vous pouvez ajouter, effacer et déplacer des colonnes et des lignes de la table. Vous pouvez aussi désactiver l'option "champs courts" en bas de l'assistant si vous voulez des champs "texte" plus grand pour l'édition.
it: La procedura guidata è abbastanza semplice. Con i pulsanti a sinistra e in basso è possibile aggiungere, eliminare e spostare colonne e righe nella tabella. Puoi anche disabilitare l'impostazione "Piccoli campi", sotto la procedura guidata, se vuoi campi di testo più grandi per la modifica.

# _wizard_table_wiz.seeAlso
source: xMOD_csh_corebe:wizard_forms_wiz, Table Wizard details [Technical]| https://docs.typo3.org/typo3cms/TCAReference/AdditionalFeatures/CoreWizardScripts/
ar: xMOD_csh_corebe:wizard_forms_wiz، تفاصيل معالج الجدول [Technical]<unk> https://docs.typo3.org/typo3cms/TCAReference/AdditionalFeatures/CoreWizardScripts/
fr: xMOD_csh_corebe:wizard_forms_wiz, Détails de l'assistant de table [Technical]| https://docs.typo3.org/typo3cms/TCAReference/AdditionalFeatures/CoreWizardScripts/
it: xMOD_csh_corebe:wizard_forms_wiz, Dettagli procedura guidata tabella [Tecnico] | https://docs.typo3.org/typo3cms/TCAReference/AdditionalFeatures/CoreWizardScripts/

# wizard_table_wiz_buttons.alttitle
source: Table wizard buttons
ar: أزرار معالج الجدول
fr: Boutons de l'assistant de tableau
it: Bottoni procedura guidata tabella

# wizard_table_wiz_buttons.description
source: Use the refresh button to update the form without saving it. When you are done you should click one of the real save buttons to save and return to the form from which you entered the wizard. The information from this wizard should then be saved into the field the wizard was associated with.
ar: استخدم زر التحديث لتحديث النموذج دون حفظه. عند الانتهاء من ذلك، يجب عليك النقر على أحد أزرار الحفظ الحقيقية للحفظ والعودة إلى النموذج الذي دخلت منه المعالج. ثم ينبغي حفظ المعلومات من هذا المعالج في الحقل الذي ارتبط به المعالج.
fr: Utilisez le bouton rafraîchir pour mettre à jour le formulaire sans le sauvegarder. Quand vous être prêt, vous devriez cliquer sur les boutons de sauvegarde et retourner au formulaire duquel vous êtes entré dans l'assistant. L'information de l'assistant devra ensuite être sauvegardé dans le champ associé à l'assistant.
it: Utilizza il pulsante di aggiornamento per una anteprima. Quando hai finito dovresti fare clic sul bottone di salvataggio per salvare e tornare al modulo da cui hai avviato la procedura guidata. Le informazioni da questa procedura guidata dovrebbero quindi essere salvate nel campo con cui è stata associata la procedura guidata.

# shortcuts.alttitle
source: Backend Shortcuts
ar: اختصارات الواجهة الخلفية
fr: Raccourci Backend
it: Scorciatoie del Backend

# shortcuts.description
source: You can create shortcuts to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
ar: يمكنك إنشاء اختصارات للوحدات النمطية في TYPO3 بسهولة كبيرة. المعالجة هي أنه يمكنك القفز بين الشاشات في TYPO3 في <em>نقرة واحدة</em> بدلاً من النقرات المتعددة بواسطة وحدات الواجهة الخلفية، إلخ. يحتوي الإطار أيضاً على حقل لإدخال مُعرّف الصفحة أو السجل لتعديل أو فقط البحث في السجلات.
fr: Vous pouvez facilement créer des raccourcis vers des modules de TYPO3. Ainsi vous pouvez passer à différents écrans dans TYPO3 en <em>un</em> clic plutôt qu'en plusieurs via les modules de TYPO3. Le cadre contient aussi un champ pour entrer l'id d'une page ou d'un enregistrement ou pour rechercher des enregistrements.
it: Puoi creare delle scorciatoie ai moduli di TYPO3 abbastanza facilmente. Il vantaggio è che puoi saltare da una sezione all'altra, di TYPO3, con <em>un solo</em> clic, invece che passare attraverso i vari moduli con molti clic. Il riquadro contiene anche un campo per inserire un id di pagina / record da modificare oppure solamente per cercare dei record.

# shortcuts.details
source: In order to create a shortcut it must be supported by the module you want to create the shortcut to. Whether shortcuts are supported can be seen in the bottom of a module. If there is a small "shortcut" icon you can click it to create the shortcut. In the shortcut frame you can also enter a page id to edit in the "Edit Page ID" box. This will load the current page module with the id provided in the box. Only "Admin"-users can access the shortcut frame in TYPO3 by default. Other users must have it enabled by the User TSconfig option, "options.shortcutFrame = 1". See link below for details (Admins). Editing pages from an id is easy with the shortcut frame. Simply enter an integer number and that page will be loaded for editing. If you enter "[table]:[id]" then it will try to edit a record from the [table] table, for example "tt_content:123" will look for content element 123 (for admins only). Finally, if you enter a string that doesn't match a page or other record the Web>List module will be invoked doing a search in the first database mount you have.
ar: من أجل إنشاء اختصار يجب أن يكون مدعوماً بالوحدة التي تريد إنشاء الاختصار إليها. يمكن رؤية ما إذا كانت الاختصارات مدعومة في أسفل الوحدة. إذا كان هناك أيقونة "اختصار" صغيرة، يمكنك النقر عليها لإنشاء الاختصار. في إطار الاختصار، يمكنك أيضاً إدخال مُعرّف الصفحة للتعديل في مربع "تحرير مُعرّف الصفحة". سيؤدي هذا إلى تحميل وحدة الصفحة الحالية مع المُعرّف المقدم في المربع. يمكن فقط للمستخدمين "المشرفين" الوصول إلى إطار الاختصار في TYPO3 بشكل افتراضي. يجب على المستخدمين الآخرين تمكينه بواسطة خِيار TSconfig المستخدم "الخيارات. hortcutFramework = 1". راجع الرابط أدناه للحصول على التفاصيل (المشرف). تعديل الصفحات من مُعرّف سهل مع إطار الاختصار. ببساطة أدخل رَقَم صحيح وسيتم تحميل هذه الصفحة للتعديل. إذا أدخلت"[table]:[id]" ثم سيحاول تعديل سجل من جدول [table] على سبيل المثال "tt_content:123" سوف يبحث عن عنصر المحتوى 123 (للمشرفين فقط). أخيرا إذا أدخلت سلسلة لا تتطابق مع صفحة أو سجل آخر، سيتم التذرع بوحدة القائمة>لإجراء بحث في أول قاعدة بيانات لديك.
fr: Pour créer des raccourcis, ça doit être supporté par le module pour lequel vous voulez créer le raccourci. Vous pouvez savoir si les raccourcis sont supportés en bas d'un module. S'il y a un petit icône "raccourci", vous pouvez le cliquer pour créer le raccourci. Dans le cadre des raccourcis, vous pouvez aussi entrer l'ID d'une page. Cela va charger le module Page avec l'id fournit dans le champ. Seul les utilisateurs "Admin" peuvent accéder au cadre des raccourcis dans TYPO3 par défaut. Les autres utilisateurs doivent l'avoir d'activé dans les options User TSconfig, "options.shortcutFrame = 1". Voir le lien ci-dessous pour les détails (Admins). Éditer des pages depuis leur ID est facile depuis le cadre des raccourcis. Entrez tout simplement un nombre entier et la page se chargera pour l'édition. Si vous entrez "[table]:[id]", alors il essaiera d'éditer l'enregistrement depuis la table [table], par exemple "tt_content:123" cherchera l'élément de contenu 123 (seulement pour les admins). Finalement, si vous entrez une chaîne qui ne correspond à aucune page ou à un autre enregistrement, le module WEB>Liste sera appelé pour effectuer une recherche dans la première base de données que vous avez.
it: Per creare una scorciatoia a un modulo, il modulo stesso deve supportare la creazione di scorciatoie. Se le scorciatoie sono supportate, sono visibili in fondo a un modulo. Se c'è una piccola icona "scorciatoia", puoi cliccarla per creare la scorciatoia. Nel riquadro scorciatoia puoi anche inserire un ID di pagina da modificare, nel campo "Modifica ID Pagina". Questo caricherà il modulo Pagina corrente con l'ID fornito. Solo gli utenti "Admin" possono accedere al riquadro di scorciatoia in TYPO3, per default. Gli altri utenti devono averlo abilitato via TSconfig Utente "options.shortcutFrame = 1". Vedi il link qui sotto per i dettagli (Admin). Modificare le pagine da un ID è facile con il riquadro di scorciatoia. Basta inserire un numero intero e quella pagina sarà caricata per la modifica. Se inserisci "[table]:[id]" allora proverà a modificare un record dalla tabella [table], per esempio "tt_content:123" cercherà l'elemento di contenuto con ID 123 (solo per gli amministratori). Infine, se si immette una stringa che non corrisponde ad una pagina o ad un altro record il modulo Web>Lista verrà invocato facendo una ricerca nel primo Albero delle Pagine disponibile.

# shortcuts.image_descr
source: To create a shortcut to a page, just click the short cut icon usually found in the bottom of pages. You will have to confirm the creation of the shortcut. It is nothing dangerous - only annoying to clean up if you happen to create shortcuts against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the shortcut frame reload and a new icon (the module icon) appear. If you click this icon you will now jump to the page you created the shortcut from! You can name shortcuts, you can even group them and share them. If you want to edit or delete a shortcut you select the "Edit" checkbox and then click the shortcut icon. This will reload the shortcut frame so you get a field for entering a title. You can also delete all shortcuts in a "group" - here, just click the "0" (zero) to the left of the icons and you will remove all shortcuts in the group.
ar: لإنشاء اختصار إلى صفحة ما، فقط انقر فوق أيقونة القطع المختصر الموجودة عادة في أسفل الصفحات. يجب عليك تأكيد إنشاء الاختصار. ليس من الخطورة - فقط المزعج تنظيف إذا حدث لك إنشاء اختصارات ضد إرادتك. فقط الإجابة "حسناً" هنا. عندما تجيب "موافق" يجب أن ترى على الفور إعادة تحميل الإطار المختصر وتظهر أيقونة جديدة (أيقونة الوحدة). إذا نقرت على هذه الأيقونة سوف تنتقل الآن إلى الصفحة التي أنشأت الاختصار منها! يمكنك تسمية الاختصارات، يمكنك حتى تجميعها ومشاركتها. إذا كنت ترغب في تعديل أو حذف اختصار يمكنك تحديد مربع الاختيار "تحرير" ثم انقر فوق أيقونة الاختصار. سيؤدي هذا إلى إعادة تحميل إطار الاختصار حتى تحصل على حقل لإدخال عنوان. يمكنك أيضًا حذف جميع الاختصارات في "مجموعة" - هنا، فقط انقر فوق "0" (صفر) إلى يسار الأيقونات وستزيل جميع الاختصارات في المجموعة.
fr: Pour créer un raccourci dans une page, cliquez sur l'icône de raccourci habituellement en bas des pages. Vous devrez confirmer la création du raccourci. Rien de dangereux - seulement ennuyeux à nettoyer si vous créez des raccourcis sans le faire exprès. Répondez OK. Quand vous aurez répondu OK, vous devriez immédiatement voir le cadre des raccourcis se recharger et un nouvel icône (l'icône du module) apparaître. Si vous cliquez sur cet icône, vous serez redirigé vers la page depuis laquelle vous avez créé ce raccourci ! Vous pouvez nommer les raccourcis, vous pouvez même les grouper et les partager. Si vous voulez éditer ou effacer un raccourci, sélectionnez la case à cocher "Éditer" et cliquez ensuite sur l'icône de raccourci. Cela rechargera le cadre de raccourci et vous aurez un champ pour entrer le titre. Vous pouvez aussi effacer tous les raccourcis d'un groupe - ici, cliquez le zéro à gauche des icônes et vous enleverez tous les raccourcis du groupe.
it: Per creare una scorciatoia in una pagina, basta fare clic sull'icona di taglio corto che di solito si trova in fondo alle pagine. Dovrai confermare la creazione della scorciatoia. Non è niente di pericoloso, solo fastidioso da ripulire se ti capita di creare scorciatoie involontariamente. Basta rispondere "OK". Quando rispondi "OK", dovresti vedere, immediatamente, il riquadro scorciatoia caricato e apparire una nuova icona (l'icona del modulo). Se fai clic su questa icona passerai alla pagina dalla quale hai creato la scorciatoia! Puoi rinominare le scorciatoie, raggrupparle e condividerle. Se desideri modificare o eliminare una scorciatoia, seleziona la casella "Modifica" e fai clic sull'icona di scorciatoia. Questo ricaricherà il frame scorciatoia in modo da ottenere un campo per inserire un titolo. Puoi anche eliminare tutte le scorciatoie in un "gruppo": qui, basta cliccare su "0" (zero) a sinistra delle icone e rimuovere tutte le scorciatoie nel gruppo.

# bookmarks.alttitle
source: Backend Bookmarks
ar: العلامات المُفضلة في الواجهة الخلفية
fr: Favoris Backend
it: Segnalibri Backend

# bookmarks.description
source: You can create bookmarks to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
ar: يمكنك إنشاء الإشارات المرجعية إلى الوحدات النمطية في TYPO3 بسهولة كبيرة. المعالجة هي أنه يمكنك القفز بين الشاشات في TYPO3 في <em>نقرة واحدة</em> بدلاً من النقرات المتعددة من خلال وحدات نهاية الخلفية، إلخ. يحتوي الإطار أيضا على حقل لإدخال معرف الصفحة أو السجل لتعديل أو فقط البحث في السجلات.
fr: Vous pouvez facilement créer des raccourcis vers les modules de TYPO3. Ainsi vous pouvez sauter d'un écran à l'autre dans TYPO3 en <em>un</em> clic plutôt qu'en plusieurs via les modules de TYPO3. Le cadre contient aussi un champ pour entrer l'id d'une page ou d'un enregistrement ou pour rechercher des enregistrements.
it: Puoi creare segnalibri ai moduli di TYPO3 abbastanza facilmente. Il vantaggio è che puoi saltare passaggi in TYPO3 con <em>un solo</em> clic, evitando che clic multipli. Il riquadro contiene anche un campo per inserire un ID di pagina o di record, per modificare o semplicemente cercare dei record.
