Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# new_ce.details
source: Selecting an element type here will just preset the content element with certain values. You can always change the values later and if you cannot find exactly the type you need you can just pick the one that comes closest to your need, then adjust the details later.
ar: تحديد نوع العنصر هنا سوف يقوم فقط بتعيين عنصر المحتوى مسبقاً مع قيم معينة. يمكنك دائما تغيير القيم لاحقاً، وإذا لم تتمكن من العثور على النوع الذي تحتاجه بالضبط، يمكنك فقط اختيار النوع الذي يقترب أكثر من حاجتك، ثم قم بضبط التفاصيل لاحقاً.
fr: Sélectionner un type d'élément ici pré-détermine seulement certaines valeurs de l'élément de contenu. Vous pouvez toujours changer les valeurs ensuite et si vous ne trouvez pas exactement le type dont vous avez besoin, prenez celui qui s'en approche le plus et changer les détails ensuite.
it: La selezione di un tipo di elemento preimposta l'elemento di contenuto con determinati valori. Puoi sempre cambiare i valori in seguito e se non riesci a trovare esattamente il tipo di cui hai bisogno, puoi semplicemente scegliere quello che si avvicina più alle tue necessità, poi aggiustare i dettagli più tardi.

# _new_ce.seeAlso
source: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regular, How to create new page content | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/ More about Content Element types | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/ Adding Custom elements [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/ContentElementWizard/
ar: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regularar كيفية إنشاء محتوى صفحة جديد <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/ المزيد عن أنواع عنصر المحتوى <unk> https://docs. ypo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/ إضافة عناصر مخصصة [Technical] <unk> https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/examples/ContentElementWizard/
fr: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regular, Comment créer un nouveau contenu de page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/ En savoir plus sur les types d'éléments de contenu | https://docs. ypo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/ Ajout d'éléments personnalisés [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/ContentElementWizard/
it: xMOD_csh_corebe:new_pages, xMOD_csh_corebe:new_regular, Come creare un nuovo contenuto di pagina | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/ Ancora sui tipi di Contenuto di Pagina | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/ Aggiungere elementi personalizzati [Tecnico] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/ContentElementWizard/

# new_ce.image_descr
source: The Content Element wizard presents a set of preset types. Just select one by clicking its title. After selecting the type you will (often) have to select a position of the element among the other existing Content Elements on the page. You can access the Content Element wizard from the Create new record dialog.
ar: يعرض معالج عنصر المحتوى مجموعة من أنواع الإعداد المسبق. اختر واحداً فقط بالنقر على عنوانه. بعد تحديد النوع الذي ستضطر (في كثير من الأحيان) إلى تحديد موضع العنصر من بين عناصر المحتوى الأخرى الموجودة في الصفحة. يمكنك الوصول إلى معالج عنصر المحتوى من إنشاء مربع حوار سجل جديد.
fr: L'assistant de création de contenu présente une liste de type prédéfini. Sélectionner en un en cliquant sur son titre. Après avoir sélectionné le type, vous aurez souvent à choisir la position de l'élément parmi ceux existant sur la page. Vous pouvez accéder à l'assistant de création de contenu depuis le dialogue de création d'un nouvel enregistrement.
it: La procedura guidata dell'Elemento di Contenuto presenta una serie di tipi preimpostati. Basta selezionarne uno facendo clic sul suo titolo. Dopo aver selezionato il tipo dovrai (spesso) selezionare una posizione dell'elemento tra gli altri elementi di contenuto già esistenti nella pagina. È possibile accedere alla procedura guidata, per l'Elemento di Contenuto, nella sezione "Nuovo record" alla voce "Crea un nuovo elemento di contenuto::Clicca qui per la procedura guidata!".

# move_el_pages.alttitle
source: Move page wizard
ar: نقل معالج الصفحة
fr: Assistant de déplacement de page
it: Procedura guidata per spostamento pagina

# move_el_pages.description
source: By this wizard you can visually re-position (or copy) a page inside TYPO3. The element you move is shown in the top.
ar: من خلال هذا المعالج يمكنك إعادة وضع (أو نسخ) صفحة داخل TYPO3. العنصر الذي تقوم بنقله يظهر في الأعلى.
fr: Grâce à cet assistant, vous pouvez re-positionner visuellement (ou copier) une page dans TYPO3. L'élèment que vous déplacer est affiché en haut.
it: Con questa procedura guidata puoi riposizionare (o copiare), graficamente, una pagina all'interno di TYPO3. L'elemento che sposti viene mostrato in alto.

# move_el_pages.details
source: As an alternative to using the regular Copy/Cut/Paste functions in the clickmenus of records you can also use the move-page wizard. It lets you re-position a page by a visual view of the page tree rather than using the concept of "Paste into" and "Paste after".
ar: كبديل لاستخدام وظائف نسخ/قص/لصق العادية في النقر على السجلات يمكنك أيضاً استخدام معالج الصفحات المنقولة. يتيح لك إعادة وضع صفحة عن طريق عرض مرئي لصفحة الشجرة بدلاً من استخدام مفهوم "لصق" و "لصق بعد".
fr: Comme alternative à l'utilisation du copier/couper/coller dans le menu contextuel des enregistrements, vous pouvez aussi utiliser l'assistant de déplacement de page. Il vous permet de repositionner une page grâce à une vue de l'arborescence au lieu d'utiliser le concept du "coller dans" ou "coller après".
it: In alternativa all'utilizzo delle normali funzioni Copia/Taglia/Incolla nei menù contestuale dei record, è possibile utilizzare anche la "Procedura guidata per spostamento pagina". Consente di riposizionare una pagina graficamente, piuttosto che utilizzare il concetto di "Incolla dentro" e "Incolla dopo".

# _move_el_pages.seeAlso
source: xMOD_csh_corebe:move_el_cs, xMOD_csh_corebe:new_pages, Moving pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
ar: xMOD_csh_corebe:new_regularar, xMOD_csh_corebe:new_ce, كيفية إنشاء صفحة جديدة <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
fr: xMOD_csh_corebe:move_el_cs, xMOD_csh_corebe:new_pages, Déplacement de pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/
it: xMOD_csh_corebe:move_el_cs, xMOD_csh_corebe:new_pages, Spostare pagine | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/NewPage/

# move_el_pages.image_descr
source: The wizard works like when you create new pages with the wizard; You position the element by the grey arrows. To access the "Move page wizard" you open the clickmenu of the page, select "More options..." and then "Move page". Alternatively you can click the "Move page" icon in the "Extended view" of the Web>List module.
ar: يعمل المعالج مثل عندما تنشئ صفحات جديدة مع المعالج؛ يمكنك وضع العنصر عن طريق الأسهم الرمادية. للوصول إلى "معالج الصفحة" يمكنك فتح القائمة بالنقر على الصفحة، حدد "خيارات أكثر". ثم "نقل الصفحة". بدلاً من ذلك يمكنك النقر على أيقونة "نقل الصفحة" في "العرض الموسع" على الويب>وحدة القائمة.
fr: L'assistant fonctionne comme quand vous créer de nouvelles pages avec cet assistant ; vous positionnez l'élément avec les flèches grises. Pour accéder à l'"Assistant de déplacement de page", vous ouvrez le menu contextuel de la page, sélectionnez "Plus d'options", puis "Déplacer la page". Vous pouvez aussi cliquer sur l'icône "Déplacer la page" dans la "Vue étendue" du module WEB>Liste.
it: La procedura guidata funziona come quando si creano nuove pagine; si posiziona l'elemento servendosi delle frecce. Per accedere alla procedura guidata "Sposta pagina" fai clic sul bottone "Sposta pagina" nella "Vista estesa" del modulo Web>Lista, in corrispondenza della pagina da spostare.

# move_el_cs.alttitle
source: Move Content Element Wizard
ar: نقل معالج عنصر محتوى جديد
fr: Assistant de déplacement de contenu
it: Procedura guidata per spostamento contenuto

# move_el_cs.description
source: By this wizard you can visually re-position (or copy) a Content Element inside TYPO3. The element you move is shown in the top.
ar: من خلال هذا المعالج يمكنك إعادة وضع (أو نسخ) صفحة داخل TYPO3. العنصر الذي تقوم بنقله يظهر في الأعلى.
fr: Grâce à cet assistant, vous pouvez re-positionner visuellement (ou copier) un élément de contenu dans TYPO3. L'élèment que vous déplacer est affiché en haut.
it: Con questa procedura guidata puoi riposizionare (o copiare), graficamente, un elemento di contenuto all'interno di TYPO3. L'elemento che devi spostare viene mostrato in alto.

# move_el_cs.details
source: By the grey icons in the content element list you can point out the new position of the content element. If you need to move the element to another page, simply browse the page tree in the bottom of the wizard.
ar: من خلال الرموز الرمادية في قائمة عناصر المحتوى يمكنك الإشارة إلى الموضع الجديد لعنصر المحتوى. إذا كنت بحاجة إلى نقل العنصر إلى صفحة أخرى، ببساطة تصفح شجرة الصفحة في أسفل المعالج.
fr: Avec les icônes grises dans la liste des éléments de contenu, vous pouvez pointer la nouvelle position de l'élément de contenu. Si vous avez besoin de déplacer l'élément vers une autre page, naviguer dans l'arborescence au bas de l'assistant.
it: Con le icone freccia, nella lista degli elementi di contenuto, puoi indicare la nuova posizione dell'elemento di contenuto. Se è necessario spostare l'elemento in un'altra pagina, basta sfogliare l'Albero delle Pagine, in basso nella schermata della procedura guidata.

# move_el_cs.image_descr
source: The wizard works like when you create new Content Elements with the wizard; You position the element by the grey arrows. To access the "Move Content Element Wizard" you click the "Move element" icon in the "Extended view" of the Web>List module.
ar: يعمل المعالج مثل عندما تنشئ عناصر محتوى جديدة مع المعالج؛ يمكنك وضع العنصر عن طريق الأسهم الرمادية. للوصول إلى "معالج عنصر المحتوى" انقر فوق أيقونة "نقل العنصر" في "العرض الموسع" على الويب>وحدة القائمة.
fr: L'assistant fonctionne comme quand vous créer de nouveaux éléments de contenu avec cet assistant ; vous positionnez l'élément avec les flèches grises. Pour accéder à l'"Assistant de déplacement de contenu", vous cliquez sur l'icône "Déplacer l'élément" dans la "Vue étendue" du module WEB>Liste.
it: La procedura guidata funziona come quando si creano nuovi elementi di contenuto; si posiziona l'elemento servendosi delle frecce. Per accedere alla "Procedura guidata per spostamento contenuto" fai clic sull'icona "Sposta elemento di contenuto" nella "Vista estesa" del modulo Web>Lista.

# history_log.alttitle
source: History log
ar: سجل المحفوظات
fr: Journal d'historique
it: Cronologia modifiche

# history_log.description
source: The History log gives you a visual overview of the changes that has happened to the element over the last editing operations. You can roll back changes to any state by using the icons in the interface.
ar: السجل المحفوظات يعطيك لمحة مرئية عن التغييرات التي حدثت للعنصر خلال عمليات التحرير السابقة. يمكنك مسح التغييرات إلى أي حالة باستخدام الأيقونات الموجودة في الواجهة.
fr: Le journal d'historique vous donne un aperçu des modifications qui ont été apportées aux éléments pendant les dernières opérations d'édition. Vous pouvez revenir aux états précédents en utilisant les icônes de l'interface.
it: La "Cronologia modifiche" fornisce una panoramica delle modifiche all'elemento durante le ultime operazioni. È possibile ripristinare le modifiche a qualsiasi stadio, utilizzando l'azione "Ripristina modifiche".

# history_log.details
source: By default 20 states of history data is preserved in TYPO3 and after a week it expires. The history is very useful for tracking changes to a record since you can see which user did what at which point in time - and roll back any changes you didn't like. If you click the roll-back pencil you will revert the element to the state it had at that particular time. If you click the Info icon you will see in detail what the difference is from current time to this state of the element. <b>Configuring levels and expire times [for admins]</b> If you want to extend the number of history states to above the default 20 you can easily do so using Page TSconfig - meaning that it can even depend on the branch of the page tree where the record is stored! See link below. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ar: يتم بشكل افتراضي حفظ 20 حالة من بيانات السجل في TYPO3 وبعد أسبوع تنتهي صلاحيتها. السجل مفيد جدا لتتبع التغييرات إلى السجل حيث يمكنك أن ترى أي مستخدم قام بما في ذلك الوقت - وإعادة أي تغييرات لا ترغب فيها. إذا نقرت على السهم الدائري سوف تعيد العنصر إلى الحالة التي كان لديها في ذلك الوقت بالذات. إذا نقرت على أيقونة المعلومات سوف ترى بالتفصيل الفرق من الوقت الحالي إلى هذه الحالة من العنصر. <b>تكوين المستويات ووقت انتهاء الصَّلاحِيَة [للمشرفين]</b> إذا كنت ترغب في توسيع عدد حقول السجل إلى أعلى من 20 الافتراضي، يمكنك بسهولة فعل ذلك باستخدام صفحة TSconfig - بمعنى أنه يمكن أن يعتمد على فرع صفحة شجرة حيث يتم تخزين السجل! راجع الرابط أدناه. <b>إشعار:</b> إذا كنت لا ترى قيم فرق أحمر/أخضر، الخادم TYPO3 يعمل لا يدعم عرض الفرق أو أنه تم تكوينه بشكل غير صحيح لتوفير هذه المِيزة.
fr: Par défaut, 20 états dans l'historique sont préservés dans TYPO3 et après une semaine, ils expirent. L'historique est très utile pour chercher les changements d'un enregistrement puisque vous pouvez voir quel utilisateur a fait quoi à quel moment - et revenir si un changement ne vous convient pas. Si vous cliquez sur l'icône de retour à l'état précédent, vous ferez revenir l'élément dans l'état dans lequel il était à ce moment-là. Si vous cliquez sur l'icône d'information, vous verrez en détail quel est la différence entre maintenant et l'état de l'élément. <b>Configurer les niveaux et la date d'expiration [pour les administrateurs]</b> Si vous voulez augmenter le nombre d'états dans l'historique à plus de 20 par défaut, utilisez Page TSconfig - ce qui veut dire que ça peut dépendre de la branche de l'arborescence où l'enregistrement est fait! Voir lien ci-dessous. <b>note</b> Si vous ne voyez pas les différences de valeur en rouge/vert, le serveur TYPO3 ne supporte pas l'affichage des différences ou a été mal configuré pour fournir cette fonctionnalité.
it: TYPO3 conserva fino a 20 stadi di modifica e dopo una settimana vengono considerati scaduti. La cronologia è molto utile per tracciare i cambiamenti di un record, in quanto puoi vedere quale utente ha fatto "cosa" e "in quale momento" preciso; puoi ripristinare le modifiche che non andavano fatte. Se fai clic sulla icona di "Ripristina modifiche" si ripristinerà l'elemento allo stato che aveva in quel particolare momento. <b>Configurare il numero degli stadi conservati e i tempi di scadenza [per amministratori]</b> Se si desidera estendere il numero di stadi di cronologia al di sopra del valore predefinito 20, si può facilmente farlo utilizzando il TSconfig di Pagina; il che significa che può dipendere dal ramo dell'albero delle pagine dove è memorizzato il record! Vedi il collegamento qui sotto. <b>Nota:</b> se non vedi valori di differenza rosso/verde, il server, sul quale TYPO3 è eseguito, non supporta la creazione e visualizzazione delle differenze o è stato configurato in modo errato per fornire questa funzionalità.

# _history_log.seeAlso
source: xMOD_csh_corebe:history_sum, Configuring History using Page TSconfig | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Mod/ Undo/History article | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
ar: xMOD_csh_corebe:history_sum، تكوين التاريخ باستخدام صفحة TSconfig <unk> https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Mod/ Undo/History مقالة <unk> https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
fr: xMOD_csh_corebe:history_sum, Configuration de l'historique en utilisant Page TSconfig | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Mod/ Fonctionnalité Annuler/Historique | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
it: xMOD_csh_corebe:history_sum, Configurare la cronologia utilizzando TSconfig di Pagina | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/Mod/ Articolo su Annulla/Cronologia | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/

# history_log.image_descr
source: You can access the History/Undo log from the Web>List module when in "Extended view" mode. Alternatively you can access it under "More options..." in the clickmenu of an element. The History log shows visually the changes between each step of editing.
ar: يمكنك الوصول إلى سجل المحفوظات/التراجع من ويب>قائمة الوحدة عندما تكون في وضع "العرض المُوسّع". بدلاً من ذلك يمكنك الوصول إليه تحت "خيارات إضافية. " في القائمة بالنقر لعنصر ما. سجل التاريخ يظهر بصرياً التغييرات بين كل خطوة من خطوات التحرير.
fr: Vous pouvez accéder au log d'historique/annulation depuis le module WEB>Liste en mode "vue étendue". Vous pouvez aussi y accéder sous "Plus d'options…" dans le menu contextuel d'un élément. Le log d'historique montre visuellement les changements entre chaque étape d'édition.
it: È possibile accedere al log della Cronologia/Annulla dal modulo Web>Lista, con la "Vista estesa" attiva. In alternativa, è possibile accedervi dal menù contestuale. La cronologia modifiche mostra graficamente i cambiamenti tra ogni stadio di modifica.

# history_sum.alttitle
source: History Summary
ar: ملخص المحفوظات
fr: Résumé d'historique
it: Sommario Modifiche

# history_sum.description
source: This shows the total difference between the selected state in history to the current state of this element.
ar: هذا يظهر الفرق الإجمالي بين الحالة المحددة في المحفوظات والوضع الحالي لهذا العنصر.
fr: Ceci montre la différence totale entre l'état d'historique sélectionné et l'état actuel d'un élément.
it: Questo mostra la differenza totale tra lo stadio selezionato e il valore corrente di questo elemento.

# history_sum.details
source: You can browse forth and back in the history using the arrow buttons in the upper left corner. You can also save a state in history by the little "disk-icon". Finally you can revert either the whole record to this state in history by the revert icon in the top <em>or</em> you can revert only a single field if you like to by clicking the revert icon displayed for each field. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ar: يمكنك التصفح إلى الأمام والعودة في المحفوظات باستخدام أزرار الأسهم في الزاوية اليسرى العلوية. يمكنك أيضاً حفظ حالة في التاريخ بواسطة "disk-icon" الصغيرة. أخيرا يمكنك إرجاع السجل بِرُمَّته إلى هذه الحالة في التاريخ عن طريق أيقونة الرجوع في أعلى <em>أو</em> يمكنك إرجاع حقل واحد فقط إذا كنت ترغب في النقر على أيقونة الرجوع المعروضة لكل حقل من الحقول. <b>إشعار:</b> إذا كنت لا ترى قيم الاختلاف الأحمر / الأخضر، الخادم TYPO3 يعمل لا يدعم عرض الفرق أو أنه تم تكوينه بشكل غير صحيح لتوفير هذه المِيزة.
fr: Vous pouvez naviguer en avant et en arrière dans l'historique en utilisant les flèches en haut à gauche. Vous pouvez aussi sauvegarder l'historique avec le petit icône de disque. Finalement, vous pouvez revenir pour l'ensemble de l'enregistrement à cet état de l'historique avec l'icône en haut <em>ou</em> vous pouvez revenir seulement pour un champ en cliquant sur l'icône affiché pour chaque champ. <b>note</b> Si vous ne voyez pas de différences en rouge/vert, le serveur sur lequel TYPO3 fonctionne ne supporte pas l'affichage des différences ou a été mal configuré pour fournir cette fonctionnalité.
it: È possibile navigare avanti e indietro nella cronologia utilizzando i pulsanti freccia nell'angolo in alto a sinistra. È anche possibile salvare uno stadio nella cronologia utilizzando la "icona-disco". Infine è possibile ripristinare l'intero record in questo stadio nella cronologia, tramite l'icona di ripristino nella parte superiore <em>oppure</em> è possibile ripristinare un singolo campo, se lo desideri, facendo clic sull'icona di ripristino visualizzata per ogni campo. <b>Nota:</b> se non vedi valori di differenza rosso/verde, il server, su cui viene eseguito TYPO3, non supporta la visualizzazione delle differenze o è stato configurato in modo errato per fornire questa funzione.

# _history_sum.seeAlso
source: xMOD_csh_corebe:history_entry, Undo/History article | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
ar: xMOD_csh_corebe:history_entry, Undo/History مقالة <unk> https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
fr: xMOD_csh_corebe:history_entry, Fonctionnalité Annuler/Historique | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/
it: xMOD_csh_corebe:history_entry, Articolo su Annulla/Cronologia | https://typo3.org/documentation/tips-tricks/the-undohistory-feature/

# history_sum.image_descr
source: The Info view of a state in history shows the "sum" of changes from current time to that point in history for the element.
ar: عرض معلومات الحالة في المحفوظات يظهر "sum" للتغيرات من الوقت الحالي إلى تلك النقطة في التاريخ بالنسبة للعنصر.
fr: La vue d'information d'un état de l'historique montre la "somme" des changements depuis maintenant jusqu'au point de l'historique de l'élément.
it: La visualizzazione "Info" di uno stadio nella cronologia, mostra la "somma" delle modifiche dal tempo corrente a quel punto della cronologia per l'elemento.

# history_entry.alttitle
source: Log entry history
ar: محفوظات تسجيل الدخول
fr: Historique des entrées du log
it: Voce cronologia modifiche

# history_entry.description
source: This view displays the changes made to the content element for the log entry you clicked. The red and green values in the text shows the previous/new values of the record.
ar: يعرض هذا العرض التغييرات التي أجريت على عنصر المحتوى لإدخال السجل الذي نقرت عليه. القيم الحمراء والخضراء في النص تظهر القيم السابقة/الجديدة للسجل.
fr: Cet affichage montre les changements d'élément de contenu pour l'entrée du log que vous avez cliqué. Les valeurs en rouge et vert dans le texte montre les valeurs précédentes/suivantes de l'enregistrement.
it: Questo mostra le modifiche apportate all'elemento di contenuto per la voce di cronologia che hai cliccato. Il valore rosso / verde nel testo mostra, rispettivamente, il valore precedente / nuovo del record.
