Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# bookmarks.details
source: In order to create a bookmark it must be supported by the module you want to create the bookmark to. Whether bookmarks are supported can be seen in the top of a module. If there is a small star icon you can click it to create the bookmark.
ar: من أجل إنشاء إشارة مرجعية يجب أن تكون مدعومة بالوحدة التي تريد إنشاء الإشارة المرجعية إليها. يمكن رؤية ما إذا كانت الإشارات المرجعية مدعومة في الجزء العلوي من الوحدة. إذا كان هناك أيقونة نجمة صغيرة يمكنك النقر عليها لإنشاء الإشارة المرجعية.
fr: Afin de créer un signet, il doit être pris en charge par le module pour lequel vous voulez créer le signet. La prise en charge des signets est indiquée dans la partie supérieure du module. S'il y a une petite étoile, vous pouvez cliquer dessus pour créer le signet.
it: Per creare un segnalibro a un modulo, il modulo stesso deve supportarne la creazione. Se i segnalibri sono supportati può essere visto nell'angolo superiore destro di un modulo. Se c'è una piccola icona a stella puoi cliccarla per creare il segnalibro.

# bookmarks.image_descr
source: To create a bookmark to a page, just click the star icon usually found in the top of pages. You will have to confirm the creation of the bookmark. It is nothing dangerous - only annoying to clean up if you happen to create bookmarks against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the bookmark icon in the toolbar reloading and, after opening the menu, the new entry appear. If you click this entry, you will now jump to the page you created the bookmark from! You can name bookmarks, you can even group them and share them. If you want to edit or delete a bookmark you select the "Edit" checkbox and then click the bookmark icon.
ar: لإنشاء إشارة مرجعية إلى الصفحة، فقط انقر فوق أيقونة النجمة الموجودة عادة في الجزء العلوي من الصفحات. يجب عليك تأكيد إنشاء الإشارة المرجعية. ليس من الخطورة - فقط المزعج تنظيف إذا حدث لك إنشاء إشارات مرجعية ضد إرادتك. فقط إجابة "حسناً" هنا. عندما تجيب عن "موافق" يجب أن ترى أيقونة الإشارات المرجعية على الفور في إعادة تحميل شريط الأدوات وبعد فتح القائمة تظهر الإدخال الجديد. إذا قمت بالنقر على هذا الإدخال، فأنت الآن ستقفز إلى الصفحة التي قمت بإنشاء الإشارة المرجعية منها! يمكنك تسمية الإشارات المرجعية، بل يمكنك تجميعها ومشاركتها. إذا كنت ترغب في تعديل أو حذف إشارة مرجعية فأنت تختار مربع الاختيار "تحرير" ثم انقر فوق أيقونة الإشارة المرجعية.
fr: Afin de créer un signet pour une page, il suffit de cliquer sur l'icône en forme d'étoile qui se trouve généralement en haut des pages. Vous devrez confirmer la création du signet. Il n'y a rien de dangereux, seulement un nettoyage ennuyeux si vous créez des signets par erreur. Il suffit de répondre "OK" ici. Lorsque vous répondez "OK", vous devriez immédiatement voir l'icône du signet dans la barre d'outils se recharger et, après avoir ouvert le menu, la nouvelle entrée apparaît. Si vous cliquez sur cette entrée, vous arriverez sur la page pour laquelle vous avez créé le signet ! Vous pouvez nommer les signets, vous pouvez même les regrouper et les partager. Si vous souhaitez modifier ou supprimer un signet, cochez la case "Modifier" et cliquez ensuite sur l'icône du signet.
it: Per creare un segnalibro a una pagina, basta fare clic sull'icona a stella che di solito si trova in alto. Dovrai confermare la creazione del segnalibro. Non è niente di pericoloso, solo fastidioso se ti capita di creare segnalibri involontariamente. Basta rispondere "OK". Quando rispondi "OK", dovresti vedere, immediatamente, nel menù segnalibri, una nuova icona (l'icona del modulo). Se fai clic su questa icona passerai alla pagina dalla quale hai creato il segnalibro! Puoi rinominare il segnalibro, raggrupparli e condividerli. Se desideri modificare o eliminare una scorciatoia, fai clic su "Modifica segnalibro". Questo ti consentirà di fare alcune modifiche. Puoi anche eliminare una scorciatoia.

# workspaceSelector.alttitle
source: Workspace Selector
ar: مُحدد مساحة العمل
fr: Sélecteur d'espace de travail
it: Selettore Workspace

# workspaceSelector.description
source: By this selectorbox you can switch between the workspaces available to you. When you switch workspace the whole backend will reload.
ar: عن طريق مربع الاختيار هذا، يمكنك التبديل بين مساحات العمل المتاحة لك. عند تبديل مساحة العمل سيتم إعادة تحميل كامل الواجهة الخلفية.
fr: Avec ce sélecteur, vous pouvez changer d'espace de travail qui vous sont disponibles. Quand vous changez d'espace de travail, tout le backend est rechargé.
it: Con questo menù a tendina puoi passare da un workspace a un altro. Quando si cambia workspace l'intero backend verrà ricaricato.

# workspaceSelector.details
source: There are two basic workspace types in TYPO3: The "Live" workspace and a number of "Draft" workspaces. When working in the Live workspace all changes you make will take immediate effect. This is the default and traditional state of operation in TYPO3. When working in a customly created workspaces changes are not applied to the live website but rather made through new versions of any element editable. Since versioning doesn't apply to all elements in TYPO3 there are limitations to what can be done in draft workspaces; Only elements with versioning support can be edited and everything else is read-only. Draft workspaces allow preview in the frontend. When changes are final in a draft workspace they can be published into the live workspace.
ar: وهناك نوعان أساسيان من مساحات العمل في TYPO3: مساحة العمل "الحية" وعدد من مساحات العمل "المُسَوَّدَة". عند العمل في مساحة العمل المباشرة، ستصبح جميع التغييرات التي تجريها نافذة فوراً. وهذه هي حالة التشغيل الافتراضية والتقليدية في TYPO3. عند العمل في مساحات عمل تم إنشاؤها بشكل عرفي لا تطبق التغييرات على الموقع المباشر بل يتم إجراؤها عن طريق إصدارات جديدة من أي عنصر قابل للتعديل. وبما أن الإصدار لا ينطبق على جميع عناصر TYPO3 فإن هناك قيوداً على ما يمكن القيام به في مسودات أماكن العمل؛ فقط العناصر مع دعم الإصدار يمكن تعديلها وكل شيء آخر مقروء فقط. مسودات مساحات العمل تسمح بالمعاينة في الواجهة الأمامية. عندما تكون التغييرات نهائية في مسودة مساحة العمل، يمكن نشرها في مساحة العمل الحية.
fr: Il existe deux types d'espace de travail de base dans TYPO3 : L'espace de travail "Live" et un certain nombre d'espaces de travail "Brouillon". Lorsque vous travaillez dans l'espace de travail "Live", toutes les modifications que vous apportez prennent immédiatement effet. C'est l'état de fonctionnement par défaut et traditionnel dans TYPO3. Lorsque vous travaillez dans un espace de travail "brouillon" créé sur mesure, les modifications ne sont pas appliquées au site web en direct mais sont plutôt apportées par le biais de nouvelles versions de tout élément modifiable. Comme le versionnage ne s'applique pas à tous les éléments de TYPO3, il y a des limites à ce qui peut être fait dans les espaces de travail "brouillon" ; seuls les éléments avec un support de versionnage peuvent être édités et tout le reste est en lecture seule. Les espaces de travail "brouillon" créés sur mesure permettent une prévisualisation dans le frontend. Lorsque les modifications sont finalisées dans un espace de travail "brouillon", elles peuvent être publiées dans l'espace de travail "Live".
it: Ci sono due tipi di workspace di base in TYPO3: il workspace Live e una serie di workspace "Bozza". Quando si lavora nel workspace Live, tutte le modifiche apportate avranno effetto immediato. Questo è lo stato di funzionamento predefinito e tradizionale in TYPO3. Quando si lavora in uno workspace creato in modo personalizzato, le modifiche non vengono applicate al sito web direttamente, ma creano nuove versioni di un qualsiasi elemento modificabile. Dal momento che la gestione della versione non si applica a tutti gli elementi in TYPO3, ci sono limitazioni a ciò che può essere fatto nei workspace di bozza. Solo gli elementi che supportano la gestione della versione, possono essere modificati e tutto il resto è in sola lettura. I workspace bozza consentono l'anteprima nel frontend. Quando le modifiche sono finali in un workspace bozza, possono essere pubblicati nello workspace Live.

# _list_clipboard.seeAlso
source: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filelist_clipboard, Using the clipboard | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/UsingTheListModuleEffectively/ Numeric Clipboard pads | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/TheNumericClipboardPads-ManagingManyElements/ Clipboard details [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/, Accessing clipboard in scripts [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/Clipboard/
fr: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filelist_clipboard, Utilisation du presse-papiers | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/UsingTheListModuleEffectively/ Pads du presse-papier numérique | https://docs.typo3. rg/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/TheNumericClipboardPads-ManagingManyElements/ Détails du presse-papier [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/, Accéder au presse-papiers en scripts [Technical] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/Clipboard/
it: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filelist_clipboard, Usare la clipboard | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/UsingTheListModuleEffectively/ Clipboard numerata | https://docs.typo3.org/typo3cms/GettingStartedTutorial/TheListModuleAndClipboard/TheNumericClipboardPads-ManagingManyElements/ Dettagli sulla Clipboard [Tecnico] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/, Come accedere alla Clipboard da script [Tecnico] | https://docs.typo3.org/typo3cms/CoreApiReference/ApiOverview/Examples/Clipboard/

# _pagetree_overview.image
source: EXT:frontend/Resources/Public/Images/cshimages/pagetree_overview_1.png
fr: EXT:frontend/Ressources/Public/Images/cshimages/pagetree_overview_1.png

# _TCEforms.image
source: EXT:core/Resources/Public/Images/cshimages/core_30.png, EXT:core/Resources/Public/Images/cshimages/core_29.png, EXT:core/Resources/Public/Images/cshimages/core_32.png, EXT:core/Resources/Public/Images/cshimages/core_33.png, EXT:core/Resources/Public/Images/cshimages/core_31.png,
fr: EXT:core/Resources/Public/Images/cshimages/core_30.png, EXT:core/Resources/Public/Images/cshimages/core_29.png, EXT:core/Resources/Public/Images/cshimages/core_32.png, EXT:core/Resources/Public/Images/cshimages/cshimages/core_33.png, EXT:core/Resources/Public/Images/cshimages/core_31.png,

# .alttitle
source: TYPO3 Core
it: Core di TYPO3

# _shortcuts.seeAlso
source: User TSconfig ->SETUP | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/
it: TSconfig Utente -> IMPOSTA | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/

# _bookmarks.seeAlso
source: User TSconfig ->SETUP | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/
it: TSconfig Utente -> IMPOSTA | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Options/
