Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# perm_module_setting.details
source: Setting permissions is done in five categories for owner / group / everybody so it works much like permissions for files and folders in many operating systems. <b>Show page</b> If set, a user can see the page and its content in the backend. The user can also copy the content but not move, delete or edit. <b>Edit content</b> Allows users to add, delete, change and move records (other than page records) on this page. This permission must be given if users should be allowed to create Content Elements etc. on the page. <b>Edit page</b> Allows a user to edit the page record itself. This could be changing the page title or moving the page to another location. <b>Delete page</b> If set, a user is allowed to delete the page and the content on the page. <b>New pages</b> Allows users to create sub-pages to this page.
ar: يتم تعيين الأُذونات في خمس فئات للمالك / المجموعة / كل شخص لذلك يعمل مثل الأذونات للملفات والمجلدات في العديد من أنظمة التشغيل. <b>إظهار الصفحة</b> إذا تم تعيينها، يمكن للمستخدم رؤية الصفحة ومحتوياتها في الخلفية. يمكن للمستخدم أيضاً نسخ المحتوى ولكن ليس نقله، أو حذفه أو تعديله. <b>تعديل المحتوى</b> يسمح للمستخدمين بإضافة السجلات وحذفها وتغييرها ونقلها في هذه الصفحة (غير سجلات الصفحة). يجب منح هذا الإذن إذا كان يجب السماح للمستخدمين بإنشاء عناصر المحتوى وما إلى ذلك في الصفحة. <b>تعديل الصفحة</b> يسمح للمستخدم بتعديل إعدادات الصفحة نفسها. قد يكون ذلك تغيير عنوان الصفحة أو نقل الصفحة إلى موقع آخر. <b>حذف الصفحة</b> في حالة الضبط، يسمح للمستخدم بحذف الصفحة والمحتوى في الصفحة. <b>صفحات جديدة</b> يسمح للمستخدمين بإنشاء صفحات فرعية لهذه الصفحة.
fr: Définir les permissions se fait en cinq catégories pour le propriétaire/groupe/tous donc ça fonctionne comme les permissions de fichiers et dossiers sur beaucoup d'OS. <b>Afficher la page</b> Si activé, un utilisateur peut voir la page et son contenu dans le backend. L'utilisateur peut aussi copier le contenu mais pas le déplacer, le supprimer ou l'éditer <b>Éditer le contenu</b> Permet aux utilisateurs d'ajouter, de supprimer, de changer et de déplacer des enregistrements (autre que les enregistrements de page) sur cette page. Cette permission doit être donnée si les utilisateurs doivent avoir le droit de créer des éléments de contenu, etc… sur la page. <b>Éditer la page</b> Permet à un utilisateur d'éditer l'enregistrement de page. Ca peut être changer le titre de la page ou déplacer la page ailleurs. <b>Effacer la page</b> Si activé, un utilisateur peut supprimer la page et son contenu. <b>Nouvelles pages</b> Permet aux utilisateurs de créer des sous-pages dans cette page.
it: L'impostazione dei permessi è fatta per proprietario / gruppo / tutti e per cinque azioni (crea, modifica, ...) su pagina e contenuto, in modo che funzioni molto similmente ai permessi per cartelle e file di molti sistemi operativi. <b>Mostra pagina</b> Se impostato, un utente può vedere la pagina e il suo contenuto nel backend. L'utente può anche copiare il contenuto ma non spostare, eliminare o modificare. <b>Modifica contenuto</b> Consente agli utenti di aggiungere, eliminare, modificare e spostare i record (diversi dai record di pagina) nella pagina. Questo permesso deve essere concesso nel caso in cui l'utente deve creare o modificare elementi di contenuto sulla pagina. <b>Modifica pagina</b> Consente all'utente di modificare il record di pagina: cambiare il titolo della pagina, spostare la pagina in un'altra posizione e così via. <b>Elimina pagina</b> Se impostata, un utente può eliminare una pagina e il contenuto in essa. <b>Nuova pagina</b> Consente agli utenti di creare sottopagine alla pagina.

# _perm_module_setting.seeAlso
source: xMOD_csh_corebe:perm_module, User Management Howto | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/
ar: xMOD_csh_corebe:perm_module, إدارة المستخدم Howto <unk> https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/
fr: xMOD_csh_corebe:perm_module, Guide de gestion des utilisateurs | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/
it: xMOD_csh_corebe:perm_module, Come gestire gli utenti | https://docs.typo3.org/typo3cms/GettingStartedTutorial/UserManagement/SettingUpUserPermissions/

# perm_module_setting.image_descr
source: In this matrix you can set permissions for owner, group and everybody in the five categories available.
ar: في هذه المصفوفة يمكنك تعيين الأُذُونات للمالك والمجموعة وكل من ضمن الفئات الخمس المتاحة.
fr: Dans ce tableau, vous pouvez définir les permissions du propriétaire, groupe et tout le monde dans les 5 catégories disponibles.
it: In questa matrice è possibile impostare i permessi per il proprietario, il gruppo e tutti gli altri, per le cinque azioni disponibili.

# filelist_module.alttitle
source: File > Filelist module
ar: مِلَفّ > قائمة الملفات
fr: Module Fichiers>Liste des fichiers
it: Modulo File>Lista File

# filelist_module.description
source: Shows the files and folders from the folder title you have clicked in the folder tree. Click the icons of the files and folders to perform various actions on the elements.
ar: يظهر الملفات والمجلدات من عنوان المجلد الذي نقرت عليه في شجرة المجلدات. انقر على أيقونات الملفات والمجلدات لتنفيذ مختلف الإجراءات على العناصر.
fr: Affiche les fichiers et dossiers à partir du titre du soddier que vous avez cliqué dans l'arborescence des dossiers. Cliquez sur les icônes des fichiers et dossiers pour effectuer diverses actions sur les éléments.
it: Mostra i file e le cartelle della cartella che hai cliccato nell'albero delle cartelle. Fare clic sulle icone dei file e delle cartelle per eseguire varie azioni sugli elementi.

# filelist_module.details
source: The File > Filelist module provides the main interface to the web-based "FTP-features" in TYPO3. Clicking a folder in the navigation frame will display the files in that folder in the list frame to the right. If you click the icon of a file you will see a menu pop up with menu items related to the file or folder. This enables you to edit, rename and copy files to name a few. <b>The "TEMP" folder</b> There is a special folder, the "TEMP" folder. This is meant to be used for temporary uploads of files that are going to be attached to TYPO3 records later. Content in the TEMP folder should be possible to flush once in a while when the folder becomes too crowded with files. So don't store persistent data in there! The actual folder name is actually "_temp_". The interface will just interpret this with "TEMP" in bold. The same applies to folders named "_recycler_" - they will be trash cans in the folder tree.
ar: يوفر المِلَفّ > قائمة الملفات الواجهة الرئيسة إلى "ميزات FTP" على الويب في TYPO3. عند النقر على مجلد في إطار التنقل سيعرض الملفات في ذلك المجلد في إطار القائمة إلى اليمين. إذا قمت بالنقر على أيقونة مِلَفّ ما، سترى قائمة منبثقة مع عناصر القائمة ذات الصلة بالملف أو المجلد. هذا يمكّنك من تعديل الملفات وإعادة تسميتها ونسخها إلى ذكر بعضها. <b>مجلد "TEMP"</b> هناك مجلد خاص، مجلد "TEMP". والغرض من ذلك هو أن تستخدم في عمليات التحميل المؤقتة للملفات التي سيتم إرفاقها بسجلات TYPO3 فيما بعد. يجب أن يكون المحتوى في مجلد TEMP ممكناً للفتح مرة واحدة في وقت عندما يصبح المجلد مزدحماً جداً بالملفات. لذلك لا تقم بتخزين بيانات ثابتة هناك! اسم المجلد الفعلي هو في الواقع "_temp_". ستفسر الواجهة هذا فقط بـ "TEMP" بالخط الداكن. ينطبق الشيء نفسه على المجلدات التي تسمى "_recycler_" - ستكون عملات القمامة في شجرة المجلد.
fr: Le module Fichiers>Liste des fichiers fournit l'interface principale des fonctions similaires à FTP dans TYPO3. Cliquer sur un dossier dans le cadre de navigation affichera les fichiers de ce dossier dans le cadre de liste à droite. Si vous cliquez sur l'icône d'un dossier, vous verrez un menu avec des éléments relatifs à ce fichier ou ce dossier. Cela permet d'éditer, renommer et copier, pour ne citer que quelques actions. <b>Le dossier "TEMP"</b> Il y a un dossier spécial, le dossier "TEMP". Il est utilisé pour les envois de fichiers temporaires qui seront ensuite liés à des enregistrements TYPO3. Le contenu du dossier TEMP devrait être vidé quand le dossier devient plein de fichiers. Donc ne mettez pas de contenu fixe ici ! Le nom du dossier est en fait "_temp_". L'interface l'interprète en "TEMP", en gras. Même chose pour les dossiers "_recycler_" - ce seront des dossiers "corbeille" dans l'arborescence des dossiers.
it: Il modulo "File>Lista File" fornisce l'interfaccia principale per le "funzionalità FTP" via web in TYPO3. Facendo clic su una cartella nel riquadro di navigazione verranno visualizzati i file in quella cartella nel riquadro a destra. Se fai clic sull'icona di un file vedrai apparire un menù con le voci relative al file o alla cartella. Questo consente di modificare, rinominare e copiare i file; per citarne alcuni. <b>La cartella "File temporanei"</b> C'è una cartella speciale, la cartella "File temporanei". Questa è destinata ad essere utilizzata dal sistema, più tardi, per i caricamenti temporanei di file che saranno allegati ai record TYPO3. La cartella "File temporanei" deve poter essere vuotata di tanto in tanto, quando diventa eccessivamente piena di file. Quindi non memorizzare i dati persistenti lì dentro! Il nome della cartella è in realtà "_temp_". L'interfaccia la visualizza con "File temporanei" in grassetto. Lo stesso vale per le cartelle denominate "_recycler_": saranno cestini nell'Albero delle Cartelle.

# _filelist_module.seeAlso
source: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filetree, be_groups:file_mountpoints, sys_filemounts
ar: xMOD_csh_corebe:list_module, xMOD_csh_corebe:filetree, be_groups:file_mountpoint sys_filemounts

# filelist_module.image_descr
source: Here the content of the TEMP folder is shown in the list frame. You can see the filetype, the modification time, size of the file. If you click the filename you will open the file in the browser (if the path is in the web-root). When you click a file icon you see a context menu appear over it. Here you can perform file operations on the item.
ar: يظهر محتوى مجلد TEMP في إطار القائمة. يمكنك مشاهدة المِلَفّ، ووقت التعديل، وحجم المِلَفّ. إذا نقرت على اسم الملف سوف تفتح الملف في المتصفح (إذا كان المسار في web-root). عند النقر على أيقونة مِلَفّ، ترى قائمة السياق تظهر فوقها. هنا يمكنك تنفيذ عمليات المِلَفّ على العنصر.
fr: Ici le contenu du dossier TEMP est affiché dans le cadre de liste. Vous pouvez voir le type de fichier, la date de modification, la taille du fichier. Si vous cliquez sur le nom du fichier, vous ouvrirez le fichier dans le navigateur (si le chemin est dans la racine du site). Quand vous cliquez sur l'icône d'un fichier, vous voyez apparaître au-dessus un menu contextuel. Ici, vous pouvez effectuer des opérations sur l'élément.
it: Qui il contenuto della cartella TEMP è mostrato nel riquadro elenco. È possibile vedere il tipo di file, l'ora di modifica, la dimensione del file. Se fai clic sul nome del file, il file si aprirà nel browser (se il percorso è nel web-root). Quando fai clic su un'icona di un file apparirà un menù contestuale: potrai eseguire operazioni direttamente sul file.

# filelist_clipboard.alttitle
source: Filelist Clipboard
ar: حافظة الملفات
fr: Presse-papier de fichiers
it: Clipboard lista file

# filelist_clipboard.description
source: The TYPO3 clipboard works for files as well as for database records (see the Web>List module). You only need to enable the clipboard if you want to use the numeric clipboard pads.
ar: تعمل حافظة TYPO3 للملفات وكذلك لسجلات قاعدة البيانات (أنظر وحدة ويب>القائمة). تحتاج فقط إلى تمكين الحافظة إذا كنت ترغب في استخدام حوافظ الحافظة الرقمية.
fr: Le presse-papier de TYPO3 fonctionne pour les fichiers comme pour les enregistrements de la base de données (voir le module WEB>Liste). Vous avez seulement besoin d'activer le presse-papier si vous voulez utiliser les multiples presse-papiers.
it: La clipboard di TYPO3 funziona sia per i file che per i record di database (vedi il modulo Web>Lista). È necessario abilitare la clipboard solo se si desidera utilizzare le clipboard numerate.

# _filelist_clipboard.seeAlso
source: xMOD_csh_corebe:list_clipboard, About the Clipboard [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/
ar: xMOD_csh_corebe:list_clipboard, حول الحافظة [Technical] <unk> https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/
fr: xMOD_csh_corebe:list_clipboard, À propos du presse-papier [Technical] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/
it: xMOD_csh_corebe:list_clipboard, La Clipboard [Tecnico] | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/GeneralInterfaceFeatures/Clipboard/

# filelist_clipboard.image_descr
source: This shows the "Normal" pad on the clipboard. Here an image is now stored. The "Thumbnails" button of the clipboard is enabled so you will see the image icon. When the numeric clipboard pads are enabled you will be able to place multiple items on the clipboard at one time. If the items selected are found in the current folder you can also see the selection reflected in the checkboxes of the items. To paste the contents into a file folder you use the paste icons available in the Filelist module.
ar: هذا يظهر لوحة "عادية" على الحافظة. هنا يتم تخزين صورة. زر "الصور المصغّرة" في الحافظة مفعّل لذلك سترى أيقونة الصورة. عندما يتم تمكين منصات الحافظة الرقمية سوف تكون قادراً على وضع عناصر متعددة على الحافظة في وقت واحد. إذا كانت العناصر المحددة موجودة في المجلد الحالي، يمكنك أيضاً رؤية التحديد المنعكس في خانات الاختيار من العناصر. لصق المحتويات في مجلد ملف يمكنك استخدام أيقونات اللصق المتاحة في وحدة Filelist module.
fr: Ça affiche le presse-papier normal. Ici une image est maintenant sauvegardée. Le bouton "vignette" du presse-papier est activé. Quand le presse-papier numérique est activé, vous pouvez placer plusieurs éléments dans le presse-papier en même temps. Si les éléments sélectionnés sont trouvés dans le dossier en cours, vous pouvez aussi voir la sélection reflétée dans les cases à cocher des éléments. Pour coller les contenus dans un dossier, vous utilisez l'icône coller disponible dans le module Liste de fichiers.
it: Questo mostra la clipboard "Normale". Un'immagine è ora memorizzata. Quando una clipboard numerata è selezionata, sarai in grado di copiare più elementi, alla volta, nella clipboard. Per incollare il contenuto in una cartella di file, utilizza il bottone "Incolla il contenuto della clipboard" disponibile nel modulo "Lista File".

# filelist_options.alttitle
source: File > Filelist options
ar: ملف > خيارات قائمة الملفات
fr: Options Fichiers>Liste des fichiers
it: Opzioni di File>Lista File

# filelist_options.description
source: You can enable the display of image thumbnails and show the clipboard if you need to copy/cut/paste multiple files or folders at a time.
ar: يمكنك تفعيل عرض الصور المصغرة وعرض الحافظة إذا كنت بحاجة إلى نسخ/قط/لصق ملفات متعددة أو مجلدات في وقت واحد.
fr: Vous pouvez activer l'affichage des miniatures et du presse-papier si vous avez besoin de copier/couper/coller de multiples fichiers ou dossiers en une fois.
it: Puoi abilitare la visualizzazione delle miniature delle immagini e visualizzare gli appunti se fosse necessario copiare/tagliare/incollare più file o cartelle alla volta.

# filelist_options.image_descr
source: Enabling thumbnails means that all image file types will be displayed with their thumbnails. This makes it easy to browse an archive of files.
ar: تفعيل الصور المصغرة يعني أنه سيتم عرض جميع أنواع ملفات الصور مع الصور المصغرة. وهذا يجعل من السهل تصفح أرشيف الملفات.
fr: Activer les miniatures signifie que tous les fichiers de type image seont affichés avec leur vignette. Cela facilite la navigation dans une archive de fichiers.
it: Abilitare le miniature significa che tutti i file immagine saranno visualizzati con le loro miniature. Questo rende facile sfogliare un archivio di file.

# file_edit.alttitle
source: Editing a file
ar: تعديل ملف
fr: Éditer un fichier
it: Modificare un file

# file_edit.description
source: You can edit the contents of a text file with this dialog.
ar: يمكنك تعديل محتويات مِلَفّ نصي بواسطة مربع الحُوَار هذا.
fr: Vous pouvez éditer les contenus d'un fichier texte avec ce dialogue.
it: Puoi modificare i contenuti di un file di testo.

# file_edit.image_descr
source: The editing form for a file is this simple textarea field. It's nothing fancy and experienced coders will miss such as TAB-functionality, but it can edit a stylesheet if badly needed...
ar: نموذج التعديل لملف، هو حقل نص بسيط. إنه ليس شيئاً رائعاً وسوف يفتقد المبرمجون المتمرسون مثل وظيفة TAB، ولكن يمكنها تعديل ورقة أنماط إذا كانت هناك حاجة ماسة إليها...
fr: Le formulaire d'édition pour un fichier est un simple champ texte. Les codeurs expérimentés n'auront pas de fonctionnalité de tabulation, mais cela permet d'éditer une feuille de style si nécessaire.
it: La form-modifica per un file è questa area di testo. Non è niente di speciale e ai programmatori esperti mancheranno alcune caratteristiche come la tabulazione (tab), ma ti consente di modificare un foglio di stile, se necessario...

# file_new.alttitle
source: Creating a new file or folder
ar: إنشاء ملف أو مجلد جديد
fr: Création d'un nouveau fichier ou dossier
it: Creare un nuovo file o cartella

# file_new.description
source: Create new files and folder inside the folder you have selected.
ar: إنشاء ملفات ومجلد جديد داخل المجلد الذي اخترته.
fr: Créez de nouveaux fichiers et dossiers à l'intérieur du dossier que vous avez sélectionné.
it: Crea nuovi file e cartelle all'interno della cartella selezionata.

# file_newfolder.alttitle
source: Creating a new folder
ar: إنشاء مجلد جديد
fr: Créer un nouveau dossier
it: Creare una nuova cartella

# file_newfolder.description
source: Enter a name for a new file folder in the tree here. If you want to create multiple folders, please select the number of new folders before entering folder names.
ar: أدخل اسم لمجلد مِلَفّ جديد في الشجرة هنا. إذا كنت ترغب في إنشاء مجلدات متعددة، الرجاء تحديد عدد المجلدات الجديدة قبل إدخال أسماء المجلدات.
fr: Entrez un nom pour un nouveau dossier de fichier dans l'arborescence ici. Si vous souhaitez créer plusieurs dossiers, choisissez alors le nombre de dossier que vous voulez avant de les nommer.
it: Inserisci qui un nome per una nuova cartella dell'Albero delle Cartelle. Se desideri creare più cartelle, seleziona il numero di nuove cartelle prima di inserirne i nomi.

# file_newfolder.image_descr
source: To create a new folder you first click the parent folder icon in the folder tree. As the next step you select the number of folders to create and then you enter the new folder names. After pressing the "Create folders" button the folders will appear in the folder tree when you reload it.
ar: لإنشاء مجلد جديد، انقر أولاً فوق رمز المجلد الأصلي في شجرة المجلد. ومن ثم، تحديد عدد المجلدات المراد إنشاؤها، ثم إدخال أسماء المجلدات الجديدة. بعد الضغط على زر "إنشاء مجلدات"، ستظهر المجلدات في شجرة المجلدات عند إعادة تحميلها.
fr: Pour créer un nouveau dossier, vous devez d'abord cliquer sur l'icône du dossier parent dans l'arborescence. Ensuite vous sélectionnez le nombre de dossier à créer et vous renseignez les noms des dossiers. Après l'appui sur le bouton "Créer les dossiers", les dossiers apparaîtront dnas l'arborescence des dossiers quand vous le rechargerez.
it: Per creare una nuova cartella, fai clic sull'icona della cartella nell'albero delle cartelle. Poi seleziona il "Numero di cartelle" da creare e, infine, inserisci i nomi delle nuove cartelle. Dopo aver premuto il bottone "Crea cartelle" le cartelle saranno visibili nell'Albero delle Cartelle.

# file_newfile.alttitle
source: Creating a new file
ar: إنشاء ملف جديد
fr: Créer un nouveau fichier
it: Creare un nuovo file

# file_newfile.description
source: Enter a filename here if you want to create a new text-based file. Notice that it must have one of the endings in the list of text-endings shown below (except "php" endings).
ar: أدخل اسم المِلَفّ هنا إذا كنت ترغب في إنشاء مِلَفّ نصي جديد. لاحظ أنه يجب أن يكون لديها واحدة من نهايات قائمة نهايات النصوص الموضحة أدناه (باستثناء نهايات "php").
fr: Entrez un nom de fichier ici si vous souhaitez créer un nouveau fichier texte. Notez qu'il doit avoir une des extensions dans la liste des extensions texte ci-dessous (sauf l'extension "php").
it: Inserisci un nome file se vuoi creare un nuovo file di tipo testo. Nota che il nome file deve avere, come estensione file, una presente nell'elenco mostrato sotto ("php" esclusa).

# file_newfile.details
source: Newly created files will have the size of 0 (zero). After creating a new file it would be natural that you wanted to edit the file to put content into it. This is done simply by clicking the icon of the file and select "Edit" from the clickmenu.
ar: الملفات التي تم إنشاؤها حديثاً سيكون حجمها 0 (صفر). بعد إنشاء مِلَفّ جديد سيكون من الطبيعي أن ترغب في تعديل المِلَفّ لوضع المحتوى فيه. يتم ذلك ببساطة بالنقر على أيقونة المِلَفّ وتحديد "تعديل".
fr: Les fichiers nouvellement créés ont une taille à 0. Après la création d'un fichier, il serait naturel que vous vouliez ajouter du contenu dedans. Ça se fait en cliquant sur l'icône du fichier et en sélectionnant "Édition" dans le menu contextuel.
it: I file appena creati avranno la dimensione 0 (zero). Dopo aver creato un nuovo file sarebbe opportuno inserire il il contenuto voluto e necessario. Questo viene fatto semplicemente facendo clic sull'icona del file e selezionando "Modifica" dal menù contestuale.

# file_newfile.image_descr
source: To create a new file, first click the folder icon where you want to create the file. Select "New". Then enter the filename in the dialog in the right frame. After pressing "Create file" you will see a new, empty file in the folder you selected.
ar: لإنشاء مِلَفّ جديد، اضغط أولاً على أيقونة المجلد حيث تريد إنشاء المِلَفّ. حدد "جديد". ثم أدخل اسم المِلَفّ في مربع الحُوَار في الإطار الصحيح. بعد الضغط على "إنشاء مِلَفّ" سترى ملفا جديداً فارغاً في المجلد الذي اخترته.
fr: Pour créer un nouveau fichier, cliquer d'abord sur l'icône du dossier dans lequel vous voulez créer le fichier. Sélectionnez "Nouveau". Ensuite, entrez le nom dans le dialogue du cadre droit. Après avoir appuyé sur "Créer fichier", vous verrez un nouveau fichier vide dans le dossier sélectionné.
it: Per creare un nuovo file, fai clic sull'icona della cartella in cui desideri creare il file. Dal menù contestuale seleziona "Nuovo". Inserisci il nome del file in "Nome file" nel riquadro a destra. Dopo aver premuto "Crea file" vedrai un nuovo file vuoto nella cartella selezionata.

# file_newMedia.alttitle
source: Adding a new media asset
ar: إضافة وسائط جديدة
fr: Ajout d'un nouveau média
it: Aggiungere una nuova risorsa multimediale

# file_newMedia.description
source: Enter an URL to a media asset here. Notice that it must be from one of the allowed providers listed below.
ar: أدخل عنوان URL للوسائط هنا. لاحظ أنه يجب أن يكون من أحد مقدمي الخِدْمَات المسموح بهم المدرجة أدناه.
fr: Entrez ici l'URL d'un média. Notez qu'elle doit provenir de l'un des fournisseurs autorisés listés ci-dessous.
it: Inserisci qui un URL per una risorsa multimediale. Nota che deve essere da uno dei provider consentiti elencati di seguito.

# file_rename.alttitle
source: Rename a file or folder
ar: إعادة تسمية ملف أو مجلد
fr: Renommer un fichier ou un dossier
it: Rinominare un file o una cartella
