Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_csh_corebe.xlf
Languages: ar, fr, it

# .description
source: TYPO3 is a Content Management Framework which consists of a central program core with only limited functionality. To extend this core system there are hundreds of extensions which in combination will provide a very capable system.
ar: TYPO3 هو نظام لإدارة المحتوى يتكون من نواة برنامج مركزية ذات وظائف محدودة فقط. لتوسيع هذا النظام الأساسي، هناك المئات من الإضافات التي ستُوفّر مجتمعةً نظاماً قويّاً للغاية.
fr: TYPO3 est un Gestionnaire de Contenu fondé sur un programme central "core" avec juste des fonctions limitées. Pour étendre ce système "core" il y a des centaines d'extensions qui une fois combinées fournissent un système surpuissant.
it: TYPO3 è un Content Management Framework che consiste in un "core" centrale con limitate funzionalità. Per estendere questo nucleo centrale esistono centinaia di estensioni che, in differenti combinazioni, renderanno questo sistema molto potente.

# .details
source: For most people TYPO3 is equivalent to a CMS providing a backend for management of the content and a frontend engine for website display. However TYPO3s core is natively designed to be a general purpose framework for management of database content. The core of TYPO3 delivers a set of principles for storage of this content, user access management, editing of the content, uploading and managing files etc. Many of these principles are expressed as an API (Application Programmers Interface) for use in the <em>extensions</em> which ultimately adds most of the real functionality.
ar: بالنسبة لمعظم الناس، فإن TYPO3 يُمثّل الـ CMS الذي يوفر واجهة خلفية لإدارة المحتوى ومحرك الواجهة الأمامية لعرض مواقع الويب. ومع ذلك، تم تصميم TYPO3 في الأصل ليكون إطار عمل للأغراض العامة لإدارة محتوى قاعدة البيانات. يوفر جوهر TYPO3 مجموعة من المبادئ لتخزين هذا المحتوى، وإدارة وصول المستخدم ، وتحرير المحتوى، وتحميل الملفات وإدارتها، وما إلى ذلك. يتم التعبير عن العديد من هذه المبادئ كواجهة برمجة تطبيقات (API) لاستخدامها في <em>الإضافات</em> والتي تضيف في النهاية معظم الوظائف الحقيقية.
fr: Pour la plupart des gens TYPO3 est un Gestionnaire de Contenu fournissant un backend pour gérer le contenu et l'affichage d'un site. Cependant TYPO3 est conçu nativement pour être une boîte à outil pour gérer le contenu d'une base de données. TYPO3 fournit des principes pour l'enregistrement de ces contenus, la gestion des autorisations des utilisateurs, l'édition du contenu, le transfert et la gestion des fichiers, etc... La plupart de ces principes sont en fait une API (Application Programming Interface) utilisée dans des <em>extensions</em> qui ajoutent la plupart des fonctionnalités réelles.
it: Per molte persone, TYPO3 è l'equivalente di un CMS che fornisce un backend per la gestione dei contenuti e un motore di frontend per la visualizzazione di siti web. Comunque il core di TYPO3 è stato progettato nativamente per essere un framework per scopi generici, per la gestione di contenuti di database. Il core di TYPO3 definisce un insieme di principi per la memorizzazione dei contenuti, la gestione degli accessi utente, la modifica dei contenuti, il caricamento e la gestione dei file, ecc. Molti di questi principi vengono realizzati come API (Application Programmers Interface) per l'uso nelle <em>estensioni</em> che alla fine aggiungono molte delle reali funzionalità.

# _.seeAlso
source: Inside TYPO3 | https://docs.typo3.org/typo3cms/InsideTypo3Reference/
ar: داخل الـ TYPO3 | https://docs.typo3.org/typo3cms/InsideTypo3Reference/
fr: À l'intérieur de TYPO3 | https://docs.typo3.org/typo3cms/InsideTypo3Reference/
it: Dentro TYPO3 CMS | https://docs.typo3.org/typo3cms/InsideTypo3Reference/

# .image_descr
source: TYPO3 backend login screen.
ar: شاشة تسجيل الدخول إلى TYPO3.
fr: Ecran de connexion à l'interface d'administration de TYPO3.
it: Schermata di login al backend di TYPO3 (versione 3.6.1, estate 2004)

# menu_modules.alttitle
source: Backend modules
ar: وحدات الواجهة الخلفية
fr: Modules d'administration
it: Moduli del Backend

# menu_modules.description
source: The Backend menu reflects the hierarchy of main- and sub-modules in TYPO3. Click a menu item to access the corresponding module.
ar: تعكس قائمة الواجهة الخلفية التسلسل الهرمي للوحدات الرئيسية والفرعية في TYPO3. انقر فوق عنصر قائمة للوصول إلى الوحدة المقابلة.
fr: Le menu d'administration reflète la hiérarchie des modules principaux et secondaires de TYPO3. Cliquez sur un élément du menu pour accéder au module correspondant.
it: Il menù del Backend rispecchia la gerarchia delle aree e dei moduli di TYPO3. Clicca su una voce per accede al modulo corrispondente.

# menu_modules.details
source: Backend Users might see different menu items depending on their access permissions. The "Admin" user on a system will always see all modules available. You can configure the backend to display the menu in two alternative versions (useful on smaller screens); As a selector box or list of icons in the top frame of the backend. When you click the little "+" or "-" icons next to the main modules, you can collapse (-) or expand (+) all the sub modules. By selecting the "Expand all" check box, all items are expanded. When the checkbox is unselected again, the menu changes back to the previous folding state. If you click "Expand all" and collapse a main module afterwards, the previous folding state is discarded and "Expand all" is unselected again.
ar: قد يرى مستخدمو الواجهة الخلفية عناصر قائمة مختلفة اعتماداً على أُذُونات الوصول الخاصة بهم. المستخدم "المشرف" على النظام سيرى دائماً جميع الوحدات المتاحة. يمكنك تكوين الواجهة الخلفية لعرض القائمة في نسختين بديلتين (مفيدة على شاشات أصغر)؛ كمربع محدد أو قائمة من الأيقونات في الجزء العلوي من الواجهة الخلفية. عند النقر فوق الرموز الصغيرة "+" أو "-" بجانب الوحدات الرئيسية، يمكنك تصغير (-) أو توسيع (+) جميع الوحدات الفرعية. من خلال تحديد مربع الاختيار "توسيع الجميع"، يتم توسيع جميع العناصر. عندما يكون مربع الاختيار غير محدد مرة أخرى، تتغير القائمة مرة أخرى إلى حالة الطباعة السابقة. إذا قمت بالنقر فوق "توسيع الكل" وتصغير وحدة رئيسية بعد ذلك، يتم تجاهل حالة الطباعة السابقة و "توسيع الكل" غير محدد مرة أخرى.
fr: Les utilisateurs du backend peuvent voir différents menus en fonctions de leurs permissions. L'utilisateur "Admin" d'un système verra toujours tous les modules disponibles. Vous pouvez configurer le backend pour afficher le menu dans deux versions différentes (utile pour les petits écrans). Comme menu déroulant ou liste d'icône dans le cadre du haut. Quand vous cliquez sur les petits icônes "+" et "-" à côté d'un module principal, vous pouvez plier ("-") ou déplier ("+") tous les sous-modules. En sélectionnant la case à cocher "Déplier tout", tous les éléments sont dépliés. Quand la case à cocher est dé-sélectionnée, le menu revient à l'état précédent. Si vous cliquez sur "Déplier tout" et plier ensuite un module, l'état précédent est annulée et "Déplier tout" est dé-sélectionnée à nouveau.
it: Gli utenti di backend potrebbero vedere diverse voci di menù a seconda dei loro permessi di accesso. L'utente "Admin" su un sistema vedrà sempre tutti i moduli. È possibile configurare il backend per visualizzare il menù in due versioni alternative (utili su piccoli schermi); Come casella di selezione o elenco di icone nel riquadro superiore del backend. Quando clicchi sul nome dell'area, puoi, alternativamente, contrarre o espandere tutti i moduli contenuti.

# _menu_modules.seeAlso
source: be_groups:groupMods, be_users:userMods, More about Modules | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/Index.html
ar: be_groups:groupMods, be_users:userMods, للمزيد حول الوحدات | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/Index.html
fr: be_groups:groupMods, be_users:userMods, En savoir plus sur les Modules | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/Index.html

# menu_modules.image_descr
source: This is the range of menu options for a typical backend user. For another backend user it might be different. This screenshot shows how another user has different permissions set and therefore access to other modules only. Also the backend language has been set different for this user.
ar: هذا هو نطاق خيارات القائمة للمستخدم النموذجي في الواجهة الخلفية. قد يكون مختلفاً لمستخدم آخر في الواجهة الخلفية. تظهر لقطة الشاشة هذه كيف أن مستخدم آخر لديه أُذُونات مختلفة وبالتالي الوصول إلى وحدات أخرى فقط. أيضاً تم تعيين لغة الواجهة الخلفية مختلفة لهذا المستخدم.
fr: C'est le type de menu pour un utilisateur typique du backend. Pour un autre utilisateur, ça pourrait être différent. Cette capture d'écran montre comment un autre utilisateur a des droits différents et donc accède à d'autres modules seulement. La langue du backend a été changé pour cet utilisateur.
it: Questa è la gamma di opzioni del menù per un utente di backend tipico. Per un altro utente di backend potrebbe essere diverso. Questa immagine mostra come un altro utente ha differenti permessi impostati e quindi accede ad altri moduli. Anche la lingua del backend è stata impostata in modo diverso per questo utente.

# menu_adminFunction.alttitle
source: Admin Functions
ar: وظائف المشرف
fr: Fonctions d'administration
it: Funzioni Admin

# menu_adminFunction.description
source: The Admin Functions allow administrators to clear caches etc.
ar: وظائف المشرف تسمح للمشرفين لمسح ذواكر التخزين المؤقت والخ.
fr: Les Fonctions d'administration permettent aux administrateurs de vider le cache etc.
it: Le funzioni di amministratore consentono agli amministratori di svuotare le cache, ecc.

# menu_adminFunction.details
source: TYPO3 has multiple caching systems: <b>Database Cache</b> A very central cache is the database cache table, "cache_hash", which needs to be flushed after certain major changes in the system. You "clear all cache" by clicking the link with the blue icon. After this operation any website content should be re-generated from the sources rather than be delivered from caches. This operation clears <i>all</i> database tables registered as flushable cache tables. <b>Cached PHP configuration files from Extensions</b> TYPO3 also caches small configuration scripts from extensions, "ext_localconf.php" and "ext_tables.php". These files are simply read from all installed extensions and concatenated into temporary PHP scripts found in the typo3temp/Cache/Code/cache_core/ folder. Sometimes you need to remove these files so TYPO3 re-writes them from the originals. This is done by the "Clear temp_CACHED" link. <b>Notice:</b> You should not clear these caches without a second thought. Clearing caches may affect performance on your server negatively for a while. Obviously the cached content has to be regenerated which takes time and under heavy load it might make your server un-available for a while.
ar: يحتوي TYPO3 على أنظمة تخزين مؤقت متعددة: <b>ذاكرة التخزين المؤقت لقاعدة البيانات</b> التخزين المؤقت المركزي هو جدول ذاكرة التخزين المؤقت لقاعدة البيانات، "cache_hash" ، والذي يحتاج إلى مسح بعد عمل تغييرات رئيسية معينة في النظام. يمكنك "مسح كل ذواكر التخزين المؤقت" بالنقر فوق الرابط الذي يحمل الرمز الأزرق. بعد هذه العملية، يجب إعادة إنشاء أي محتوى موقع ويب من المصادر بدلاً من تسليمه من ذاكرات التخزين المؤقت. تمسح هذه العملية <i>كل</i> جداول قاعدة البيانات المُسجلة كجداول ذاكرة التخزين المؤقت flushable. <b>ملفات تكوين PHP المُخزّنة مؤقتاً من الإضافات</b> يخزن TYPO3 أيضاً نصوص تكوين صغيرة من الإضافات، "ext_localconf.php" و "ext_tables.php". تتم قراءتها ببساطة من جميع الإضافات المُثبّتة والمتسلسلة في نصوص PHP المؤقتة الموجودة في المجلد typo3temp/Cache/Code/cache_core/. تحتاج أحياناً إلى إزالة هذه الملفات حتى يعيد TYPO3 كتابتها من الأصل. يتم ذلك عن طريق رابط "Clear temp_CACHED". <b>ملاحظة:</b> يجب ألا تمسح ذواكر التخزين المؤقت دون تفكير. قد يؤثر مسح ذاكرات التخزين المؤقت على أداء الخادم بشكل سلبي لفترة من الوقت. من الواضح أنه يجب إعادة إنشاء المحتوى المخزن مؤقتاً والذي يستغرق وقتاً وتحت الحمل الثقيل قد يجعل خادمك غير متاح لفترة من الوقت.
fr: TYPO3 a de multiples systèmes de cache : <b>Cache Base de données</b> Le cache central est la table de cache de la base de données, "cache_hash", qui a besoin d'être vidée après certains changement du système. Vous videz tous les caches en cliquant sur le lien avec l'icône bleu. Après cette opération, tout contenu du site doit être regénéré depuis les sources plutôt que d'être délivré depuis les caches. Cette opération efface <i>toutes</i> les tables de la bases configurées pour être des tables de cache. <b>Fichiers de configuration PHP des extensions mis en cache</b> TYPO3 met aussi en cache les petits scripts de configuration des extensions, "ext_localconf.php" et "ext_tables.php". Ces fichiers sont simplement lus depuis toutes les extensions installées et concaténés dans un script PHP temporaire dans le dossier typo3conf/, nommés "temp_CACHED_*.php". Parfois vous avez besoin d'effacer ces fichiers donc TYPO3 les re-crée depuis les originaux. Cela se fait en cliquant sur "Vider le cache dans typo3conf/". <b>Note</b> Vous ne devez pas effacer ces caches sans y réfléchir à deux fois. Effacer les caches peut affecter les performances sur votre serveur pour un temps. En plus le cache du contenu doit être régénéré ce qui prend du temps et sous une charge importante, votre serveur pourrait être inaccessible quelques temps.
it: TYPO3 ha più sistemi di manipolazione della cache: <b>Cache del Database</b> La cache centrale è la tabella della cache del database, "cache_hash", che ha bisogno di essere svuotata dopo alcune modifiche importanti nel sistema. Puoi "svuotare tutta la cache" cliccando il link con l'icona blu. Dopo questa operazione qualsiasi contenuto del sito web deve essere rigenerato dalle fonti, invece che essere prelevato dalla cache. Questa operazione svuota <i>tutte le</i> tabelle del database registrate come tabelle cache svuotabili. <b>File di configurazione PHP, da estensioni, memorizzati in cache</b> TYPO3 memorizza anche piccoli script di configurazione da estensioni "ext_localconf. hp" e "ext_tables.php". Questi file sono semplicemente letti da tutte le estensioni installate e concatenati in script PHP temporanei trovati nella cartella typo3temp/Cache/Code/cache_core/. A volte è necessario rimuovere questi file in modo che TYPO3 li riscrive dagli originali. Questo è fatto dal link "Svuota tutte le cache". <b>Nota</b> che non dovresti cancellare queste cache a cuor leggero. La cancellazione delle cache può influire negativamente sulle prestazioni del server per un po'. Ovviamente il contenuto nella cache deve essere rigenerato, il che richiede tempo e il carico potrebbe rendere il server non disponibile per un po'.

# pagetree.alttitle
source: The Page Tree
ar: شجرة الصفحة
fr: L'arborescence des pages
it: L'albero delle Pagine

# pagetree.description
source: This is the hierarchical organization of pages in TYPO3. Typically websites are build so they reflect the page structure in the page tree directly in the website navigation.
ar: هذه هو التسلسل الهرمي للصفحات في TYPO3. عادةً ما يتم بناء المواقع الشبكية بحيث تعكس هيكل الصفحات في شجرة الصفحة مباشرة في تصفح الموقع.
fr: C'est l'organisation hiérarchique des pages dans TYPO3. Typiquement, les sites sont construits afin que leur structure de navigation reflète celle décrite directement dans l'arborescence.
it: Questa è l'organizzazione gerarchica delle pagine in TYPO3. Generalmente i siti sono costruiti in modo da rispecchiare, a livello di navigazione, la struttura delle pagine nell'albero delle pagine

# pagetree.details
source: The page tree works like a file system. Each page is like a directory where you can store files. In TYPO3 you store database records inside of each page. Some of these records, typically called "Content Elements", contains the website content of pages. Other records can be from plugins like a glossary or a guestbook and they are only displayed indirectly by a plugin inserted as a Content Element. Some backend users will see only a part of the page tree for a website. This feature allows the administrator to configure backend users with different responsibilities for maintaining branches of the page tree. <b>Navigating the tree</b> Simply click the +/- buttons to expand and contract the branches of the tree. If you click the page icons you should see a context menu pop up. It will contain options specifically for that page. Clicking the title of a page is another option. It will load the right frame of the Web main module with the selected sub-module. The content shown in the right frame will be related to the page clicked.
ar: تعمل شجرة الصفحة مثل نظام الملفات. كل صفحة تمثل دليل، حيث يمكنك تخزين الملفات. في TYPO3 تُخزَّن سجلات قاعدة البيانات داخل كل صفحة. تحتوي بعض هذه السجلات، التي تسمى عادةً "عناصر المحتوى"، على محتوى صفحات موقع الويب. يمكن أن تكون السجلات الأخرى من مكونات إضافية مثل المسرد أو دفتر الزوار ولا يتم عرضها إلا بشكل غير مباشر بواسطة مكون إضافي مدرج كعنصر محتوى. لن يرى بعض مستخدمي الواجهة الخلفية سوى جزء من شجرة الصفحة لموقع ويب. تسمح هذه المِيزة للمسؤول بتكوين مستخدمي الواجهة الخلفية بمسؤوليات مختلفة للحفاظ على فروع شجرة الصفحة. <b>توجيه الصفحة</b> ما عليك سوى النقر فوق أزرار +/- لتوسيع وتقليص فروع الشجرة. إذا ضغطت فوق رمز الصفحة، فسترى قائمة خيارات مُنبثقة. تحتوي على خيارات خاصة لتلك الصفحة. أما إذا ضغطت فوق عنوان الصفحة، فسيتم تحميل الجزء الأيسر لوحدة الويب الرئيسية مع الوحدة الفرعية المحددة. المحتوى الظاهر في الإطار الأيسر سيكون مرتبطاً بالصفحة التي تم النقر عليها.
fr: L'arborescence des pages fonctionne comme un système de fichier. Chaque page est comme un dossier où vous pouvez stocker des fichiers. Certains de ces enregistrements, typiquement appelé "éléments de contenu", contiennent les contenus de site de chaque page. Les autres enregistrements peuvent être des plugins comme un glossaire ou un livre d'or et ils sont uniquement affichés par un plugin inséré comme élément de contenu. Certains utilisateurs du backend ne verront qu'une partie de l'arborescence du site. Cette fonctionnalité permet à l'administrateur de configurer les utilisateurs du backend avec différentes responsabilités pour maintenir des branches de l'arborescence. <b>Naviguer dans l'arborescence</b> Cliquez simplement sur les boutons +/- pour déplier et plier les branches de l'arborescence. Si vous cliquez sur l'icône de page, vous verrez apparaître un menu contextuel. Il contiendra des options spécifiques pour cette page. Cliquer sur le titre d'une page est une autre option. Cela va charger à droite le cadre du module Web principal avec le sous-module sélectionné. Le contenu affiché dans le cadre à droite sera lié à la page cliquée.
it: L'Albero delle Pagine funziona, concettualmente, come un file system. Ogni Pagina è come una cartella dove è possibile memorizzare i file, nel caso specifico i record. In TYPO3 si "appoggiano" i record del database "sopra" ogni pagina. Alcuni di questi record, tipicamente chiamati "Elementi di Contenuto", contengono la "sostanza" del sito web delle pagine. Altri record possono provenire da plugin come un glossario o un guestbook e sono visualizzati solo indirettamente da un plugin inserito come elemento di contenuto. Alcuni utenti del backend vedranno solo una parte dell'albero delle pagine per un sito web. Questa funzione consente all'amministratore di configurare gli utenti di backend con responsabilità diverse per mantenere distintamente i rami dell'albero delle pagine. <b>Navigazione dell'albero</b> Cliccando sull'icona a triangolo (ruotante), sul lato sinistro del nome Pagina, è possibile contrarre o espandere il ramo, mostrandone o nascondendone i figli. Se fai clic sulle icone della pagina, dovresti vedere apparire un menu contestuale. Contiene opzioni specifiche per quella pagina. Il clic sul titolo di una pagina ha un'altra funzione: caricherà il modulo, dell'area Web, selezionato in quel momento. Il contenuto mostrato nel riquadro destro sarà relativo alla pagina cliccata.

# _pagetree.seeAlso
source: xMOD_csh_corebe:list_module, More about the Page Tree | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageTree/ Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_01.gif Clicking Icons or Titles? (Animation) | FILE:EXT:welcome/modsub/ani_06.gif Creating pages (Animation) | FILE:EXT:welcome/modsub/ani_07.gif Moving pages (Animation) | FILE:EXT:welcome/modsub/ani_08.gif
ar: xMOD_csh_corebe:list_module, المزيد عن شجرة الصفحة <unk> https://docs.typo3.org/typo3cms/GettingStartedtutorial/GeneralPrinciples/PageTree/ باستخدام شجرة الصفحة (المُتَحرّك) <unk> FILE:EXT:welcome/modsub/ani_01. إذا انقر فوق أيقونات أو عناوين؟ (المُتَحرّك) <unk> FILE:EXT:welcome/modsub/ani_06.gif إنشاء صفحات (المُتَحرّك) <unk> FILE:EXT:welcome/modsub/ani_07.gif نقل الصفحات (المُتَحرّك) <unk> FILE:EXT:welcome/modsub/ani_08.gif
fr: xMOD_csh_corebe:list_module, En savoir plus sur l'arborescence des pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageTree/ En utilisant l'arborescence des pages (Animation) | FILE:EXT:welcome/modsub/ani_01. if Cliquer sur les icônes ou les titres ? (Animation) | FILE:EXT:welcome/modsub/ani_06.gif Création de pages (Animation) | FILE:EXT:welcome/modsub/ani_07.gif Déplacement de pages (Animation) | FILE:EXT:welcome/modsub/ani_08.gif
it: xMOD_csh_corebe:list_module, Ancora sull'Albero delle Pagine | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageTree/ Come usare l'Albero delle Pagine (Animazione) | FILE:EXT:welcome/modsub/ani_01.gif Cliccare le Icone o i Titoli? (Animazione) | FILE:EXT:welcome/modsub/ani_06.gif Creare pagine (Animazione) | FILE:EXT:welcome/modsub/ani_07.gif Spostare pagine (Animazione) | FILE:EXT:welcome/modsub/ani_08.gif
