Repository: wwagner-net/git-typo3-demo
Catalog: var/labels/*/core/Resources/Private/Language/*.locallang_core.xlf
Languages: ar, it

# file_upload.overwriteExistingFiles
source: Shall existing files be overwritten?
ar: هل تريد الكتابة فوق الملفات الموجودة؟
it: I file esistenti dovrebbero esser sovrascritti?

# file_upload.header.originalFile
source: Original file
ar: الملف الأصلي
it: File originale

# file_upload.header.uploadedFile
source: Uploaded file
ar: الملفات المُحمّلة
it: File caricato

# file_upload.header.action
source: Action
ar: إجراء
it: Azione

# file_upload.existingfiles.title
source: Some files exist already
ar: بعض الملفات موجودة بالفعل
it: Alcuni file esistono già

# file_upload.existingfiles.description
source: Some files you wanted to upload exist already on the system. Please select what you want to do with each file.
ar: بعض الملفات التي تريد رفعها موجودة بالفعل على النظام. الرجاء تحديد ما تريد القيام به مع كل ملف.
it: Alcuni dei file che intendi caricare esistono già sul sistema. Scegli cosa vuoi fare con ognuno dei file.

# file_upload.actions.skip
source: Skip the file
ar: تخطي الملف
it: Salta il file

# file_upload.actions.rename
source: Rename
ar: إعادة التسمية
it: Rinomina

# file_upload.actions.override
source: Overwrite
ar: الكتابة فوق
it: Sovrascrivi

# file_upload.actions.use_existing
source: Use existing file
ar: استخدم الملف الموجود
it: Usa file esistente

# file_upload.actions.all.label
source: Alternatively, choose a mass action
ar: بدلاً من ذلك، اختر إجراءً شاملاً
it: In alternativa, scegli un'azione di massa

# file_upload.actions.all.empty
source: Please choose
ar: الرجاء الإختيار
it: Scegli per favore

# file_upload.actions.all.skip
source: Skip all files
ar: تخطي جميع الملفات
it: Salta tutti i file

# file_upload.actions.all.rename
source: Rename all files
ar: إعادة تسمية جميع الملفات
it: Rinomina tutti i file

# file_upload.actions.all.override
source: Overwrite all files
ar: الكتابة فوق جميع الملفات
it: Sovrascrivi tutti i file

# file_upload.actions.all.use_existing
source: Use existing files
ar: استخدام الملفات الموجودة
it: Usa i file esistenti

# file_upload.button.cancel
source: Cancel
ar: إلغاء
it: Annulla

# file_upload.button.continue
source: Continue with selected actions
ar: المتابعة مع الإجراءات المُحددة
it: Continua con le azioni selezionate

# file_upload.reload.filelist
source: Reload filelist
ar: إعادة تحميل قائمة الملفات
it: Ricarica Lista File

# file_upload.reload.filelist.message
source: To enable the controls, the filelist has to be reloaded.
ar: لتمكين عناصر التحكم، يجب إعادة تحميل قائمة الملفات.
it: Per abilitare i comandi è necessario ricaricare Lista File.

# file_upload.reload.filelist.actions.dismiss
source: Dismiss
ar: تجاهل
it: Ignora

# file_upload.reload.filelist.actions.reload
source: Reload
ar: إعادة تحميل
it: Ricarica

# file_download.prepare
source: File download is being prepared
ar: يتم إعداد تحميل الملف
it: Il download del file è in fase di preparazione

# file_download.invalidSelection
source: The selected elements can not be downloaded
ar: لا يمكن تحميل العناصر المحددة
it: Gli elementi selezionati non possono essere scaricati

# file_download.success
source: File download successfully prepared
ar: تم إعداد تحميل الملف بنجاح
it: Download file preparato con successo

# file_download.error
source: Could not prepare files for download
ar: تعذر إعداد الملفات للتنزيل
it: Impossibile preparare i file per il download

# file_download.noFiles
source: Could not find any allowed file
ar: تعذر العثور على أي ملف مسموح به
it: Impossibile trovare alcun file consentito

# file_download.noFiles
source: Please check your selection, since there might be file extension limitations, defined by your administrator.
ar: الرجاء التحقق من اختيارك، لأنه قد تكون هناك قيود على ملفات الإضافة، يحددها المسؤول الخاص بك.
it: Controllare la selezione, poiché potrebbero esserci limitazioni di estensione file, definite dall'amministratore.

# file_rename.title
source: Rename
ar: إعادة تسمية
it: Rinomina

# file_rename.label
source: New filename
ar: اسم ملف جديد
it: Nuovo nome file

# file_rename.button.cancel
source: Cancel
ar: إلغاء
it: Annulla

# file_rename.button.rename
source: Rename
ar: إعادة تسمية
it: Rinomina

# online_media.new_media
source: Add new media asset
ar: إضافة وسائط جديدة
it: Aggiungi nuova risorsa multimediale

# online_media.new_media.label
source: Url of remote source
ar: رابط من مَصدر خارجي
it: Url della sorgente remota

# online_media.new_media.allowedProviders
source: Allowed media providers
ar: مُوفِري الوسائط المسموح بهم
it: Provider multimediali consentiti

# online_media.new_media.button
source: Add media by URL
ar: إضافة وسائط باستخدام رابط الـ URL
it: Aggiungi file multimediale da URL

# online_media.new_media.submit
source: Add media
ar: إضافة وسائط
it: Aggiungi contenuto multimediale

# online_media.new_media.added
source: Added media
ar: الوسائط المُضافة
it: Contenuto multimediale aggiunto

# online_media.new_media.placeholder
source: Paste media url here...
ar: لصق رابط الوسائط هنا...
it: Incolla qui l'url del contenuto multimediale...

# online_media.error.new_media.failed
source: Adding media failed
ar: فشل في إضافة الوسائط
it: Aggiunta contenuto multimediale non riuscita

# online_media.error.invalid_url
source: Unknown/not allowed URL
ar: رابط غير معروف/غير مسموح به
it: URL sconosciuta/non consentita

# online_media.error.already_exists
source: Online media "%s" does already exist in this folder.
ar: الوسائط المنشورة "%s" موجودة بالفعل في هذا المجلد.
it: Il media online "%s" esiste già in questa cartella.

# online_media.update.success
source: Successfully updated online media
ar: تم تحديث الوسائط عبر الإنترنت بنجاح
it: Media online aggiornati con successo

# online_media.update.error
source: Error on updating online media
ar: خطأ في تحديث الوسائط عبر الإنترنت
it: Errore nell'aggiornamento dei media online

# file_clipupload.php.warning_head
source: Upload path error
ar: حدث خطأ في مسار ملف التحميل
it: Percorso di caricamento errato

# file_clipupload.php.warning
source: No upload-folder is found. You should create a TEMP-folder ("_temp_") in the root of one of your mounts first!
ar: لم يتم العثور على مجلد التحميل. يجب عليك إنشاء مجلد TEMP-("_temp_") في جذر أحد السجلات الخاصة بك أولاً!
it: Non è stata trovata nessuna cartella per il caricamento. Devi prima creare una cartella TEMP ("_temp_") nella radice di uno dei tuoi Alberi delle Cartelle!

# mess.redraw
source: Redrawing the page will discard the current data. Do you want to continue?
ar: إعادة تخطيط الصفحة ستتجاهل البيانات الحالية. هل تريد الاستمرار؟
it: Ricaricando la pagina cancellerai i dati correnti. Vuoi proseguire?

# mess.delete
source: Are you sure you want to delete '%s'?
ar: هل أنت متأكد من أنك تريد حذف "%s"؟
it: Sei sicuro di voler eliminare '%s'?

# mess.delete
source: Delete this record?
ar: حذف هذا السجل؟
it: Eliminare questo record?

# mess.deleteClip
source: Are you sure you want to delete ALL referenced elements (%s) on the clipboard?
ar: هل أنت متأكد من أنك تريد حذف جميع العناصر المشار إليها (%s) على الحافظة؟
it: Sei sicuro di voler eliminare TUTTI gli elementi (%s) nella clipboard?

# mess.refresh_login
source: Your login has probably expired. Do you want to refresh it now?
ar: ربما انتهت صلاحية تسجيل الدخول الخاص بك. هل تريد تحديثها الآن؟
it: La tua sessione di login è probabilmente scaduta. Vuoi rinnovarla ora?

# mess.refresh_login_refresh_button
source: Stay logged in!
ar: البقاء في تسجيل الدخول!
it: Rimani loggato!

# mess.refresh_direct_logout_button
source: No, log out.
ar: لا، سجّل الخروج.
it: No, esci.

# mess.refresh_login_logging_in
source: Logging in...
ar: جاري تسجيل الدخول...
it: Accesso in corso...

# mess.refresh_login_failed
source: Login failed
ar: فشل تسجيل الدخول
it: Login fallito

# mess.refresh_login_failed_message
source: Password not correct.
ar: كلمة المرور غير صحيحة.
it: Password errata

# mess.refresh_login_title
source: Refresh Login to TYPO3 (User: %s)
ar: تحديث تسجيل الدخول إلى TYPO3 (User: %s)
it: Aggiorna Login TYPO3 (Utente: %s)

# mess.refresh_login_username
source: Username
ar: اسم المستخدم
it: Nome Utente

# mess.refresh_login_password
source: Password
ar: كلمة المرور

# mess.refresh_login_button
source: Login
ar: تسجيل الدخول

# mess.refresh_exit_button
source: Exit
ar: الخروج
it: Esci

# mess.refresh_login_emptyPassword
source: Empty password is not allowed!
ar: غير مسموح بترك كلمة المرور فارغة!
it: Non sono permesse password vuote!

# mess.please_wait
source: Please wait ...
ar: الرجاء الإنتظار...
it: Attendere prego...

# mess.be_locked
source: The TYPO3 backend is currently locked for maintenance. Leave this browser window open and the backend will automatically become available again once maintenance is complete.
ar: الواجهة الخلفية لـ TYPO3 مُقفلة حاليّاً للصيانة. اترك نافذة المُتصفح هذه مفتوحة، وستكون الواجهة الخلفية متاحة تلقائياً من جديد بعد اكتمال الصيانة.
it: Il backend di TYPO3 è attualmente bloccato per manutenzione. Lascia aperta questa finestra del browser e il backend diventerà automaticamente disponibile una volta completata la manutenzione.

# mess.login_about_to_expire
source: Your TYPO3 login is about to expire. Please confirm that you want to stay logged in.
ar: تسجيل الدخول الخاص بك في TYPO3 على وشك الإنتهاء. الرجاء التأكد من أنك تريد البقاء مُسجلاً الدخول.
it: Il tuo login TYPO3 sta per scadere. Per piacere conferma che desideri rimanere loggato.

# mess.refresh_login_logout_button
source: Log me out
ar: سجّل خروجي
it: Termina la sessione

# mess.login_refresh_about_to_expire
source: Your TYPO3 login is about to expire. Please confirm that you want to be logged out.
ar: تسجيل الدخول الخاص بك في TYPO3 على وشك الإنتهاء. الرجاء التأكد من أنك تريد تسجيل الخروج.
it: Il tuo login su TYPO3 sta per scadere. Per favore conferma che vuoi essere scollegato.

# mess.login_about_to_expire_title
source: TYPO3 login expiration notice
ar: إشعار انتهاء صلاحية تسجيل الدخول
it: Notifica di scadenza login TYPO3

# mess.login_expired
source: Your TYPO3 login has expired. You need to login again if you want to continue. Otherwise you can close the current browser window.
ar: انتهت صلاحية تسجيل الدخول الخاص بك. تحتاج إلى تسجيل الدخول مرة أخرى إذا كنت تريد المتابعة. وإلا يمكنك إغلاق نافذة المتصفح الحالية.
it: Il tuo login TYPO3 è scaduto. Devi rifare il login se vuoi continuare. Altrimenti puoi chiudere la finestra del browser.

# mess.noSelItemForEdit
source: Please select one or more items in the list before you can edit.
ar: الرجاء تحديد عنصر واحد أو أكثر في القائمة قبل أن تتمكن من التعديل.
it: Seleziona uno o più oggetti nella lista prima di modificarli.

# mess.refreshRequired.title
source: Refresh required
ar: التحديث مطلوب
it: Aggiornamento richiesto

# mess.refreshRequired.content
source: This change will affect which fields are available in the form. Would you like to save now in order to refresh the display?
ar: سيؤثر هذا التغيير على الحقول المُتاحة في النموذج. هل ترغب في الحفظ الآن من أجل تحديث العرض؟
it: Questa modifica influenzerà la disponibilità dei campi nella form-modifica. Vuoi salvare ora per aggiornare?

# mess.move_into
source: Move "%s" into "%s"?
ar: نقل "%s" إلى داخل "%s"؟
it: Spostare "%s" in "%s"?

# mess.move_into_colPos
source: Move "%1$s" into column "%3$s" on page "%2$s"?
ar: نقل "%1$s" إلى داخل العمود "%3$s" على الصفحة "%2$s"؟
it: Spostare "%1$s" nella colonna "%3$s" nella pagina "%2$s"?

# mess.move_before
source: Move "%s" to before "%s"?
ar: هل تريد نقل "%s" إلى ما قبل "%s"؟
it: Spostare "%s" prima di "%s"?

# mess.move_after
source: Move "%s" to after "%s"?
ar: نقل "%s" إلى ما بعد "%s"؟
it: Spostare "%s" dopo "%s"?

# mess.copy_into
source: Copy "%s" into "%s"?
ar: نسخ "%s" إلى داخل "%s"؟
it: Copiare "%s" in "%s"?

# mess.copy_into_colPos
source: Copy "%1$s" into column "%3$s" on page "%2$s"?
ar: نسخ "%1$s" إلى داخل العمود "%3$s" على الصفحة "%2$s"؟
it: Copiare "%1$s" nella colonna "%3$s" della pagina "%2$s"?

# mess.copy_after
source: Copy "%s" to after "%s"?
ar: نسخ "%s" إلى ما بعد "%s"؟
it: Copiare "%s" dopo "%s"?

# mess.copycb_into
source: Copy all elements (%s) from the clipboard into "%s"?
ar: نسخ جميع العناصر (%s) من الحافظة إلى داخل "%s"؟
it: Copiare tutti gli elementi (%s) dalla clipboard in "%s"?

# mess.copycb_after
source: Copy all elements (%s) from the clipboard to the position after "%s"?
ar: نسخ جميع العناصر (%s) من الحافظة إلى الموضع بعد "%s"؟
it: Copiare tutti gli elementi (%s) dalla clipboard nella posizione dopo "%s"?

# mess.movecb_into
source: Move all elements (%s) from the clipboard into "%s"?
ar: نقل جميع العناصر (%s) من الحافظة إلى داخل "%s"؟
it: Spostare tutti gli elementi (%s) dalla clipboard in "%s"?

# mess.movecb_after
source: Move all elements (%s) from the clipboard to the position after "%s"?
ar: نقل جميع العناصر (%s) من الحافظة إلى الموضع بعد "%s"؟
it: Spostare tutti gli elementi (%s) dalla clipboard alla posizione dopo "%s"?

# rm.saveDoc
source: Save
ar: حفظ
it: Salva

# rm.viewDoc
source: View
ar: عرض
it: Mostra

# rm.saveDocShow
source: Save and view page
ar: حفظ وعرض الصفحة
it: Salva e visualizza pagina

# rm.saveCloseDoc
source: Save and close
ar: حفظ وإغلاق
it: Salva e chiudi

# rm.saveCloseAllDocs
source: Save and close all
ar: حفظ وإغلاق الكل
it: Salva e chiudi tutto

# rm.saveNewDoc
source: Save and create a new one
ar: حفظ وإنشاء جديد
it: Salva e creane uno nuovo

# rm.newDoc
source: New
ar: جديد
it: Nuovo

# rm.duplicateDoc
source: Duplicate
ar: إنشاء نسخة جديدة
it: Duplica

# labels.recordDuplicated
source: The record has been duplicated.
ar: تم إنشاء نسخة جديدة من السجل.
it: Il record è stato duplicato.

# rm.closeDoc
source: Close
ar: إغلاق
it: Chiudi

# rm.clearCache_thisPage
source: This page
ar: هذه الصفحة
it: Questa pagina

# rm.clearCache_all
source: Clear FE cache
ar: مسح ذاكرة التخزين المؤقت للواجهة الأمامية
it: Svuota cache di frontend

# rm.clearCache_pages
source: Clear Page Cache
ar: مسح ذاكرة التخزين المؤقت للصفحة
it: Svuota Cache di Pagina

# rm.clearCache_allTypo3Conf
source: Clear cache in typo3conf/
ar: مسح ذاكرة التخزين المؤقت في typo3conf/
it: Svuota cache in typo3conf/

# rm.clearCacheMenu_all
source: Clear all caches
ar: مسح جميع ذواكر التخزين المؤقت
it: Svuota tutte le cache

# rm.clearCacheMenu_pages
source: Clear page content cache
ar: مسح ذاكرة التخزين المؤقت لمحتوى الصفحة
it: Svuota la cache del contenuto di pagina

# rm.clearCacheMenu_allTypo3Conf
source: Clear configuration cache
ar: مسح ذاكرة التخزين المؤقت للتكوين
it: Svuota cache di configurazione

# flushPageCachesTitle
source: Flush frontend caches
ar: مسح ذاكرة التخزين المؤقت للواجهة الأمامية
it: Svuota le cache del frontend

# flushPageCachesDescription
source: Clear frontend and page-related caches.
ar: مسح ذواكر التخزين المؤقت المتعلقة بالواجهة الأمامية وبالصفحة.
it: Svuota le cache di frontend e di pagina.

# flushAllCachesTitle2
source: Flush all caches
ar: مسح جميع ذواكر التخزين المؤقت
it: Svuota tutte le cache

# flushAllCachesDescription2
source: Clear all system-related caches, including localization, extension configuration, file caches and opcode caches. Rebuilding this cache may take some time.
ar: مسح جميع ذواكر التخزين المؤقتة المتعلّقة بالنظام، بما في ذلك التوطين، تكوين الإضافة، ذاكرة التخزين المؤقت الخاصة بالملفات وبالعمليات البرمجية. قد تستغرق إعادة بناء ذاكرة التخزين المؤقت هذه بعض الوقت.
it: Svuota tutte le cache di sistema, incluse quelle di localizzazione, configurazione estensione, file e opcode. Ricostruire questa cache potrebbe richiedere del tempo.

# flushCaches.error
source: An error occurred
ar: حدث خطأ ما
it: Si è verificato un errore

# flushCaches.error.description
source: An error occurred while clearing the cache. It is likely not all caches were cleared as expected.
ar: حدث خطأ أثناء مسح ذاكرة التخزين المؤقت. من المحتمل أن لا يتم مسح جميع الذواكر كما هو مُتوقع.
it: Si è verificato un errore durante lo svuotamento della cache. È probabile che non tutte le cache siano state svuotate come previsto.

# rm.adminFunctions
source: Admin functions
ar: وظائف المشرف
it: Funzioni di amministrazione

# rm.edit
source: Edit
ar: تعديل
it: Modifica

# rm.export
source: Export
ar: تصدير
it: Esporta

# rm.delete
source: Delete
ar: حذف
it: Elimina

# message.header.fileNotDeletedHasReferences
source: File not deleted
ar: لم يتم حذف الملف
it: File non eliminato

# message.description.fileNotDeletedHasReferences
source: The file "%s" cannot be deleted since it is still used at the following places
ar: لا يمكن حذف المِلَفّ "%s" لأنه لا يزال قيد الاستخدام في الأماكن التالية
it: Il file "%s" non può essere eliminato poiché è ancora utilizzato, come di seguito indicato

# message.header.folderNotDeletedHasFilesWithReferences
source: Folder not deleted
ar: لم يتم حذف المجلد
it: Cartella non eliminata

# message.description.folderNotDeletedHasFilesWithReferences
source: The folder cannot be deleted since it still contains files in use.
ar: لا يمكن حذف المجلد لأنه لا يزال يحتوي على ملفات قيد الاستخدام.
it: La cartella non può essere eliminata in quanto contiene dei file in uso.

# message.header.fileHasBrokenReferences
source: File has broken references
ar: الملف لديه مراجع مُعطّلة
it: Il file ha dei riferimenti interrotti

# message.description.fileHasBrokenReferences
source: The file has %s broken reference(s) but it will be deleted regardless.
ar: يحتوي الملف على %s مرجع(مراجع) مُعطّل(ة)، ولكن سيتم حذفه(ا) بغض النظر عن ذلك.
it: Il file ha %s riferimenti interrotti, ma verrà eliminato comunque.

# message.header.fileNotFound
source: File not found
ar: لم يتم العثور على الملف
it: File non trovato

# message.description.fileNotFound
source: The file %s is not found, possible already removed.
ar: لم يتم العثور على الملف %s ، رُبما تمت إزالته بالفعل.
it: Il file %s non è stato trovato, forse era già stato rimosso.

# message.header.fileDeleted
source: File deleted
ar: تم حذف الملف
it: File eliminato

# message.description.fileDeleted
source: The file "%s" was successfully deleted.
ar: تم حذف الملف "%s" بنجاح.
it: Il file "%s" è stato eliminato.

# message.header.folderDeleted
source: Folder deleted
ar: المجلد محذُوف
it: Cartella eliminata

# message.description.folderDeleted
source: The folder "%s" was successfully deleted.
ar: تم حذف المجلّد "%s" بنجاح.
it: La cartella "%s" è stata eliminata.

# buttons.exit
source: Exit
ar: خروج
it: Esci

# buttons.selMenu_modules
source: MODULES
ar: الوِحدَات
it: MODULI

# buttons.clear
source: Clear
ar: مسح
it: Svuota

# buttons.clipboard
source: Clipboard
ar: الحافظة

# buttons.removeAll
source: Remove all
ar: إزالة الكل
it: Rimuovi tutto

# buttons.toggleLinkExplanation
source: Toggle link explanation
ar: تبديل شرح الرابط
it: Mostra/Nascondi codifica collegamento

# buttons.toggleSlugExplanation
source: Toggle manual URL segment
ar: تبديل جزء الرابط اليدوي
it: Attiva/Disattiva modifica manuale

# buttons.recreateSlugExplanation
source: Recalculate URL segment from page title
ar: إعادة تكوين جزء URL من عنوان الصفحة
it: Ricalcola Segmento URL da Titolo della Pagina

# buttons.deactivateMfa
source: Deactivate multi-factor authentication
ar: إلغاء تفعيل المُصادقة مُتعددة العناصر
it: Disattiva autenticazione multi-fattore

# buttons.deactivateMfaProvider
source: Deactivate %s
ar: تعطيل %s
it: Disattiva %s

# deactivateMfa.confirmation.text
source: Are you sure you want to deactivate all active providers? This action can not be undone and will be applied immediately!
ar: هل أنت متأكد من أنك تريد إلغاء تفعيل جميع المُوردين النشطين؟ لا يمكنك التراجع عن هذا الإجراء وسيتم تطبيقه فوراً!
it: Sei sicuro di voler disattivare tutti i provider attivi? Questa azione non può essere annullata e sarà applicata immediatamente!

# deactivateMfaProvider.confirmation.text
source: Are you sure you want to deactivate %s? This action can not be undone and will be applied immediately!
ar: هل أنت متأكد من أنك تريد إلغاء تفعيل %s؟ لا يمكن التراجع عن هذا الإجراء وسيتم تطبيقه فوراً!
it: Sei sicuro di voler disattivare %s? Questa azione non può essere annullata e sarà applicata immediatamente!

# slugCreation.success.page
source: This page will be reachable via %s
ar: هذه الصفحة ستكون مُتاحة عبر %s
it: Questa pagina sarà raggiungibile via %s

# slugCreation.success.record
source: The URL part of this record will be %s
ar: جزء عنوان URL من هذا السجل سيكون %s
it: L'URL di questo record sarà %s

# slugCreation.error
source: The requested URL is already in use, but %s will be used instead
ar: عنوان URL المطلوب قيد الاستخدام حالياً، ولكن سيتم استخدام %s بدلاً من ذلك
it: L'URL richiesto è già in uso, ma %s sarà utilizzato al suo posto

# cm.copy
source: Copy
ar: نسخ
it: Copia

# cm.copyrelease
source: Copy release
ar: نسخ الإصدار
it: Copia release

# cm.cut
source: Cut
ar: قص
it: Taglia

# cm.cutrelease
source: Cut release
ar: قص الإصدار
it: Versione in rilascio (cut release)

# cm.view
source: Show
ar: عرض
it: Mostra

# cm.edit
source: Edit
ar: تعديل
it: Modifica

# cm.editcontent
source: Edit content
ar: تعديل المحتوى
it: Modifica contenuto

# cm.editMetadata
source: Edit Metadata of this file
ar: تعديل بيانات التعريف لهذا الملف
it: Modifica i metadati di questo file

# cm.editColumns
source: Edit columns
ar: تعديل الأعمدة
it: Modifica colonne

# cm.new
source: New
ar: جديد
it: Nuovo

# cm.newSubpage
source: New subpage
ar: لا توجد صفحات فرعية
it: Nuova sottopagina

# cm.newFilemount
source: New Filemount
ar: ملف جديد
it: Nuovo Filemount

# cm.pasteinto
source: Paste into
ar: لصق في داخل
it: Incolla dentro

# cm.pasteafter
source: Paste after
ar: لصق بعد
it: Incolla dopo

# cm.select
source: Select
ar: تحديد
it: Seleziona

# cm.selectFile
source: Select %s
ar: حَدّد %s
it: Seleziona %s

# cm.deselect
source: Deselect
ar: إلغاء التحديد
it: Deseleziona

# cm.selectto
source: Select to
ar: حدد إلى
it: Seleziona a

# cm.deselectto
source: Deselect to
ar: إلغاء التحديد إلى
it: Deseleziona a

# cm.delete
source: Delete
ar: حذف
it: Elimina

# cm.hide
source: Hide
ar: إخفاء
it: Nascondi

# cm.unhide
source: Unhide
ar: إظهار
it: Rendi visibile

# cm.online
source: Turn online
ar: تشغيل عبر الإنترنت
it: Metti online

# cm.offline
source: Turn offline
ar: إيقاف الاتصال
it: Metti offline

# cm.upload
source: Upload Files
ar: تحميل الملفات
it: Carica File

# cm.rename
source: Rename
ar: إعادة التسمية
it: Rinomina

# cm.replace
source: Replace
ar: إستبدال
it: Sostituisci

# cm.open
source: Open
ar: فتح
it: Apri

# cm.save
source: Save
ar: حفظ
it: Salva

# cm.unzip
source: Unzip
ar: فك الضغط
it: Decomprimi

# cm.info
source: Info
ar: معلومات

# cm.createnew
source: Create new
ar: إنشاء جديد
it: Crea Nuovo

# cm.createnew.link
source: Create new %s
ar: إنشاء جديد %s
it: Crea nuovo %s

# cm.tempMountPoint
source: Mount as treeroot
ar: تحميل كـ treeroot
it: Vai a questo sottoalbero

# cm.copyPage_into
source: Copy page into
ar: نسخ الصفحة إلى داخل
it: Copia pagina dentro

# cm.copyPage_after
source: Copy page after
ar: نسخ الصفحة بعد
it: Copia pagina dopo

# cm.movePage_into
source: Move page into
ar: نقل الصفحة إلى داخل
it: Sposta pagina dentro

# cm.movePage_after
source: Move page after
ar: نقل الصفحة بعد
it: Sposta pagina dopo

# cm.copyFolder_into
source: Copy folder into
ar: نسخ المجلد إلى داخل
it: Copia cartella dentro

# cm.moveFolder_into
source: Move folder into
ar: نقل المجلد إلى داخل
it: Sposta cartella dentro

# cm.createNewRelation
source: Create new relation
ar: إنشاء علاقة جديدة
it: Crea nuova relazione

# cm.branchActions
source: Branch Actions
ar: إجراءات الفرع
it: Azioni Ramo

# cm.copyPasteActions
source: Page Actions
ar: إجراءات الصفحة
it: Azioni Pagina

# cm.collapseBranch
source: Collapse Branch
ar: طي الفرع
it: Contrai Ramo

# cm.expandBranch
source: Expand Branch
ar: توسيع الفرع
it: Espandi Ramo

# cm.more
source: More options...
ar: خيارات أكثر...
it: Altre opzioni...

# cm.allowedFileExtensions
source: Allowed file extensions
ar: ملف الإضافات المسموح بها
it: Estensioni file consentite
